{"sessions":[{"sessionId":1240476277,"scheduleId":-664534614,"title":"Tout ce que vous avez toujours voulu savoir sur les lambdas et plus encore","summary":"Tout ce que vous avez toujours voulu savoir sur les lambdas et bien plus encore.\r\nCette université a pour but de répondre à un certain nombre de question que\r\ntous développeurs Java se posent à l\u0027aune de la sortie de Java 8,\r\ndonc une serie de pourquois:\r\n  pourquoi les lambdas ?\r\n  pourquoi la syntaxe ?\r\n  pourquoi du code dans les interfaces ?\r\n  pourquoi l\u0027amour ?\r\nsuivi d\u0027une serie de comment:\r\n  comment on crée sa propre \u0027functional interface\u0027 ?\r\n  comment on crée une lambda serializable ?\r\n  comment on utilise une lambda avec des APIs écritent avant java 8 ?\r\n  coment on fait des bébés ?","roomId":1975599280,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-498118130],"speakers":[{"speakerId":-498118130,"name":"Rémi Forax"}]},{"sessionId":1284805311,"scheduleId":-626596561,"title":"Introduction et mise en pratique de Java EE 7","summary":"Parmi les nouveautés de Java EE 7 sorti il y a quelques moi, nous pouvons notamment citer :\r\n- JAX-RS 2 et son API client\r\n- Le remaniement en profondeur de JMS 2\r\n- Les WebSockets qui permettent des liaisons full-duplex\r\n- Une API Batch pour écrire des traitements par lot...\r\n\r\nEnsemble, ces APIs vont simplifier vos futurs développements Java EE et vous rendre plus productif!\r\n\r\nCe laboratoire vous propose une introduction à Java EE 7. En y participant, vous apprendrez Java EE 7 et ses nouveautés. Vous serez amené à écrire, pas à pas, une application complète qui tournera sur GlassFish 4 et WildFly 8","roomId":96587449,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-142884038,2102219262,1180681214],"speakers":[{"speakerId":-142884038,"name":"Antoine Sabot-Durand"},{"speakerId":2102219262,"name":"David Delabassee"},{"speakerId":1180681214,"name":"Alexis Hassler"}]},{"sessionId":1286987986,"scheduleId":350972059,"title":"Chez les barbus: master chef et puppet show","summary":"Développeurs Java seniors, François et Romain ont découvert le monde des opérations en mettant en place des stratégies de livraison continue (Continuous Delivery). C\u0027est un retour d\u0027expériences croisées qu\u0027ils vous proposent. \r\n\r\nLeur but: lever le voile sur cet univers et ses contraintes, vous faire découvrir comment leurs techniques et leurs outillages respectifs (*Chef* pour le premier et *Puppet* pour le second) peuvent vous libérer du stress de la mise en production.\r\n\r\nTags: DevOps, Continuous Delivery, Puppet, Chef, Jenkins, Java, Linux, Packaging, security","roomId":907457591,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[551422331,-2126651917],"speakers":[{"speakerId":551422331,"name":"François le Droff"},{"speakerId":-2126651917,"name":"Romain Pelisse"}]},{"sessionId":1347876213,"scheduleId":-1396971600,"title":"Construire une application réelle de jeux en ligne avec NoSQL","summary":"Les jeux en ligne doivent manipuler une très grande quantité de données avec un taux d’exigence sur la qualité de service très élevé. Le challenge quotidien sur pmu.fr: 30000 parieurs jouent en même temps, à la dernière seconde avant le départ!\r\n\r\nNous présenterons les technologies NoSQL utilisées pour adresser les défis que pose la construction d’un tel système. L’exposé sera aussi l’occasion de voir une démo live, des outils pour mesurer les performances et aussi des patterns de programmation.\r\n\r\nTechnologies: Services REST, NoSQL, Caches distribués, WebSockets, Couchbase, Vert.x, Redis","roomId":1975599280,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-1570500676],"speakers":[{"speakerId":-1570500676,"name":"Ferda Tartanoglu"}]},{"sessionId":1390359293,"scheduleId":978361807,"title":"The Art of Parsing","summary":"What attracts researchers starting from the 60s till nowadays? What is studied in university by engineers in computer science and then successfully forgotten? What is at the heart of the compilers used daily by any software developer? Parsers!\r\nFrom a practical point of view using a small pill of theory, this session will bring lights on questions like: if there is so many parser-generators based on formal theory, then why javac, GCC and Clang are all hand-written? And how we, insiders of the world of parsing, do this at SonarSource for languages like Java, C/C++, C#, JavaScript, Python, COBOL?","roomId":843733077,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[2106700118,1278658944],"speakers":[{"speakerId":2106700118,"name":"Evgeny Mandrikov"}]},{"sessionId":1413443350,"scheduleId":-1175048150,"title":"BOF Paris Datageeks","summary":"Paris datageeks, est une communauté de passionnés de tous les sujets autour de la \"data\". Il se veut inclusif de toutes les thématiques gravitant autour du sujet. Du Big Data, Nosql,Hadoop, Spark, Search, aux sujets plus pointus en machine learning, ainsi qu\u0027aux systèmes distribués. Chaque meetup réunit plus de 150+ passionnés par tous ces sujets.  Vous pouvez voir nos ancoennes sessions  ici\r\n\r\nhttp://www.meetup.com/Paris-Datageeks/\r\n\r\nPour Devoxx, nous souhaitons  organiser une session de lightnings talks, ou si l\u0027occasion se manifeste, profiter d\u0027un des speakers sur place pour une conférence.","roomId":3346361,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[2002720190,1079113948],"speakers":[{"speakerId":2002720190,"name":"Sam Bessalah"}]},{"sessionId":1671761543,"scheduleId":691862029,"title":"Embracing HTTP in the era of API’s","summary":"It’s all about REST in today’s world. Every service you look at, people are providing a REST API for it. Surprisingly, very few of these API’s are even REST, if we’re talking about REST as in a system that abides by a series of constraints making it RESTful. But the positive note is that it has brought to light the power of HTTP as an application protocol, something very often undervalued and misunderstood, even today. \r\n\r\nThis talk is going to focus on the core values of HTTP for what it is. It will cover all aspects including\r\n\r\n●\tHeaders\r\n●\tError Management\r\n●\tVerbs\r\n●\tContent Negotiation\r\n●\tCaching\r\n●\tSecurity\r\n●\tMessages\r\n●\tRequest and Responses\r\n","roomId":907457591,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[-865901387],"speakers":[{"speakerId":-865901387,"name":"Hadi Hariri"}]},{"sessionId":1759824013,"scheduleId":901920556,"title":"Le métier de Développeur","summary":"Le métier de développeur","roomId":307138528,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-824029395],"speakers":[{"speakerId":-824029395,"name":"Guy Mamou-Mani"}]},{"sessionId":1804158941,"scheduleId":-160764352,"title":"ZeroMQ : des super sockets pour insérer facilement 400 msg/s dans Elasticsearch","summary":"ZeroMQ est une bibliothèque qui permet de simplifier le développement d\u0027applications distribuées, en prenant en charge la gestion des erreurs, et en implémentant directement des patterns de haut niveau comme le publish subscribe.\r\n\r\nAprès une rapide introduction à ZeroMQ, cette session présentera du code en Javascript et Java pour insérer à haute vitesse des logs Apache dans Elasticsearch, en vue d\u0027une analyser à l\u0027aide de Kibana. Une démonstration permettra de comparer avec une insertion HTTP classique.","roomId":-2047228984,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[2079929572],"speakers":[{"speakerId":2079929572,"name":"Bertrand Paquet"}]},{"sessionId":1985169058,"scheduleId":-946905069,"title":"Ansible in action - le provisionning au bon niveau d\u0027abstraction","summary":"Vous êtes **DevOps** dans l\u0027âme ? ou vous montez un produit sur le cloud qui doit être scalable de base ? mais vous trouvez définitivement **Chef ou Puppet trop complexes** pour le service rendu, alors vous aller aimer **Ansible** ! \r\n\r\nCette présentation sera l\u0027occasion de découvrir, **Ansible**, un outil de provisioning avec le \"juste niveau d\u0027abstraction\" au travers des bonnes pratiques et d\u0027un réel retour d\u0027expérience.","roomId":1975599280,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-279300424],"speakers":[{"speakerId":-279300424,"name":"Olivier Girardot"}]},{"sessionId":1992823991,"scheduleId":1266272986,"title":"Golo, de la sucrette syntaxique pour vos applications Java","summary":" A l\u0027opposé du créateur de **Golo**, je suis plutôt typé \"informatique de gestion\", ancien amoureux de PlayFramework **V1** (c\u0027est important). Avec Golo, j\u0027ai pu agréger différentes librairies Java pour recréer une stack web complète et légère \"à la Play\". Ma démarche peut être appliquée à d\u0027autres types de projets, d\u0027autres langages dynamiques (je fais la même chose en Groovy), mais elle a 2 finalités, démontrer que :\r\n- Golo est \"petit mais costaud\"\r\n- Quel que soit votre niveau en Java, vous pouvez faire de grandes choses","roomId":-2049135608,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[1896412449],"speakers":[{"speakerId":1896412449,"name":"Philippe Charrière"}]},{"sessionId":2019661514,"scheduleId":-2136237817,"title":"Go pour Javaneros","summary":"Si tu aimes Java, il est temps de découvrir Go.\r\n\r\nUne présentation du langage de programmation Go du point de vue d\u0027un développeur Java.  Go a été créé avec le but de faciliter l\u0027implementation de systèmes d\u0027information complexes et avec des contraintes de performance importants.\r\n\r\nPendant cette présentation on verra comment on peut interpreter les différents parties du langage du point de vue Java, du systèmes de types, à la concurrence, en passant par les interfaces.","roomId":1975599282,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[628240476],"speakers":[{"speakerId":628240476,"name":"Francesc Campoy Flores"}]},{"sessionId":2031015174,"scheduleId":-2087606375,"title":"BOF du Paris Glass User Group","summary":"Venez découvrir le Paris Glass User Group, la communauté des développeurs et passionnés de SmartGlass de Paris. (Google Glass, Vuzix, Laster, Meta...)","roomId":102724459,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[-195068034],"speakers":[{"speakerId":-195068034,"name":"Alain Regnier"}]},{"sessionId":2046382164,"scheduleId":603362346,"title":"Se plugger dans le compilateur Java","summary":"Le compilateur Java permet aux plugins (annotation-processors) d’analyser votre code source et de générer d’autre code à compiler. Cette technique puissante mérite d’être mieux connue ! On la verra dans quelques projets open-source, tels que Dagger (de Square), un système d’injection de dépendances à la Guice, et AutoValue (de Google), qui simplifie la création des classes immuables. On regardera aussi comment écrire ses propres plugins.","roomId":843733077,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[1430938613],"speakers":[{"speakerId":1430938613,"name":"Éamonn McManus"}]},{"sessionId":2070397675,"scheduleId":2085616459,"title":"Créons un web component avec Polymer","summary":"Les web components sont sans doute l\u0027une des évolutions majeures du développement web qui nous attend pour 2014-2015. À travers ce Tools In Action, nous allons découvrir de quoi il s\u0027agit. Mais comme dans \"Tools In Action\" il y a \"Action\", alors nous allons voir leur mise en oeuvre grâce à la librairie Polymer.\r\nPrenez part à un chouette voyage dans le monde des web components !\r\n","roomId":-2049135608,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[858699187,-1929089682],"speakers":[{"speakerId":858699187,"name":"Julien JAKUBOWSKI"},{"speakerId":-1929089682,"name":"Romain Linsolas"}]},{"sessionId":-1732270905,"scheduleId":-2114704206,"title":"BOF Devoxx4Kids","summary":"Devoxx4Kids est une initiative mondiale qui organise des journées d\u0027atelier d\u0027initiation à la programmation et de découverte de l\u0027informatique en général pour les enfants. Une sorte de Devoxx pour le mini geeks, avec des robotes, du code et du fun :)\r\n\r\nLors de ce BOF, les membres qui portent l\u0027initiative en France et en Suisse seront là pour répondre à vos questions et vous donner tous les conseils utiles pour pouvoir vous lancer à votre tour","roomId":3346361,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[1828996194,1106895958,690000469,195470103],"speakers":[{"speakerId":1828996194,"name":"Claude Falguiere"},{"speakerId":1106895958,"name":"Xavier Bourguignon"},{"speakerId":690000469,"name":"Audrey NEVEU"},{"speakerId":195470103,"name":"Daniel De Luca"}]},{"sessionId":-1687680873,"scheduleId":23896347,"title":"Building a Real-Time Risk Analysis System in Java","summary":"Notre application de Trading d\u0027Analyse de Risque temps réel doit maintenir une base de 100 millions de lignes (Xmx\u003d64G) avec du flux de 5000 message/sec. Nos utilisateurs (répartis à Paris, Londres, NY et HK) suivent plus de 100 indicateurs tels que la sensibilité au marché et les estimations de gains : ils sont agrégés en temps réel avec des règles métiers complexes.\r\nNous vous proposons un retour d’expérience afin d\u0027expliquer nos choix technologiques : le design de l\u0027application, la librairie ActivePivot pour agréger des indicateurs en temps réel et la diffusion des impacts en temps-réel.\r\n ","roomId":1975599281,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[932506618,1729985054],"speakers":[{"speakerId":932506618,"name":"Alexandre Navarro"},{"speakerId":1729985054,"name":"Benoît Lacelle"}]},{"sessionId":-1654101177,"scheduleId":1054795329,"title":"BOF Java EE","summary":"La version de CDI 1.2 sort à peine et nous devons déjà penser à la future version majeure intégrée à Java EE 8.\r\nL\u0027Expert Group CDI 1.1 a déjà quelques pistes pour CDI 2.0, mais tout reste à faire. Votre retour sur CDI nous est précieux pour vous fournir une version qui vous sera utile aussi bien comme pierre angulaire de Java EE que comme solution légère de gestion de composants pour Java SE voire Android.\r\nLa proposition de spécification pour CDI 2.0 reste à écrire, venez donc contribuer à son contenu, voire à sa réalisation. Bref, un BoF d\u0027importance pour le futur de Java EE.","roomId":102724459,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-142884038],"speakers":[{"speakerId":-142884038,"name":"Antoine Sabot-Durand"}]},{"sessionId":-1633851819,"scheduleId":576041295,"title":"Bienvenue à Devoxx France 2014","summary":"Mot d\u0027accueil par les 4 organisateurs de Devoxx France. Quelques informations pratiques, un peu d\u0027informations sur notre thème et sur nos keynotes.","roomId":307138528,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[-65331152,-683890691,557142915,-1867853932],"speakers":[{"speakerId":-65331152,"name":"Nicolas Martignole"},{"speakerId":-683890691,"name":"Antonio Goncalves"},{"speakerId":557142915,"name":"José Paumard"},{"speakerId":-1867853932,"name":"Zouheir Cadi"}]},{"sessionId":-1505477434,"scheduleId":643694372,"title":"50 nouvelles choses que l\u0027on peut faire avec Java 8","summary":"Java 8, c\u0027est bien sûr l\u0027arrivée des lambdas, des Stream et des Collectors. Mais ce n\u0027est pas que cela. Plein de nouvelles choses sont aussi offertes : un nouvelle API pour les dates, un nouveau moteur Javascript, une nouvelle version de JavaFX, une nouvelle ConcurrentHashMap, une nouvelle HashMap, des nouveautés dans le domaine de la concurrence, et toutes sortes de petites choses qui vont nous faciliter la vie, que l\u0027on se propose de passer en revue ici. \r\n","roomId":1975599281,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[557142915],"speakers":[{"speakerId":557142915,"name":"José Paumard"}]},{"sessionId":-1467226086,"scheduleId":9460439,"title":"Extremist Programming : l\u0027art de s\u0027amuser avec du code","summary":"Bien sûr notre métier est sérieux ; le Software Craftmanship n\u0027est-il pas avant tout le professionnalisme ? Bien sûr le progrès vient d\u0027articles scientifiques ardus et de nouveaux logiciels complexes.\r\n\r\nMais vous ne rêvez pas parfois de repousser le cadre professionnel habituel ? D\u0027aller plus loin et d\u0027explorer ? De vous amuser avec du code jusqu\u0027à ce que ça devienne n\u0027importe quoi ?\r\n\r\nDans cette session nous vous présenterons des expériences ésotériques, des jeux bizarres et des joyeux délires qui font réfléchir. Réfléchir ? D\u0027habitude on n\u0027a jamais le temps !","roomId":1707225347,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[2108720956,-332665943],"speakers":[{"speakerId":2108720956,"name":"Eric Lefevre-Ardant"},{"speakerId":-332665943,"name":"Cyrille Martraire"}]},{"sessionId":-1456799692,"scheduleId":454502085,"title":"Utiliser TLS sans se tromper","summary":"Le protocole de cryptographie TLS\r\n(ex-SSL) permet de s\u0027assurer de l\u0027authenticité de la machine à qui on\r\nse connecte (en HTTP, ou bien avec un autre protocole). Mais son\r\nutilisation correcte depuis un programme n\u0027est pas facile, comme l\u0027a\r\nmontré le fameux article « The Most Dangerous Code in the World :\r\nValidating SSL Certificates in Non-Browser Software ». On va donc\r\nparler de ce que TLS garantit... et de ce qu\u0027il en garantit pas.","roomId":907457591,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-95615161],"speakers":[{"speakerId":-95615161,"name":"Stéphane Bortzmeyer"}]},{"sessionId":-1446964072,"scheduleId":1293792270,"title":"Je fais ce que je veux avec Java EE","summary":"Fini le temps où Java EE ne permettait que des application basiques, avec JSF / EJB / JPA. Aujourd\u0027hui Java EE 7 s’est assoupli et intègre un puissant moteur d’extension : CDI. Si on ajoute à ce dernier la possibilité de développer des connecteurs via JCA, les possibilités deviennent immenses.\r\n\r\nPendant cette université, vous apprendrez à utiliser le projet DeltaSpike pour enrichir vos applications ou créer vos propres extensions CDI. Puis vous découvrirez comment JCA et les Message-Driven Beans permettent d’ajouter le support de nouveaux formats et protocoles à Java EE en toute simplicité.","roomId":1975599281,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[1180681214,-142884038],"speakers":[{"speakerId":1180681214,"name":"Alexis Hassler"},{"speakerId":-142884038,"name":"Antoine Sabot-Durand"}]},{"sessionId":-1435881633,"scheduleId":-135820775,"title":"La planète Groovy","summary":"Parlons de Groovy, de son écosystème avec ces projets phares tels que Grails ou Gradle, et passons un bon moment ensemble à discuter de nos retours d\u0027expérience, des évolutions futures, voire plus si affinités !","roomId":102724395,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[1452356424,1893774315],"speakers":[{"speakerId":1452356424,"name":"Guillaume Laforge"},{"speakerId":1893774315,"name":"Cédric Champeau"}]},{"sessionId":-1432522410,"scheduleId":-82177772,"title":"Tests de Performance Continue","summary":"Une application performante c’est plus de clients sur un site internet, plus de satisfaction des utilisateurs et un meilleur ROI. Mais souvent les tests de performance soient intégrés trop tard dans le cycle de vie d’une application. Remédions à cela et industrialisons nos tests de performance. Apportez vos laptops car nous allons jouer avec :\r\n\r\n* Gatling : un outil en Scala permettant de scripter les scénarios,\r\n* Jenkins : l’usine logicielle bien connue,\r\n* Jmxtrans : un outil pour exposer des informations JMX vers Graphite\r\n* Graphite : un outil simple de visualisation de données","roomId":102724395,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[1991784589,-794740832],"speakers":[{"speakerId":1991784589,"name":"Guillaume Arnaud"},{"speakerId":-794740832,"name":"William Montaz"}]},{"sessionId":-1376122537,"scheduleId":-1053306542,"title":"One Java library to rule all security protocols","summary":"Et si une même librairie Java permettait de s’authentifier sur Facebook, Twitter, Google, myopenid.com, un serveur CAS, en basic auth… aussi bien dans une application Java protégée par Spring Security ou Shiro que dans une application Play en Scala ?\r\n\r\nC’est exactement ce que permet la librairie pac4j que j’ai créée : www.pac4j.org.\r\n\r\nAprès avoir expliqué son mécanisme et son API, nous regarderons ensemble, dans le code, sa mise en place pour les différentes plateformes : Spring Security, Shiro, CAS et Play.\r\n","roomId":907287738,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-1311190562],"speakers":[{"speakerId":-1311190562,"name":"Jérôme Leleu"}]},{"sessionId":-1141607307,"scheduleId":399101661,"title":"git-deliver : le déploiement pro, pas que pour Java","summary":"Sorti du monde Java, avec ses mécanismes de déploiement, ses versions Maven, etc., on est souvent réduit à écrire des scripts bancals quand on veut déployer de manière simple, traçable et atomique des fichiers de configuration, des scripts, du code node.js, PHP, (g)rails, Puppet, etc.\r\n\r\nVous avez été impressionnés par la simplicité du déploiement Ruby on Rails de Heroku par un simple \"git push\" ? Savez-vous que vous pouvez faire la même chose sur vos propres serveurs avec git deliver ?","roomId":1975599280,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-1024237351,664366839],"speakers":[{"speakerId":-1024237351,"name":"Sylvain Veyrié"},{"speakerId":664366839,"name":"Arnaud Bétrémieux"}]},{"sessionId":-1128023361,"scheduleId":-759194179,"title":"Introduction aux \"Reactive Streams\"","summary":"Les applications réactives sont partout! Les \"Reactive Extensions\" ont percé la défense de ThoughtWorks, les grands du web l\u0027utilisent en première ligne et les éditeurs affutent leur support pour ces architectures spécifiques. \r\nEt si ces mêmes acteurs se mettaient d\u0027accord sur le contrat de ce modèle ? C\u0027est l\u0027opportunité rêvée pour découvrir ce qu\u0027apporte réellement ou non la programmation \"réactive\", sans parti-pris sur une technologie si ce n\u0027est la JVM. Résilience ? Performance ? Latence ? Autant d\u0027espoirs pour créer de rapides micro services REST ou des outils d\u0027ingestion haut volume.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[534072165],"speakers":[{"speakerId":534072165,"name":"Stephane Maldini"}]},{"sessionId":-1058433980,"scheduleId":289874014,"title":"HAProxy+Keepalived le loadbalancer in house facile","summary":"Durant cette session nous mettrons en oeuvre un load balancer open source en haute disponibilité en quelques lignes de shell.\r\nNous exploreront les stratégies de répartition de charge, les éléments de performances et nous bencherons la solution mise en place pour observer sa performance.\r\nLe load balancing c\u0027est facile ! Ne croyez pas vos Ops ni les vendeurs de matériel !","roomId":907317529,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-1470566806],"speakers":[{"speakerId":-1470566806,"name":"Nicolas Helleringer"}]},{"sessionId":-1055719799,"scheduleId":1733312182,"title":"Des SSII aux SS3I ? Sociétés au service des individus de l’ingénierie informatique","summary":"Aujourd’hui, vous n’êtes bien souvent que des Ressources Humaines. Beaucoup d’entre vous n’ont que de mauvaises expériences des fameuses SSII… Heureusement, certaines essaient de proposer de nouveaux modèles, mais pour que vous deveniez des Richesses Humaines, il ne tient qu’à vous de faire une inversion de contrôle !\r\nL’équipe des Brown Bag Lunches RH vous propose un voyage au cœur des SSII telles qu’elles sont aujourd’hui et telles qu’elles pourraient devenir grâce à l’enthousiasme de certains RH et, surtout, grâce aux développeurs.","roomId":1707225347,"experience":"","sponsored":false,"tags":["\u0026","Startups","innovation"],"speakerIds":[-874753285,1844108655],"speakers":[{"speakerId":-874753285,"name":"Aude Amarrurtu"},{"speakerId":1844108655,"name":"Betty MOREAU"}]},{"sessionId":-1050775232,"scheduleId":-804916218,"title":"Techniques de modélisation avancée avec Cassandra","summary":"_Vous avez toujours voulu optimiser vos modèles pour une lecture/écriture rapide sous Cassandra. Vous êtes vous jamais demandé comment bien utiliser les fonctionnalités spéciales de Cassandra telles que Time-To-Live et le Timestamp assigné automatiquement aux données ?_\r\n \r\nPendant cette session, vous saurez comment tirer vraiment profit de Cassandra avec les super techniques de modélisation, des usages très exotiques auxquels on ne pense pas forcément et des petits katas de modélisation en live","roomId":1707225347,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[489184781],"speakers":[{"speakerId":489184781,"name":"DuyHai DOAN"}]},{"sessionId":-999062956,"scheduleId":578731764,"title":"Programmer avec Emotion","summary":"Ne manquez pas vendredi matin la première présentation de la journée. Geert Bevin est développeur et musicien depuis de nombreuses années. Quels sont les liens entre l\u0027apprentissage de la musique et le métier du développeur ? \r\n\r\nVenez découvrir aussi la Eigenharp, un instrument de musique révolutionnaire de la société Eigenlabs. Mélange de numérique et de digital, à la frontière de nos connaissances actuelles en musique.\r\n\r\nCette keynote sera un mélange d\u0027émotion, de technologie et de réflexions sur notre métier.","roomId":307138528,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[-1696480317],"speakers":[{"speakerId":-1696480317,"name":"Geert Bevin"}]},{"sessionId":-969176577,"scheduleId":-1993426380,"title":"Javascript as a first programming language : votre IC prête pour la révolution !","summary":"NodeJs, GruntJs, Bower, Karma, ... des buzzwords dont nous entendons parler, que nous voyons passer dans les blogs/articles. Mais à quoi servent-ils ?\r\n\r\nComment industrialiser nos développements Javascript ? Mettre en place des tests unitaires dans une application Web ? Générer de la documentation ? Des métriques qualités ? La couverture de code ? Comme avec Maven ? Nous verrons concrètement comment articuler tous ces outils autour d\u0027une application école, pour démystifier tout  ça.","roomId":1975599281,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[-854186121,1627155998,-1704603637],"speakers":[{"speakerId":-854186121,"name":"Julien Roche"},{"speakerId":1627155998,"name":"Frédéric Dubois"},{"speakerId":-1704603637,"name":"Frédéric Bouquet"}]},{"sessionId":-959673733,"scheduleId":-2045161679,"title":"SonarQube sans quitter son IDE","summary":"Vous utilisez SonarQube au quotidien dans votre entreprise :\r\n\r\n* Marre d\u0027attendre que le serveur d\u0027intégration continue ait relancé une analyse ?\r\n* Envie de vérifier la qualité avant le commit/push ?\r\n* Désireux d\u0027expérimenter rapidement avec les paramétrages de SonarQube ?\r\n\r\nDans ce cas la solution est de lancer des analyses SonarQube directement dans votre IDE.\r\n\r\nVenez assister à cette présentation pour \u003cdel\u003etroller sur les IDE\u003c/del\u003e découvrir en live les fonctionnalités des plugins SonarQube pour Eclipse et IntelliJ.","roomId":907347320,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[1032233258],"speakers":[{"speakerId":1032233258,"name":"Julien HENRY"}]},{"sessionId":-950047447,"scheduleId":-187930284,"title":"{ développeur: \"viens découvrir mongoDB\"}","summary":"Le NoSQL est de plus en plus présent dans les projets Java. Avec plus de 5 millions de téléchargements et plus de 600 grand comptes : MongoDB fait parti des bases leader dans le domaine des bases de données Big Data.\r\n\r\nDans cet atelier pratique, ludique et dynamique : Vous, développeur Java, venez découvrir comment utiliser MongoDB et comment l\u0027intégrer dans un site web.\r\n\r\nOn partira du shell, on passera à l\u0027utilisation de drivers MongoDB en Java, puis on intégrera l\u0027ensemble dans un site web.","roomId":3346362,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[627475204,-859337047,609479933],"speakers":[{"speakerId":627475204,"name":"David Wursteisen"},{"speakerId":-859337047,"name":"Katia Aresti"},{"speakerId":609479933,"name":"Tugdual Grall"}]},{"sessionId":-929798945,"scheduleId":110847448,"title":"Truly Native Java Apps on iOS with RoboVM","summary":"RoboVM is a new open-source project with the goal of bringing Java and other JVM languages to iOS devices. The RoboVM ahead-of-time compiler translates Java bytecode into native code that runs directly on the CPU without the overhead of an interpreter. Access to the iOS Cocoa Touch APIs is provided through a Java to Objective-C bridge enabling the development of apps with truly native UIs and full hardware access. In this talk you will be introduced to RoboVM and we will run some demos.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Mobile"],"speakerIds":[879444831],"speakers":[{"speakerId":879444831,"name":"Niklas Therning"}]},{"sessionId":-918381064,"scheduleId":973127841,"title":"Virtualisation 2.0 et kernel linux","summary":"Historiquement, la virtualisation s\u0027est développée pour partager les ressources d\u0027une même machine tout en garantissant une certaine isolation entre les différents services démarrés. Aujourd\u0027hui, les versions récentes du noyau linux intègrent plusieurs fonctionnalités qui permettent de cloisonner des services tout en partageant un même noyau linux. Utiliser cette approche permet d\u0027économiser les ressources de la machine hôte. \r\nAu cours de cette présentation, je vous présenterai ces aspects du noyau linux :\r\n\r\n* cgroups\r\n* namespaces\r\n* aufs\r\n* lxc","roomId":1975599281,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-54864384],"speakers":[{"speakerId":-54864384,"name":"Jean-Eudes Couignoux"}]},{"sessionId":-904857217,"scheduleId":-262099703,"title":"Cassandra, une nouvelle ère","summary":"Apache Cassandra est un projet qui se développe rapidement; cela a été tout particulièrement le cas l\u0027année passée, qui a vu Cassandra ajouter, entre autres, transactions légères, triggers, virtual nodes, un nouveau modèle de données et un language de requête. Cette présentation expliquera les motivations et le design de ces nouvelles fonctionnalités, avec une attention particulière à leur impact sur le développement d\u0027applications.","roomId":1975599280,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-9912529],"speakers":[{"speakerId":-9912529,"name":"Jonathan Ellis"}]},{"sessionId":-892795004,"scheduleId":-1331872695,"title":"Redis, une base Not Only NoSQL","summary":"Venez découvrir Redis, une base NoSQL clé-valeur avancée, utilisée pour le site du CFP de Devoxx France 2014. Redis est aussi un serveur de données structurés (Set, List, Hash,...) qui peut être utilisé comme base principale en remplacement de votre bonne vieille base SQL. Cas d\u0027usage, retour d\u0027expérience et aussi bonnes pratiques, pour avoir un système fiable et simple.","roomId":1707225347,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-65331152],"speakers":[{"speakerId":-65331152,"name":"Nicolas Martignole"}]},{"sessionId":-815540334,"scheduleId":-1982993219,"title":"Simplon","summary":"Simplon","roomId":307138528,"experience":"","sponsored":false,"tags":["\u0026","Startups","innovation"],"speakerIds":[-1386067427,-1308224739],"speakers":[{"speakerId":-1386067427,"name":"Henri Fournet"},{"speakerId":-1308224739,"name":"Frédéric Bardeau"}]},{"sessionId":-738625297,"scheduleId":-1969000905,"title":"BOF Duchess France","summary":"Duchess France (duchess-france.org) est un JUG féminin ayant pour but de donner de la visibilité aux carrières de femmes dans l\u0027IT et de les inciter à participer à des conférences, hackathons...\r\n\r\nL\u0027objet de ce BOF sera de présenter les membres, les actions réalisées et futures de Duchess France. Le but est d\u0027échanger avec vous sur vos attentes et aussi vous inciter/encourager à participer à nos actions.\r\nNous reviendrons sur les rapprochements avec de nouveaux groupes féminins. Ces rencontres ont été très riches et ont donné lieu à des échanges de contact et des co-organisations d’événements.","roomId":96587449,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-215715693,1621979194,1670026485,1841897698],"speakers":[{"speakerId":-215715693,"name":"Ludwine Probst"},{"speakerId":1670026485,"name":"Amira LAKHAL"},{"speakerId":1841897698,"name":"Mathilde Lemée"}]},{"sessionId":-703795221,"scheduleId":271887370,"title":"BOF Scala","summary":"Comme chaque année - la communauté scala pourra se retrouver pendant Devoxx ;)","roomId":96587449,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[-274817981],"speakers":[{"speakerId":-274817981,"name":"Alexis Agahi"}]},{"sessionId":-691195821,"scheduleId":580332727,"title":"Pourquoi utiliser un portail en 2014","summary":"Après la mode des années 2000, le marché du portail s\u0027est restructurée et simplifiée. Les offres de portail constitue une solution d\u0027infrastructure avec de multiples cas d\u0027utilisations qui prend son sens en 2014.\r\nLa vocation première du portail est d\u0027être le point d\u0027entrée aux services applicatifs de l’entreprise.\r\nLe portail répond aux problématiques de communication en agrégeant les différentes sources de contenu et les référentiels documentaires.\r\nLe portail permet l\u0027échange d’informations à travers les outils collaboratifs (espace de travail, wiki, blog, ...) et les réseaux sociaux. ","roomId":1707225347,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[166831940],"speakers":[{"speakerId":166831940,"name":"Emmanuel PAVAUX"}]},{"sessionId":-634208134,"scheduleId":-415921579,"title":"Votre livrable avec Docker, en prod dès demain !","summary":"Docker, vous en avez certainement déjà entendu parlé. Vous avez peut-être déjà vu des démos. Tout le monde vous dit que c\u0027est génial. Et si on s\u0027y mettait vraiment ? Nous vous proposons à la fin de ce Hands-on d\u0027avoir mis en place votre propre workflow de déploiement continu avec Docker : Un conteneur docker avec Git, un conteneur avec Jenkins, une plateforme d\u0027intégration, une de prod, et un commit plus tard... Voilà ! Un conteneur Docker contenant toute votre stack applicative prêt à être déployé sur n\u0027importe quel environnement... Prêts ? Alors allons-y !","roomId":96587449,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-674578643,1868864359],"speakers":[{"speakerId":-674578643,"name":"Julien Vey"},{"speakerId":1868864359,"name":"Pierre Padrixe"}]},{"sessionId":-620353302,"scheduleId":1878790619,"title":"Google Cast Development - Lessons Learned","summary":"Google Cast is a technology that allows Android and iOS mobile apps and Chrome web apps to “cast” content - like video, audio, and screen sharing (mirroring) - to Cast-ready devices such as Chromecast. In this session, we will introduce the development model of Google Cast and the lessons we have learned from working with our partners.","roomId":1975599280,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[-1080649347],"speakers":[{"speakerId":-1080649347,"name":"Hoi Lam"}]},{"sessionId":-603727003,"scheduleId":-1572445550,"title":"Raft : le consensus réparti pour les nuls","summary":"Le problème du consensus est central dans les systèmes répartis et une solution classique à ce problème est le protocole Paxos qui est au coeur, entre autres, d\u0027un produit comme ZooKeeper mais qui présente l\u0027inconvénient d\u0027être très complexe à implanter. Raft est un nouveau protocole, plus simple donc a priori plus robuste, qui résoud ce problème. Cette présentation est une à la fois une introduction à Raft et à son implantation en Java, Barge.","roomId":1975599281,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[579982984],"speakers":[{"speakerId":579982984,"name":"Arnaud Bailly"}]},{"sessionId":-601612454,"scheduleId":-1950179863,"title":"Hacking your home","summary":"Venez voir comment \"hacker\" des objets de votre maison pour en faire des \"objets connectés\" en réutilisant vos compétences de développeur.\r\n\r\nDes exemples de montages et de code seront présentés, entre autres :\r\n\r\n* Comptage électrique (téléinfo)\r\n* Monitoring de température (hacking de station météo radio) \r\n* Contrôle d\u0027équipements (Chauffage, VMC, Volets roulant, ...)\r\n\r\nRaspberryPi, BeagleBone Black et Arduino seront les principaux ingrédients. A la sortie de la session, vous sortirez de la session avec  l\u0027envie de tout reproduire chez vous !","roomId":843733077,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[-1416884645],"speakers":[{"speakerId":-1416884645,"name":"Laurent HUET"}]},{"sessionId":-600101821,"scheduleId":120272394,"title":"Pourquoi vous devriez essayer sérieusement les Object Calisthenics","summary":"Les Object Calisthenics sont des contraintes de code à pratiquer en exercice pour vous entraîner à coder du beau code objet, du clean code. Par exemple, un seul point par ligne, pas plus de deux attributs par classe, etc.\r\nPlutôt qu\u0027un petit coup d\u0027oeil en 3H, j\u0027ai décidé d\u0027essayer sérieusement, j\u0027ai passé environ 60 heures sur l\u0027exercice. \r\nAu delà du simple entraînement, ma manière de coder a changé. J\u0027utilise parfois les Object Calisthenics sur du vrai code de projet, et j\u0027aimerai vous expliquer ce que ça m\u0027apporte, et pourquoi vous devriez essayer aussi.","roomId":1975599281,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[972035876],"speakers":[{"speakerId":972035876,"name":"Guillaume Duquesnay"}]},{"sessionId":-571733888,"scheduleId":-242238798,"title":"Bitcoin et monnaies cryptographiques","summary":"Bitcoin. Tous les médias en parlent. Mais connaissez vous son fonctionnement ?\r\nPour que le bitcoin et les autres monnaies cryptographiques n’aient plus de secret pour vous, venez assister à cette présentation technique qui éclaircira de nombreux concepts tels que la génération des adresses, la chaîne des transactions, la preuve de travail, l’introduction progressive de la monnaie, le minage et sa difficulté progressive, le \"bitcoin script\", etc.","roomId":1707225347,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[-1634388512],"speakers":[{"speakerId":-1634388512,"name":"Grégory Paul"}]},{"sessionId":-562833290,"scheduleId":732549648,"title":"Votez pour nous ! L\u0027internet des objets par l\u0027exemple.","summary":"Vous les avez forcément croisés, ces boitiers de votes qui permettent de donner votre avis sur les conférences. Venez découvrir la genèse de ce système qui combine du matériel, du software, du cloud. Visitez le côté coulisses, de la construction du boitier, basé sur un Raspberry Pi, à la propulsion par Groovy et Vert.x, en passant par la collecte des données en MQTT. Admirez le côté vitrine,  des applications mobiles NFC jusqu\u0027aux API de visualisations sur le cloud. Nous ne vous cacherons rien de la construction d\u0027un projet \"Internet of Things\" de A à Z !\r\n","roomId":1975599281,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[-1404896216],"speakers":[{"speakerId":-1404896216,"name":"Pablo Lopez"}]},{"sessionId":-544354989,"scheduleId":75632420,"title":"BOF Google Developer Groups","summary":"Plusieurs organisateurs des divers Google Developer Groups et Android User Groups de France nous rejoindrons pour un BOF autour de nos activités communes et individuelles, et parler des évènements à venir comme par exemple, la saison des DevFest.\r\n\r\nUne occasion à ne pas manquer pour découvrir ce que nous faisons et donner son avis sur ce que nous pourrions proposer d\u0027autre ou améliorer. \r\nProfitez-en pour nous faire part des sujets que vous aimeriez voir traités, des conférenciers vous aimeriez rencontrer ou venez simplement échanger avec nous de vos expériences respectives.","roomId":102724459,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[590650692,-1737536726,-195068034],"speakers":[{"speakerId":590650692,"name":"Thibault Pouget"},{"speakerId":-1737536726,"name":"Ludovic Borie"},{"speakerId":-195068034,"name":"Alain Regnier"}]},{"sessionId":-541915289,"scheduleId":-783397733,"title":"Programmation et musique avec Clojure et Overtone","summary":"Clojure est un langage de programmation fonctionnelle puissant, qui tourne sur la JVM et  qui est très utile pour des traitements parallèles ou la manipulation d\u0027un grand nombre de données.\r\nOvertone est un framework open source développé en Clojure, qui propose un environnement de composition musicale.\r\nComment Clojure et Overtone fonctionnent-ils ensemble ? Comment rapidement programmer des instruments virtuels en utilisant la simplicité de Clojure ? Et surtout comment faire de la musique avec tout ça ?\r\nCe Tools in action vous propose un live-coding pour répondre à ces questions.","roomId":907287738,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[1167768887],"speakers":[{"speakerId":1167768887,"name":"Mathieu Gandin"}]},{"sessionId":-500354895,"scheduleId":-281431996,"title":"Les concepts de la programmation fonctionnelle illustrés avec Java 8","summary":"Ce Quickie est basé sur le talk de Bodil Stokke: What Every Hipster Should Know About Functional Programming. C\u0027est un petit exercice basé sur la question suivante: peut-on transposer tous les exemples JS de son talk en Java 8 avec des lambdas? \r\nAu programme donc:  First Class Function, Functor, High Order Function, Combinator, Composition, Applicative Functor.","roomId":1975599280,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-1364356295],"speakers":[{"speakerId":-1364356295,"name":"Yannick Chartois"}]},{"sessionId":-482547211,"scheduleId":843706732,"title":"How to not just survive but thrive with flexible scope","summary":"Not fixing scope too far in the future is one of the cornerstones of agile delivery, but it is at the same time the thing that enterprise stakeholders fear the most. Ironically, being able to change decisions after delivery starts is one of the biggest benefits that companies can get from agile delivery, so it\u0027s necessary to stop worrying and embrace flexible scope to get the full benefits of an iterative process. In this talk, Gojko Adzic will show you how to convince people to embrace flexible scope, not only for startup environments but for big enterprise projects as well.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-814524825],"speakers":[]},{"sessionId":-431951174,"scheduleId":1435467016,"title":"Attaquez le Mahout de face pour exploiter vos Téraoctets d’historique !","summary":"Vous n\u0027avez pas un PhD de statistiques ou de mathématiques, pourtant vous rêvez de fonctions de recommandation pour votre site e-Commerce; de résultats de recherche plus pertinents sur votre catalogue produits; de catégoriser enfin vos utilisateurs pour plaire au marketing !\r\n\r\nPas de panique !\r\nNous allons démystifier Mahout ainsi que les concepts qui se cachent derrière les termes “machine learning”, “classification”, “collaborative filtering”, “clustering”, etc.\r\n\r\nCeci avec des animations ludiques et décomplexées, d\u0027exemples concrets illustrant une sélection d’algorithmes très pratiques.","roomId":907457591,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-1612447073],"speakers":[{"speakerId":-1612447073,"name":"Sidi Mohammed RAMDANI"}]},{"sessionId":-405503762,"scheduleId":-1926567523,"title":"Fifty New Features of Java EE 7","summary":"The Java EE 7 platform has four new components (WebSocket, JSON-P, batch, and concurrency), three that are significantly updated (JAX-RS, JMS, and EL), and several others that bring significant changes to the platform. In this fast-paced session, you will learn about 50 new features introduced in the Java EE 7 platform. It explains each feature with a code snippet and provides details on where and how you can use them.","roomId":1975599282,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-829462323],"speakers":[{"speakerId":-829462323,"name":"Arun Gupta"}]},{"sessionId":-354180486,"scheduleId":2081139732,"title":"Crazyflie: Developement d\u0027un quadrirotor miniature opensource","summary":"Crazyflie est un quadricopter opensource qui tient dans la main. Commencé comme un projet de loisir, le Crazyflie est devenu le premier quadricopter miniature opensource vendu. Aujourd\u0027hui il y a des utilisateurs et contributeurs dans le monde entier.\r\n\r\nNous allons présenter notre cheminement pour le développement, présenter la technologie derrière notre quadricopter et quels furent les défis que nous avons relevés. Nous allons également vous montrer quelques-uns des hacks et des projets que nous et la communauté avons réalisés au fil des ans. Nous finirons avec une démonstration de vol.","roomId":843733077,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[7959343,489708836,-471820166],"speakers":[{"speakerId":7959343,"name":"Arnaud Taffanel"},{"speakerId":-471820166,"name":"Tobias Antonsson"}]},{"sessionId":-346394733,"scheduleId":-273981913,"title":"Do you really get classloaders? ","summary":"Class loaders are at the core of the Java language. Java EE containers, OSGi, NetBeans modules, Grails and many others use class loaders heavily. Yet when something goes wrong, do you know how to solve it?\r\nIn this session we\u0027ll take a tour of the Java class loading mechanism. We will look at typical problems that you get with class loading and how to solve them. ClassNoDefError, IncompatibleClassChangeError, LinkageError and others are symptoms of specific things going wrong that you can usually find and fix. \r\nWe\u0027ll go through a hands on demos of problems with corresponding solutions.","roomId":1975599281,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[2133984351],"speakers":[{"speakerId":2133984351,"name":"Oleg Shelajev"}]},{"sessionId":-342698757,"scheduleId":1126429946,"title":"REST facile et robuste avec Vert.x et Groovy","summary":"Vert.x est une boite à outil polyglotte, au concept proche de NodeJS, basée sur la JVM, permettant de construire des applications serveurs TCP et HTTP grâce à son intégration de Netty. Venez découvrir cette stack technique, ses possibilités et comment les exploiter pour bâtir des services robustes, rapidement, avec le langage Groovy. Pas de méta-magie ici, tout codeur Java s’y retrouvera facilement.","roomId":1975599282,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[-1383212886],"speakers":[{"speakerId":-1383212886,"name":"Aurélien Maury"}]},{"sessionId":-307668997,"scheduleId":1149171678,"title":"Des applications réactives avec Spring 4, AngularDart et Websocket","summary":"Cette conférence aborde le développement d\u0027applications réactives via un retour d\u0027expérience portant sur le projet [OpenSnap](https://github.com/sdeleuze/opensnap), un clone HTML5 de SnapChat utilisant Spring 4 et AngularDart.\r\n\r\nSeront détaillées les nouveautés de Spring 4 telles que le support de Websocket, SockJS et STOMP ; l\u0027efficacité de développement unique qu\u0027apportent Dart et AngularDart côté client ; les différences entre le développement d\u0027applications RIA avec des webservices REST et avec Websocket ; la scalabilité et les performances ; les apports en termes d\u0027interface utilisateur.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[705389120],"speakers":[{"speakerId":705389120,"name":"Sébastien Deleuze"}]},{"sessionId":-286040741,"scheduleId":-1489451758,"title":"Université de la performance","summary":"Cette université vous fera découvrir comment concevoir la plus grosse fonctionnalité implicite d\u0027une application: Sa performance.\r\n\r\nUne présentation en quatre étapes:\r\n* Marc: Connaître les différents types de tests de charge et savoir quand les utiliser\r\n* Henri: Mettre en place un test de charge et l\u0027utiliser lors d\u0027une séance d\u0027optimisation\r\n* Mikaël: Ajouter des métriques de performance à l\u0027application à l\u0027aide de briques open source\r\n* Ludovic: Optimisations systèmes pour aller encore plus loin\r\n\r\nLe tout mis en pratique sur une application réelle.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-1468873844,818261287,1171102742,-1201611141],"speakers":[{"speakerId":-1468873844,"name":"Henri Tremblay"},{"speakerId":818261287,"name":"Ludovic Piot"},{"speakerId":1171102742,"name":"Marc Bojoly"}]},{"sessionId":-263604614,"scheduleId":-653721458,"title":"Rétrospective: les projets cloud computing","summary":"Sous la forme d’une rétrospective, au sens agile du terme, nous partagerons avec la salle le retour d’expérience de Sfeir sur plusieurs années de mise en oeuvre des technologies cloud.\r\n\r\nDe la Cloud Plateforme de Google à Amazon Web Services et Microsoft Azure en passant par les services SaaS qui nous permis de réaliser l’équivalent de plusieurs milliers de jours de projet, vous aurez un large panorama des opportunités et des difficultés du cloud computing basé sur des expériences concrètes.","roomId":1975599280,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-813033203],"speakers":[{"speakerId":-813033203,"name":"Aurélien Pelletier"}]},{"sessionId":-216573076,"scheduleId":-1423716452,"title":"Ceylon d‘ici à l‘infini : tour d‘horizon et le futur","summary":"Ceylon est un nouveau langage de programmation élégant pour la JVM et les VMs JavaScript, fait pour le travail en équipe. Mais plus que ça, c‘est une plate-forme complète avec modularité, un SDK, des outils et IDEs.\r\n\r\nNous allons présenter le langage, la plate-forme et son écosystème. Vous allez tout voir : du nouveau projet dans l‘IDE à la publication dans Herd, notre dépôt de modules, y compris le SDK. Nous présenterons également les projets Ceylon en cours tels que le système de build, l‘intégration Vert.x ou Cayla, le nouveau framework Web.\r\n\r\nEnfin nous présenterons les plans pour Ceylon 1.1, 1.2 et au delà.","roomId":1707225347,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[525019124],"speakers":[{"speakerId":525019124,"name":"Stéphane Épardaud"}]},{"sessionId":-186625504,"scheduleId":-1221421437,"title":"David m\u0027a refactorer","summary":"Comment on passe d\u0027un code source prévu pour tourner quelques heures avec quelques inscrits en réseau local à un service en continu sur le cloud avec une centaine d\u0027utilisateurs ?\r\n\r\nRetrouvez les étapes clés des refactorings et évolutions de [code-elevator](https://github.com/xebia-france/code-elevator) pour [code story](http://www.code-story.net/blog/posts/s03e01.01) dans une présentation interactive où les commits vont s\u0027enchaîner sous vos yeux.","roomId":1707225347,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[403301831],"speakers":[{"speakerId":403301831,"name":"Sébastian Le Merdy"}]},{"sessionId":-186091086,"scheduleId":-1847911330,"title":"Chérie, j’ai rétréci le build ! 300kloc / 30kt / 3m","summary":"Janvier 2013, temps de build: 17mn.\r\nJanvier 2014, temps de build: 2mn30.\r\nAvec une base de code de 300 000 lignes et près de 30 000 tests, LesFurets.com avait un build de 17 minutes et un temps de recette automatisée de plus d\u0027une heure.\r\nCes conditions étaient “raisonnables” pour une petite équipe, mais cela s’est avéré être un gros frein à l\u0027augmentation de la taille de l\u0027équipe. \r\nL’idée est de restituer le travail fourni en quelques mois pour diviser par 5 le temps de build, en expliquant les raisons, les axes d’amélioration, les solutions adoptées et l’impact sur le workflow de l’équipe.","roomId":1975599280,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-741649871],"speakers":[{"speakerId":-741649871,"name":"Geoffrey Bérard"}]},{"sessionId":-147840384,"scheduleId":1188018827,"title":"42 IntelliJ IDEA tips and tricks in 45 minutes","summary":"There are so many features in IntelliJ IDEA, but we\u0027re going to concentrate on just 42, and we\u0027re going to try and show them in 45 minutes. That\u0027s around 1 tip per minute because we need to leave 3 minutes for Hello, Welcome and Thank you. \r\n\r\nIf a single one goes bad, we have less than a minute per tip. But here\u0027s hoping it won\u0027t. \r\n\r\n","roomId":1975599281,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-865901387],"speakers":[{"speakerId":-865901387,"name":"Hadi Hariri"}]},{"sessionId":-135297272,"scheduleId":-1912748185,"title":"BOF Future DIY","summary":"L\u0027occasion de partager avec d\u0027autres passionnés d\u0027Arduino / Raspberry Pi / BeagleBone. ","roomId":1596492292,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[1135859611,-1416884645],"speakers":[{"speakerId":-1416884645,"name":"Laurent HUET"}]},{"sessionId":-131212264,"scheduleId":-1089821776,"title":"Web performances, regardons les résultats de près","summary":"Quand il s\u0027agit de mettre en place une infrastructure Web performante, pléthores de solutions existent mais l\u0027architecte manque d\u0027une vue comparative sur les aspects de productivité, évolution,  performance.\r\nDans ce talk, découvrez comment une solution peut être montée en utilisant différents frameworks et languages, les difficultés rencontrées, les réglages pour être performant, les performances comparées des solutions et interagissez avec les interlocuteurs.\r\nLes languages / framework démontrés seront:\r\nJavaEE (Java)\r\nUndertow (Java)\r\nNodeJs (Javascript)\r\nVert.x (Java)\r\nPlayFramework (Scala)\r\n","roomId":1975599281,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[-783849214,-1306213818,1896412449,-498118130],"speakers":[{"speakerId":-783849214,"name":"Jeff MAURY"},{"speakerId":-1306213818,"name":"Nicolas Leroux"},{"speakerId":1896412449,"name":"Philippe Charrière"},{"speakerId":-498118130,"name":"Rémi Forax"}]},{"sessionId":-130353801,"scheduleId":-169670708,"title":"Groovy en 2014 et au-delà","summary":"Groovy a déjà 10 ans, mais il continue d\u0027évoluer et d\u0027innover.\r\n\r\nQu\u0027est-ce qu\u0027il y a de nouveau sous le capot ?\r\n- la coercion implicite de closure\r\n- de nouvelles transformations de code\r\n- une plus grande finesse de configuration des scripts\r\n- des extensions pour le type checker\r\n\r\nDans les prochaines versions de Groovy, vous pourrez également créer des \"traits\", faire de la tail recursion, et plus encore.","roomId":1975599281,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[1452356424],"speakers":[{"speakerId":1452356424,"name":"Guillaume Laforge"}]},{"sessionId":-103178783,"scheduleId":-799189326,"title":"Sinon.JS, l\u0027ami du test unitaire JavaScript","summary":"Le test unitaire est une pratique plutôt bien répandue chez les développeurs Java.\r\nMais qu\u0027en est-il du JavaScript ?\r\nLa montée en puissance des *framework web* a vu apparaître des applications *front* de plus en plus complexes. Malheureusement, le test unitaire n’est pas toujours un réflexe.\r\nPourtant, des librairies telles que **Sinon.JS** proposent des outils pour nous simplifier la vie. Leurs noms : **spy**, **stub**, **mock** ou **fakeServer**.\r\nCe quickie vous montrera comment rendre digne de confiance une application Backbone/Marionette développée sans test !","roomId":1707225347,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[-1240917283],"speakers":[{"speakerId":-1240917283,"name":"Florent DUVEAU"}]},{"sessionId":-68743667,"scheduleId":171762549,"title":"Pas à PaaS : CloudFoundry in action","summary":"Comment permettre aux développeurs de disposer d’un environnement de production / recette / développement pour déployer leurs applications à la demande et de manière totalement autonome ?\r\nNous avons rencontré cette problématique chez Ippon Hosting concrètement. Lors de cette conférence nous allons donc vous présenter le cheminement de notre réflexion. Celle-ci a abouti à la mise en place d’un PaaS Cloudfoundry dans nos environnements : installation et configuration de l\u0027outil, adaptation des buildpacks, avantages et inconvénients de la solution choisie.","roomId":1707225347,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-1861730400,-951242780],"speakers":[{"speakerId":-1861730400,"name":"Thibault CHASSAGNETTE"},{"speakerId":-951242780,"name":"Ghislain SEGUY"}]},{"sessionId":-60498857,"scheduleId":-236619901,"title":"SARAH: connecter et interagir avec l\u0027Internet des Objets au quotidien","summary":"Depuis quelques années nous vivons une nouvelle révolution: l\u0027internet des objets, entre autre grâce à la miniaturisation, au crowd funding, et aux imprimantes 3D.\r\n\r\nC\u0027est un choc de culture entre le monde des géants du web et celui de l\u0027électronique grand public.\r\n\r\nSARAH (http://encausse.net/s-a-r-a-h) est un projet OpenSource visant à faire communiquer tous ces objets pour interagir avec eux de manière naturelle: reconnaissance vocale, gestuelle, faciale, QRCode, Machine learning, ...\r\n\r\nL\u0027objectif est d’appréhender l\u0027UX de demain qui ne se fera plus seulement avec un écran, mobile, tactile, ... mais de nombreux autres scénarios pouvant profiter à la domotique, à l\u0027accessibilité, à l\u0027urbanisme, aux commerces,  aux seniors...\r\n\r\n","roomId":1707225347,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[278176269],"speakers":[{"speakerId":278176269,"name":"Jean-Philippe Encausse"}]},{"sessionId":-56798112,"scheduleId":1463264300,"title":"Hadoop @ Criteo, du laboratoire à la production 24h/24","summary":"En quelques années, Criteo est devenu un des leaders mondiaux de la publicité à la performance : tous les jours sa plateforme reçoit plus de 30 milliards de requêtes HTTP et affiche plus d\u0027un millard de bannières personnalisées en temps-réel.\r\n\r\nAfin de soutenir cette croissance, Criteo a bâti un cluster Hadoop de plusieurs Petaoctets permettant l\u0027exécution d\u0027algorithmes complexes sur des volumes de données importants.\r\n\r\nCette présentation va au-delà des considérations basiques et met en lumière le passage d\u0027un cluster d\u0027expérimentation à une production à très grande échelle fonctionnant 24h/24.\r\n","roomId":1975599281,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-357878342,175414016],"speakers":[{"speakerId":175414016,"name":"Loïc Le Bel"}]},{"sessionId":35875210,"scheduleId":524915290,"title":"33 things you want to do better","summary":"Tight deadlines often make developers produce the infamous enterprise code, the quality of which is the least important factor. \"We are what we repeatedly do. Excellence, therefore, is not an act, but a habit\" Aristotle used to say. Deploying our skills, however, is mutually exclusive from mastering them.\r\n\r\nIn this session we will cover 33 things you want to do better applying the best of  Lombok, Guava, LambdaJ, Mockito, Spock, Byteman, Groovy, Gradle, Logback and others! Using some real-life examples not only will we learn how to code better, but also how to raise the bar on a daily basis!","roomId":1975599281,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-1456039136],"speakers":[{"speakerId":-1456039136,"name":"Tom Bujok"}]},{"sessionId":82116349,"scheduleId":-1423870098,"title":"Les Cast Codeurs reviennent et ils ne sont pas content !","summary":"Les Cast Codeurs sont peut être vieux mais ils peuvent vous en apprendre une ou deux. Et ils ne sont pas contents ! Ils veulent plus d\u0027interaction, plus de news, plus de bonne humeur, plus de bières !\r\n\r\nLes Cast Codeurs est un podcast en français de, par et pour développeurs, discutant les nouvelles de la sphère Java. Rejoignez-nous pour commenter et clôturer en direct Devoxx France.","roomId":907457591,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[1636575886,635028014,-1692609833,-683890691,1452356424],"speakers":[{"speakerId":1636575886,"name":"Emmanuel Bernard"},{"speakerId":635028014,"name":"Vincent Massol"},{"speakerId":-1692609833,"name":"Arnaud Héritier"},{"speakerId":-683890691,"name":"Antonio Goncalves"},{"speakerId":1452356424,"name":"Guillaume Laforge"}]},{"sessionId":86081038,"scheduleId":-1094766442,"title":"Expression Oriented Programming with F#","summary":"In this session we’ll take a deep look at some of the basics of programming: expressions, statements, scope and how we represent data. We’ll look at these concepts to through the lens of a functional programmer to see how this, contrasts to the way an Object Oriented programmer might do things. Once we’ve examined the basics, we’ll go on to take a look at one of the biggest problems faced by software developers: complexity. We’ll see how complexity can either be accidental or essential. We’ll see how expression oriente","roomId":1707225347,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[-1959874616],"speakers":[{"speakerId":-1959874616,"name":"Robert Pickering"}]},{"sessionId":117211135,"scheduleId":859439799,"title":"Détection de malwares par leur empreinte réseau.","summary":"Comment concevoir et utiliser une pile technologique Big Data (Spring / Hadoop / Elasticsearch) enrichie de techniques de machine learning (Mahout) pour détecter des comportements malveillants au sein du réseau interne d\u0027une entreprise ?\r\n\r\nPartant du constat que la vaste majorité des malwares nécessite une connexion réseau afin de perpétrer ses activités malicieuses (spam, exfiltration de données privées, mise à jour desdits malwares), nous avons cherché à établir une \"signature générique\" de comportement réseau à travers la masse des fichiers logs  produits par les proxy réseau du SI.\r\n\r\n","roomId":907317529,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-741222314],"speakers":[{"speakerId":-741222314,"name":"Thomas Bailet"}]},{"sessionId":123284673,"scheduleId":410827330,"title":"Bluetooth Low Energy, votre téléphone comme passerelle de l\u0027internet des objets","summary":"Tous les jours sont créés de nouveaux objets connectés, du plus utile au plus loufoque. Ces objets ont bien souvent un point commun : le Bluetooth 4 Low Energy, évolution du populaire Bluetooth, fonctionnant à faible énergie et sans appairage. Elle est également de plus en plus présente sur nos téléphones (Android, iOS, BlackberryOS, et bientôt Windows Phone) et ordinateurs.\r\n\r\nNous allons voir comment cette technologie règle les problèmes de communication entre objets et comment les développeurs peuvent en jouer pour détourner l\u0027usage d\u0027objets existants ou créer une application domotique.","roomId":-191300166,"experience":"","sponsored":false,"tags":["Mobile"],"speakerIds":[971069834],"speakers":[{"speakerId":971069834,"name":"Romain Menetrier"}]},{"sessionId":126976837,"scheduleId":2027614779,"title":"Android app bashing : apprendre des erreurs des grands","summary":"Microsoft, Facebook, Yahoo, ... Ces géants du soft sont tous de grands éditeurs d\u0027applications et leur réputation n\u0027est plus à faire. Il leur arrive malgré tout de ne pas rencontrer le succès sur le PlayStore Android.\r\n\r\nDurant cette conférence je vous raconterai l\u0027histoire de ces applications qui avaient tout pour réussir et qui ont échoué à satisfaire les utilisateurs. On identifiera ensemble les erreurs commises afin de pouvoir prendre soin de ne jamais les reproduire.","roomId":1707225347,"experience":"","sponsored":false,"tags":["Mobile"],"speakerIds":[-1109072342],"speakers":[{"speakerId":-1109072342,"name":"Eyal LEZMY"}]},{"sessionId":168270499,"scheduleId":-613691009,"title":"Transformez votre \"digital self\" en une base de connaissances","summary":"L\u0027utilisateur du Web aujourd\u0027hui a ses données et ses informations dispersées dans des tas de services qui fonctionnent en silos et décident pour lui. Il est temps de lui redonner le contrôle de sa vie numérique. Cela devient possible et cela conduit à mettre à la disposition de chaque utilisateur la base de toutes les connaissances que les services du Web savent d\u0027elle ou de lui. ","roomId":307138528,"experience":"","sponsored":false,"tags":["\u0026","Startups","innovation"],"speakerIds":[523386438],"speakers":[{"speakerId":523386438,"name":"Serge Abiteboul"}]},{"sessionId":186471338,"scheduleId":-2025979297,"title":"So Easy a Child Could Do It: Designing Mobile Apps for Children","summary":"Young children can seem to “get” touch devices right away, but also get easily frustrated. Through a tour of apps currently on the market, we\u0027ll explore techniques to maximize their engagement and minimize their frustration, including using characters, audio and visual indicators, and inactivity timeouts. We\u0027ll also cover which gestures are the most and least intuitive for small fingers, how the way children hold tablets affects UI, and what content to include for parents.","roomId":1975599280,"experience":"","sponsored":false,"tags":["Mobile"],"speakerIds":[530875132],"speakers":[{"speakerId":530875132,"name":"Kathryn Rotondo"}]},{"sessionId":206136663,"scheduleId":-1183074046,"title":"Programmation système robuste avec Rust","summary":"La programmation système a ses contraintes. Elle nécessite un contrôle fin sur\r\nl\u0027utilisation de la mémoire, ce qui prohibe l\u0027utilisation du GC. Il devient aussi complexe d\u0027utiliser efficacement des structures immutables. On a d\u0027habitude le choix entre\r\nlaisser le runtime gérer la mémoire (fortes garanties) ou le faire soi-même\r\n(aucune garantie). Avec rust, on laisse le compilateur vérifier statiquement ce que l\u0027on fait. On y gagne robustesse et contrôle. Nous aborderons les mécanismes de sécurité de rust, sa gestion de la concurrence et ses outils de modularité.\r\n","roomId":1707225347,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[1995702901,268241445],"speakers":[{"speakerId":1995702901,"name":"Clément Delafargue"},{"speakerId":268241445,"name":"Geoffroy Couprie"}]},{"sessionId":225267769,"scheduleId":-1402915330,"title":"Gradle ne fait pas que remplacer Maven","summary":"Il faut que vous le sachiez, Gradle ne fait pas *que* remplacer Maven. Il répond à d\u0027autres problématiques : conventions d\u0027entreprise, intégration continue, DevOps, parallélisme, gestion avancée des dépendances, variantes de build déclarative, compilation incrémentale, projets polyglottes, artéfacts multiples...\r\n\r\nDans cette session, vous apprendrez pourquoi on ne peut pas réduire Gradle à un Maven sans XML ou un Ant sous stéroïdes. Vous verrez qu\u0027**écrire une build sera plus jamais une punition**. Pire, ça pourrait devenir un plaisir !","roomId":1975599281,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[1893774315],"speakers":[{"speakerId":1893774315,"name":"Cédric Champeau"}]},{"sessionId":228961978,"scheduleId":1423331067,"title":"30 minutes pour développer une appli Java EE ? C\u0027est largement suffisant avec Forge 2.0!","summary":"Votre projet Java EE ressemble à ça ? 2j pour un `pom.xml`, 5j pour la base de données, 10j pour la couche de persistance, 5j pour les EJBs, 15j pour les pages JSF, 10j pour l\u0027interface REST et 20j pour rajouter de l\u0027AngularJS.\r\n\r\nAlors venez à cette session où vous découvrirez la nouvelle version de JBoss Forge. En 30 minutes je vous présenterai Forge 2.0, son architecture interne, son mode ligne de commande... et développerai une application Java EE. Chiche ?","roomId":1975599280,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-683890691],"speakers":[{"speakerId":-683890691,"name":"Antonio Goncalves"}]},{"sessionId":241886251,"scheduleId":948677434,"title":"WebSocket, NoSQL, et Non-Blocking Server-Side I/O avec Kaazing, MongoDB, et Node.js","summary":"Durant ce Tools In Action nous verrons quelques technologies \"amusantes\" comme les Web Sockets, un serveur NodeJS et une base de donnée NoSQL, qu\u0027il est possible de créer un nouveau type d\u0027applications. Cette application est une application de dessin utilisant les fonctionnalités de pub/sub pour partager les dessins en temps réel. La base de donnée NoSQL est elle utilisé pour enregistrer les actions utilisateurs et permettre de les rejouer. ","roomId":-2047228984,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[609479933],"speakers":[{"speakerId":609479933,"name":"Tugdual Grall"}]},{"sessionId":252906452,"scheduleId":1269147297,"title":"AngularJS from scratch : comprendre Angular en le re-faisant de zéro","summary":"On a tous vu une présentation d’AngularJS montrant la magie des bindings et des directives. Oui, mais comment ça marche ? Rien de mieux pour le comprendre que de le construire étape par étape. C’est finalement avec assez peu de code et un code très intéressant à détailler que les principaux mécanismes d’AngularJS apparaissent. Avant la fin de la séance, binding, directives, templates, tout fonctionne.","roomId":102724395,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[-1073332916,-1658221040],"speakers":[{"speakerId":-1073332916,"name":"Matthieu Lux"},{"speakerId":-1658221040,"name":"Olivier Huber"}]},{"sessionId":273880679,"scheduleId":1277650772,"title":"BOF Docker ","summary":"This session is a discussion on the usage patterns on docker: \r\n\r\nSome topic areas to cover: \r\n*  blurring the lines between PaaS and IaaS clouds\r\n* how Docker could be an enabling tech to help platform clouds really take off. \r\n* Docker image as the truly portable unit of deployment. \r\n* Docker usage patterns\r\n* What it means for platform choices: now we have something as portable as a .jar app - but a whole linux image.","roomId":3346363,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[368456049],"speakers":[{"speakerId":368456049,"name":"Nicolas de Loof"}]},{"sessionId":280999293,"scheduleId":-487662135,"title":"Code-Story Live Coding","summary":"Cette année, Code Story, c\u0027est une salle, des invités, du live-coding.\r\n\r\nMathieu Ancelin: \"Live coding: Web temps réel avec Play 2\"\r\nSébastian Le Merdy: \"David m\u0027a refactorer\"\r\nFrançois Sarradin: \"Du legacy à Scala\"\r\nJonathan Perret: \"Kata mystère\"\r\nainsi que David Gageot et Jean-Laurent de Morlhon.\r\n\r\nChaque session est indépendante des autres. Vous pouvez venir quand vous voulez.\r\nChaque session est calée sur le programme des conférence. Vous ne perdez pas le fil de la conférence.\r\n\r\n","roomId":3094955,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[737726641,-1850394981,138362904,558936938,403301831],"speakers":[{"speakerId":737726641,"name":"David Gageot"},{"speakerId":-1850394981,"name":"Jean-Laurent de Morlhon"},{"speakerId":138362904,"name":"François Sarradin"},{"speakerId":558936938,"name":"Mathieu ANCELIN"},{"speakerId":403301831,"name":"Sébastian Le Merdy"}]},{"sessionId":303102670,"scheduleId":-920050834,"title":"Spark the data scientist’s toolbox","summary":"Apache Spark est un système de calcul distribué rapide et polyvalent. Il fournit des API de haut niveau en Scala, Java, Python et R ce qui facilite l\u0027écriture de calcul en parallèle et l\u0027analyse de gros volumes de données. Il prend également en charge un large éventail d\u0027outils de haut niveau tels que Shark (Hive dans Spark), MLlib pour machine learning, GraphX pour le traitement de graphs, et Spark streaming (traitement en flux).\r\nMa présentation vise à faire connaître cet environnement que j\u0027utilise au quotidien dans le cadre de ma thèse et au sein de projet en production.","roomId":-2047228984,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-1832761502],"speakers":[{"speakerId":-1832761502,"name":"Tugdual Sarazin"}]},{"sessionId":337601824,"scheduleId":-1983682972,"title":"Realtime Web avec Akka, Kafka, Spark et Mesos","summary":"Ce talk est un retour d’expérience sur la mise en œuvre de Spark et Streaming Spark.  Nous aborderons :\r\n\r\n - La collecte des données à la volée dans l’application Web avec Akka\r\n - La séparation des producteurs et consommateurs avec Kafka\r\n - La transformation des données avec Spark et Streaming Spark\r\n - Le déploiement sur un cluster avec Apache Mesos\r\n","roomId":1975599280,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[1118115891,1642281739],"speakers":[{"speakerId":1118115891,"name":"Hayssam Saleh"},{"speakerId":1642281739,"name":"Jean-Philippe Bunaz"}]},{"sessionId":415118087,"scheduleId":21842106,"title":"Erlang : et si on faisait un pas de côté","summary":"... plutôt qu\u0027un pas en avant?\r\nAvec Erlang voici l\u0027occasion de découvrir les bases d\u0027un langage qui, depuis plus de 20 ans d\u0027années, ne suit pas les canons usuels et qui, par ses choix simples et radicaux (langage fonctionnel et dynamique, immutabilité, process stateless etc.) , est à l\u0027aise pour construire des systèmes solides, distribués, massivement parallèles.\r\nMais avant tout vous viendrez apprendre qu\u0027il est tout à fait possible - et inspirant - de regarder les choses autrement.","roomId":907457591,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[-556701812],"speakers":[{"speakerId":-556701812,"name":"Gabriel Kastenbaum"}]},{"sessionId":416037979,"scheduleId":1820335865,"title":"Le bon testeur il teste.... et le mauvais testeur il teste aussi...","summary":"Pourquoi proposer une nouvelle conférence sur les tests ? Il est néanmoins toujours bon de rappeler certains principes. Quelle est la différence entre un bon et un mauvais testeur ? Le bon testeur il teste.... et le mauvais testeur il teste aussi ! Plusieurs règles simples permettent d\u0027améliorer la qualité de ses tests, certains outils ou librairies (FestAssert, AssertJ, InfiniTest, DBSetup) vont vous simplifier la vie ! Tour d’horizon des bonnes pratiques au programme, le tout en livecoding ! Il est toujours bon de refaire un peu d’évangélisation sur les tests : débutants bienvenus!","roomId":843733077,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[57615399,511832792],"speakers":[{"speakerId":57615399,"name":"Agnès Crepet"},{"speakerId":511832792,"name":"Guillaume Ehret"}]},{"sessionId":445324941,"scheduleId":-1631400770,"title":"Apprenez les ficelles de Marionette","summary":"Problèmes de fuites mémoires ? D’organisation du code ? Manque de composants haut-niveau ? Et j’en passe pour les nombreux retours d\u0027xp sur Backbone… Ce genre d’inconvénients vous ont peut-être fait basculer trop rapidement vers Angular.js ou Ember.js. Ces galères, je ne les ai jamais connues ! Promis je ne trolle pas :) Une solution sur-mesure existe déjà : Marionette.js ! Je vous propose de redécouvrir Backbone à travers cette librairie : points forts/faibles, avant/après, bonnes pratiques…","roomId":-191300166,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[-363356962],"speakers":[{"speakerId":-363356962,"name":"Romain Maton"}]},{"sessionId":486886946,"scheduleId":1018927875,"title":"BOF Java User Groups","summary":"C\u0027est l\u0027occasion de réunir tous les JUG Leaders dans la même salle pour échanger avec ceux qui se rendend à DevoxxFR pour débriefer, échanger, partager, prendre une photo de famille et aller boire un coup ensemble après.\r\n\r\nNicolas De Loof se propose pour présenter un CFP en Saas fait de ses mains et rouler sous les aisselles.","roomId":96587449,"experience":"","sponsored":false,"tags":["\u0026","Startups","innovation"],"speakerIds":[1763647671,368456049,1411381120],"speakers":[{"speakerId":1763647671,"name":"Cyril Lakech"},{"speakerId":368456049,"name":"Nicolas de Loof"},{"speakerId":1411381120,"name":"Horacio Gonzalez"}]},{"sessionId":495198915,"scheduleId":-1400190888,"title":"ALT.NET Talks","summary":"Il y a une vie en dehors de la JVM! \r\nNous partageons des valeurs plus fortes que nos différences, alors venez échanger avec des artisans logiciels du monde .Net pour parler de C#, F#, architecture, outils, pratiques, open source et bien sur de web...","roomId":3346362,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[-1549937720],"speakers":[{"speakerId":-1549937720,"name":"Rui Carvalho"}]},{"sessionId":551266785,"scheduleId":200476665,"title":"Etendre le Web avec les Web Components","summary":"Cette session débutera par un retour sur l\u0027état courant de fragmentation des mécanismes d\u0027extension du Web et en particuliers du manque d\u0027interopérabilité entre les différents modèles de composants qui nuit à tout l\u0027écosystème.\r\nL\u0027intervenant présentera ensuite le standard des \"Web Components\" qui a pour objectif de résoudre ce problème. Enfin il détaillera plusieurs projets open source (Polymer, delite...) qui se basent sur ce concept.","roomId":907457591,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[-419769821],"speakers":[{"speakerId":-419769821,"name":"Christophe Jolif"}]},{"sessionId":577121644,"scheduleId":-707085908,"title":"Devoxx4Kids","summary":"Partant du simple constat qu’il était difficile de trouver du matériel didactique adapté aux enfants entre 8 et 14 ans sur le sujet de la programmation informatique (plus particulièrement dans une langue autre que l’anglais) et désirant montrer à leurs enfants qu’il est possible de faire autre chose de plus attrayant avec un ordinateur que de regarder des vidéos sur Youtube ou de lire des commentaires sur Facebook, certains membres de l’équipe DEVOXX ont commencé à réfléchir en 2012 sur le sujet et ont lancé l’initiative Devoxx4Kids.\r\n[http://www.devoxx.fr/devoxx4kids-2014/](http://www.devoxx.fr/devoxx4kids-2014/)","roomId":-182278998,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[195470103,-1724825242,-2140014718],"speakers":[{"speakerId":195470103,"name":"Daniel De Luca"},{"speakerId":-1724825242,"name":"Tasha Carl"},{"speakerId":-2140014718,"name":"Pierre Mistrot"}]},{"sessionId":589664602,"scheduleId":393953266,"title":"900 000 emplois IT à pourvoir d\u0027ici 2015 en Europe. Comment susciter les vocations ?","summary":"En 4 ans, le nombre d’emplois dans les secteurs Scientifiques et Technologiques a augmenté de 6,2% en Europe. Venez écouter un expert Oracle sur les conséquences économiques et les réponses étatiques face au manque à prévoir de développeurs dans la zone EMEA. Pour susciter des vocations, Oracle s’engage dans plusieurs initiatives, dont Oracle Academy qui s’adresse aux jeunes de 10 à 24 ans. Oracle Academy forme plus de 2,5 millions d’étudiants dans 102 pays ! ","roomId":307138528,"experience":"","sponsored":false,"tags":["\u0026","Startups","innovation"],"speakerIds":[-1145816680,1244229512],"speakers":[{"speakerId":-1145816680,"name":"Dominique Van Deth"},{"speakerId":1244229512,"name":"Danny Gooris"}]},{"sessionId":602001087,"scheduleId":391926035,"title":"Soyons RESTful avec RESTX","summary":"Le monde du web est en pleine ébullition, JS prend les devant avec des frameworks comme Angular ou Backbone qui séduisent même les développeurs Java que nous sommes.\r\n\r\nMais pour le serveur, Java garde des atouts avec son typage et sa maintenabilité. Et pour faire communiquer les deux, rien de mieux que des services REST !\r\n\r\nNous verrons au travers de nombreuses démos comment [restx.io](http://restx.io/), un framework Java open source et innovant peut vous aider à construire , documenter et tester l\u0027API REST idéale pour vos applications web de demain.","roomId":907457591,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[-1683149099],"speakers":[{"speakerId":-1683149099,"name":"Xavier Hanin"}]},{"sessionId":685509053,"scheduleId":-1616857910,"title":"Prenez le contrôle d’un aéroport avec Akka!","summary":"Venez découvrir Akka en développant un jeu de gestion du trafic d’un aéroport. Nous vous proposons de travailler sur la programmation dans le modèle acteur, totalement dynamique et asynchrone. Nous verrons ce qu’est un acteur, comment lui envoyer des messages, gérer des machines à états, tout cela dans une approche d\u0027Event Sourcing. \r\nNous verrons ensuite comment les modules akka-remote et akka-persistence permettent d\u0027appréhender la distribution et la résilience de l\u0027application. \r\n\r\nVous aurez le choix de programmer en Java ou en Scala.\r\n","roomId":102724459,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[66122151,1839868696],"speakers":[{"speakerId":66122151,"name":"Xavier Bucchiotty"}]},{"sessionId":711364978,"scheduleId":-345290665,"title":"Linux 101 (ou Linux, domptez le pingouin)","summary":"Nous allons vous embarquer dans un voyage au monde de Linux.\r\nUn voyage qui démarre dès le boot de l\u0027OS, dès le démarrage du Kernel.\r\nUn voyage qui passe par les systèmes de gestion des services et les systèmes de packaging.\r\nUn voyage qui s\u0027attardera sur la configuration et sur la structure du système de fichiers.\r\n\r\nNous vous présenterons cela de manière dynamique et vous montrerons les outils qui permettent d\u0027ouvrir le capot et d\u0027appréhender par vous-même le fonctionnement de votre OS.\r\nRejoignez-nous, et domptez le pingouin!!!","roomId":1707225347,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-98521890,517933444],"speakers":[{"speakerId":-98521890,"name":"Pierre-Antoine Grégoire"},{"speakerId":517933444,"name":"Frédéric Weisbecker"}]},{"sessionId":716904026,"scheduleId":426353835,"title":"Promesses et Yield : les Future\u003c?\u003e de JavaScript","summary":"Le modèle des callbacks en JavaScript montre clairement ses limites. En chaînant plusieurs opérations et en voulant gérer les erreurs on arrive assez rapidement au \"callback hell\" : cauchemar de maintenance.\r\n\r\nÀ ce problème deux solutions : les promesses proposées dans plusieurs librairies Javascript, ou bien les générateurs proposés par ECMAScript 6 grâce au mot clé \"yield\".\r\n\r\nNous verrons comment les utiliser et comment les combiner.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[203129253],"speakers":[{"speakerId":203129253,"name":"Florent Le Gall"}]},{"sessionId":749167133,"scheduleId":-1455393057,"title":"Vive les WebSockets Libres! ","summary":"Cette présentation proposera des trucs importants à connaître avant de vous lancer dans l\u0027utlisation des \"websockets\". Cette présentation propose donc une étude de l\u0027API WebSocket proposée par le JSR 356 en comparant ses forces et ses faiblesses avec un framework bien établi nommé Atmosphere. Les librairies Websockets comme Socket.IO et SocksJs y seront également discutées et comparées à Atmosphere.js. La présentation se terminera par une discussion sur les méchants Proxys, Pare-Feux ainsi que les problèmes de scalabilité rencontrés lors de mise en production d\u0027applications WebSockets.","roomId":1975599280,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[-1145285139],"speakers":[{"speakerId":-1145285139,"name":"Jean-François Arcand"}]},{"sessionId":799305702,"scheduleId":-680011195,"title":"Outils pour manager une équipe (de développement)","summary":"Vous avez tous connu des bons ou (plus souvent) des mauvais managers dans votre carrière. Au gré de la croissance de votre société, de réorganisations ou de rachats, il arrive pour de bonnes ou de mauvaises raisons que vous-même teniez un rôle de management. Un rôle pas forcément à l\u0027honneur dans notre communauté. \r\n\r\nLe management, comme le développement, se base aussi sur des pratiques et des techniques. Voici une revue d\u0027outils pragmatique et simple à mettre en place pour vous améliorer dans votre (nouveau) role de manager.","roomId":1707225347,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[1975822592],"speakers":[{"speakerId":1975822592,"name":"Youen Chene"}]},{"sessionId":806096374,"scheduleId":-1552732044,"title":"Models and Rest APIs on AngularJS with Restangular","summary":"AngularJS has been attracting a lot of attention lately and most Angular applications need to have models and communicate to a Rest API. However, AngularJS is not opinionated at all regarding models since they are simple POJSOs (Plain Old JS Objects).\r\n\r\nThe main intention of this talk is to show by example how to create models with fields and behaviour on JS that are gotten from a Rest API very with the help of Restangular, which allows us to handle models relations, extended state and behaviour in a very elegant way.  I\u0027m also going to compare this approach to working with $resource.","roomId":1975599280,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[113749325],"speakers":[{"speakerId":113749325,"name":"Martin Gontovnikas"}]},{"sessionId":827998140,"scheduleId":1923177,"title":"Clojure décollage imminent !","summary":"Les outils autour de Clojure ont considérablement progressé en 2013. \r\nLes IDEs et éditeurs de texte majeurs proposent tous des plugins Clojure performants, tout le monde peut ainsi débuter l\u0027apprentissage du langage dans un contexte familier. \r\nL\u0027arrivée à maturité du nouvel IDE LightTable offre une expérience exceptionnelle par sa façon d’interagir avec les langages de programmation. LightTable propose un feed-back immédiat sur le code en cours d\u0027écriture. Cela en fait non seulement un formidable vecteur d\u0027apprentissage mais aussi un environnement de développement extrêmement prometteur.","roomId":3346361,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[-195069219],"speakers":[{"speakerId":-195069219,"name":"Hiram MADELAINE"}]},{"sessionId":830766814,"scheduleId":1047878722,"title":"Identification d\u0027une empreinte vocale pour les Nuls","summary":"Les nouvelles perspectives offertes par la reconnaissance vocale vont tôt ou tard nous confronter à l\u0027usage de librairies spécialisées dont le fonctionnement interne nous échappe totalement. Comment dès lors les évaluer, les utiliser correctement et en tirer le meilleur parti ? \r\n\r\nCette présentation ludique et pratique a pour objectif de démystifier les arcanes de l\u0027analyse de la voix humaine et ses contraintes en vous présentant les rouages internes du logiciel libre \"Recognito\", créé par le conférencier et permettant l\u0027identification d\u0027un locuteur à partir de son empreinte vocale.","roomId":843733077,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[1931468244],"speakers":[{"speakerId":1931468244,"name":"Amaury Crickx"}]},{"sessionId":866783115,"scheduleId":-1944185728,"title":"Microbenchmarking avec JMH","summary":"Les microbenchmarks, c\u0027est souvent faux, mais c\u0027est quand même drôlement utile.  S\u0027y frotter sans le bon outil, c\u0027est comme se couper les cheveux chez le boucher. Même s\u0027il sait couper, mais ça donne rarement de bons résultats.\r\n\r\nVenez vous familiariser avec les pièges de la JVM et apprenez comment JMH vous aide à les contourner. Tout en restant simple d\u0027utilisation. Le parfait outil du petit optimiseur en herbe.","roomId":907317529,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-1468873844],"speakers":[{"speakerId":-1468873844,"name":"Henri Tremblay"}]},{"sessionId":884065046,"scheduleId":-400142506,"title":"OpenDataCamp","summary":"Des passionnés de la donnée se retrouvent une journée entière pour améliorer les données de la plate-forme data.gouv.fr, c’est à dire les mettre en formats ouverts, fusionner des fichiers, détecter des erreurs, produire des visualisations et de nouvelles interprétations.\r\n\r\nLa seule limite sera votre imagination, vous êtes les acteurs de cette journée : producteurs de données issus de l\u0027administration, datascientists, chercheurs, codeurs, designers, associations, experts du réseau Etalab, et toutes sortes de bonnes volontés travailleront ensemble dans des ateliers qu’ils auront choisis.","roomId":-182278998,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-2127523220,621504398],"speakers":[{"speakerId":-2127523220,"name":"Pierre Pezziardi"},{"speakerId":621504398,"name":"Simon Chignard"}]},{"sessionId":888947737,"scheduleId":639287513,"title":"The Dart side of disruption","summary":"Cette session est l’occasion d’apprendre les technologies web innovantes, le langage Dart et la librairie Polymer.\r\n\r\nDart permet de construire des applications web modernes avec un nouveau langage, des bibliothèques de base et des outils comme un gestionnaire de paquets, un éditeur et un compilateur vers JavaScript.\r\n\r\nPolymer est une librairie émergente permettant de créer des web components basés sur les nouveaux standards HTML5.\r\n\r\nAprès une rapide présentation vous commencerez par créer un premier programme en pure Dart puis une application qui tue avec Polymer.dart.","roomId":3346362,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[600621127,118854763,1968825446,-964681547],"speakers":[{"speakerId":600621127,"name":"Alexandre Ardhuin"},{"speakerId":118854763,"name":"Guillaume Girou"},{"speakerId":1968825446,"name":"Mathieu Breton"},{"speakerId":-964681547,"name":"Nicolas François"}]},{"sessionId":952610341,"scheduleId":1053750054,"title":"Hands on elasticsearch","summary":"Partant de l’idée un peu folle qu’il faut utiliser un *moteur de recherche* pour faire de la *recherche*, nous allons démontrer au cours d’un atelier pratique à quel point il est simple de mettre en oeuvre le moteur de recherche elasticsearch:\r\n\r\nNous ferons :\r\n\r\n* démarrage d\u0027elasticsearch\r\n* indexation, recherche, facettes\r\n* création de dashboards avec kibana\r\n* création de deux clusters (par moitié des participants)\r\n* backup et restore d\u0027un cluster vers l\u0027autre\r\n* outils d\u0027administration\r\n","roomId":3346363,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[269613730,-122464889],"speakers":[{"speakerId":269613730,"name":"David Pilato"}]},{"sessionId":953924756,"scheduleId":-1312081632,"title":"Au secours, mon code AngularJS est pourri !","summary":"_“J\u0027ai tout le code métier de mon appli AngularJS dans les contrôleurs, plein de règles de gestion dans les templates, et je ne m\u0027y retrouve plus.”_\r\n\r\nEt oui, on peut écrire du code pourri même avec AngularJS. Bienvenue dans le monde réel !\r\n\r\nLes petits exemples qui démontrent les possibilités du framework sont des exemples à ne surtout pas suivre quand il s\u0027agit d\u0027organiser le code d\u0027une véritable application.\r\n\r\nAngularJS offre tout ce qu\u0027il faut pour bien structurer une application web, à condition de mettre en oeuvre les bonnes pratiques qui vous seront présentées dans cette session.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[1434819762],"speakers":[{"speakerId":1434819762,"name":"Thierry Chatel"}]},{"sessionId":974832282,"scheduleId":-1862028019,"title":"Square: de la collecte d’information à la prise de décision","summary":"Square permet à des millions de marchands d\u0027accepter des paiements par carte bancaire sur leur smartphone.\r\n\r\nEn quête de l\u0027outil de commerce parfait, Square améliore ses produits en collectant des données.\r\n\r\nQuel que soit le produit, l’approche consiste toujours à définir les questions, déduire les informations à remonter et concevoir l’infrastructure nécessaire.\r\n\r\nMon expérience chez Square permet de présenter cette approche au travers d\u0027exemples concrets, parmi lesquels la construction d’une data pipeline permettant d’analyser le comportement de notre lecteur de carte bancaire sur le terrain.","roomId":1707225347,"experience":"","sponsored":false,"tags":["\u0026","Startups","innovation"],"speakerIds":[-1842057863],"speakers":[{"speakerId":-1842057863,"name":"Pierre-Yves Ricau"}]},{"sessionId":1013031314,"scheduleId":2064525643,"title":"Java 8 Lambdas in the Stream","summary":"Enabling bulk data-parallel operations on collections and other aggregates was a key driver for adding lambda language features to Java SE 8. The centerpiece of the Java SE 8 libraries is the new Streams parallel bulk-data API. This session examines the architecture of the Streams API and its implementation in depth providing insights for how to get the best performance and scalability from the library both now and in the future.","roomId":1975599280,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-406572978],"speakers":[{"speakerId":-406572978,"name":"Paul Sandoz"}]},{"sessionId":1028067586,"scheduleId":-174220520,"title":"B.O.F. ParisJS","summary":"C\u0027est le B.O.F. de la communauté JS de Paris","roomId":3346363,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[1113994586],"speakers":[{"speakerId":1113994586,"name":"Khalid Jebbari"}]},{"sessionId":1045614426,"scheduleId":-733973285,"title":"Java8 + RxJava pour sortir de l\u0027enfer des callbacks?","summary":"Au cours de cette session nous présenterons la librairie de programmation asynchrone RxJava : concepts de la programmation réactive, comparaison avec d\u0027autres solutions pour de l\u0027asynchrone, aperçu de l\u0027API.\r\n\r\nNous verrons ensuite comment celle-ci, combinée aux Lambdas de Java 8, pourrait nous faire voir la lumière lorsque l\u0027on est coincé au coeur de l\u0027Enfer Des Callbacks...","roomId":907457591,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-418534457],"speakers":[{"speakerId":-418534457,"name":"Simon Baslé"}]},{"sessionId":1046871725,"scheduleId":14864976,"title":"Hackergarten","summary":"Le **Hackergarten** est un événement organisé dans le but de vous permettre de contribuer à des projets open-source. Cet évènement est la déclinaison parisienne du hackergarten original créé par Hamlet D\u0027Harcy.\r\n\r\nInscription et liste des projets sur :\r\n https://docs.google.com/spreadsheet/ccc?key\u003d0ArSNrzuUVmYldFg1eXVsTXktTnBta1VfTzVMcE9DSmc\u0026usp\u003dsharing#gid\u003d0\r\n\r\nPlease, register and propose your project. \r\nHackergarten takes place on Wednesday, level -1, during Devoxx France.","roomId":-779793838,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[535895431,1841897698],"speakers":[{"speakerId":535895431,"name":"Brice Dutheil"},{"speakerId":1841897698,"name":"Mathilde Lemée"}]},{"sessionId":1048060826,"scheduleId":-286895096,"title":"15\u0027 pour coder Tetris en CoffeeScript","summary":"Venez découvrir CoffeeScript à travers le développement d\u0027une version simplifiée de Tetris en live coding.\r\n\r\nLe développement sera réalisé directement dans la console de Google Chrome. Les tests QUnit seront exécutés à chaud avec le plugin LiveReload de Grunt.","roomId":-191300166,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[-871038149],"speakers":[{"speakerId":-871038149,"name":"Philippe Antoine"}]},{"sessionId":1111514282,"scheduleId":94140070,"title":"Software Craftsmanship","summary":" After over ten years since the Agile summit, software projects are still failing and developers are still behaving and being treated as factory workers. The software development industry is still very amateur when compared to other professions.  Why Agile was not sufficient? Why so many clients are unhappy with their software projects? Why is it so difficult to find good developers? In this talk Sandro will be explaining: what Software Craftsmanship really is, the value of technical practices, what it means to be a professional software developer, and what to do to satisfy our customers.","roomId":1975599280,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[1144770699],"speakers":[{"speakerId":1144770699,"name":"Sandro Mancuso"}]},{"sessionId":1116395710,"scheduleId":133143477,"title":"Mesurer directement depuis le CPU: les compteurs de performance","summary":"Les CPUs intègrent une unité de mesure de performance (PMU) que l\u0027on peut utiliser pour collecter des données sur l\u0027utilisation des caches (hit/miss) des prédictions de branches, du nombre d\u0027instructions, des cycles, etc.\r\nCes compteurs de performance (HPC) peuvent être accédéq en Java grâce à la librairie overseer.\r\nCette présentation montrera comment les mettre en oeuvre avec des exemples de situation où ils sont pertinents pour la compréhension des performances.\r\n","roomId":907287738,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-1668194488],"speakers":[{"speakerId":-1668194488,"name":"Jean-Philippe Bempel"}]},{"sessionId":1121017961,"scheduleId":1432500991,"title":"Développer son conteneur d’application Java léger avec la SPI Weld 2.x et les extensions CDI 1.1","summary":"CDI 1.1 est une brique centrale de l’architecture et du modèle de programmation de la plateforme Java EE 7. Weld 2 en est l’implémentation de référence et est intégré dans les derniers serveurs d’application Java EE 7 tels que WildFly 8.\r\n\r\nNéanmoins, Weld peut également être utilisé de manière autonome dans n’importe quel type d’environnement.\r\n\r\nCette session vous propose de découvrir la SPI Weld 2.1 et les extensions CDI 1.1 qui permettent de développer son propre conteneur d’application et comment Murex, éditeur logiciel, les a mis en œuvre pour faciliter l’utilisation de sa plateforme.","roomId":1975599282,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[296658065],"speakers":[{"speakerId":296658065,"name":"Antonin Stefanutti"}]},{"sessionId":1143507715,"scheduleId":-379238577,"title":"Baby Code Retreat","summary":"Venez coder avec nous pour le plaisir d\u0027apprendre ensemble. Aucune deadline à respecter ni objectif de production. Juste l\u0027envie de pratiquer ensemble, d\u0027améliorer un peu la qualité de son code et de tenter des choses qu\u0027on ne prend pas le temps de faire au travail.\r\n\r\nIl est nécessaire d\u0027avoir (au moins) un environnement de développement du langage de votre choix avec le nécessaire pour écrire et exécuter des tests unitaires.\r\nTout langage est le bienvenu !","roomId":3346361,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-1561165024,-774680307],"speakers":[{"speakerId":-1561165024,"name":"Vincent Ferries"},{"speakerId":-774680307,"name":"Antoine Vernois"}]},{"sessionId":1197670300,"scheduleId":-740020721,"title":"Basses latences, hauts débits : les secrets de la finance pour avoir des systèmes réactifs","summary":"Comment concevoir des systèmes capables d’encaisser des dizaines de milliers d’updates par seconde sans s’engorger, ni dépasser la milli seconde de traitement ? Comment écrire du code scalable qui reste lisible –mais garanti 100% sans deadlock ? Que recouvre le reactive manifesto et les termes : conflation, sequencer, immutable state ? Après vous avoir présenté les besoins et contraintes du trading électronique, nous répondrons à toutes ces questions dans une session qui s\u0027annonce...technique.","roomId":1975599282,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[580088987,-1011529572],"speakers":[{"speakerId":580088987,"name":"Cyrille DUPUYDAUBY"},{"speakerId":-1011529572,"name":"Thomas PIERRAIN"}]},{"sessionId":1359018747,"scheduleId":1610188798,"title":"Chrome Apps for Desktop and Mobile","summary":"Chrome Apps provide the power and capabilities of a native application with the security and reliability of a Web page. In this session you will learn how to build apps with native-like capabilities using HTML5 and JavaScript that can run across all modern desktop OSes as well as mobile ones such as iOS and Android. These apps run outside the browser in their own window, and are launched and used like any other native application.","roomId":907457591,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[586604105],"speakers":[{"speakerId":586604105,"name":"Joe Marini"}]},{"sessionId":1436597370,"scheduleId":1400783724,"title":"Monitoring d\u0027un compteur EDF avec Node.js","summary":"Venez voir comment coupler votre compteur EDF à une carte RaspberryPi / Beaglebone / ... pour avoir une vision temps réel de votre consommation électrique.\r\n\r\nCoté hardware, un montage électronique rudimentaire est utilisé (\u003c 2 €).\r\n\r\nCoté soft, Node.js, MongoDB et AngularJS constituent les briques applicatives principales.","roomId":1975599281,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[-1416884645],"speakers":[{"speakerId":-1416884645,"name":"Laurent HUET"}]},{"sessionId":1492273623,"scheduleId":-591795181,"title":"Au secours, mon portable part en prod ! (ou presque...)","summary":"Sorti depuis à peine un an, Docker est en train de révolutionner l\u0027approche du déploiement et de l\u0027exploitation plus vite que n\u0027importe quel autre outil avant lui.\r\nVoyons comment il peut être utilisé non seulement sur vos projets de développement pour de l\u0027intégration continue, mais aussi sur votre propre poste de développement pour recréer un environnement identique à la production à tout moment.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-501872196],"speakers":[{"speakerId":-501872196,"name":"Pierre Chaussalet"}]},{"sessionId":1576636024,"scheduleId":486843859,"title":"Mise en production continue - 1 an après","summary":"Vous en avez assez de passer pour un hippie quand vous parlez à vos exploitant de déploiement continu ? Vous vous sentez suffisamment confiant pour pousser votre code en production tous les jours, mais personne ne veut vous donner les clefs de la prod ?\r\n\r\nVenez voir comment un développeur (qui pourrait être vous) peut faire 6 déploiements en production en 45 minutes sans même que les utilisateurs ne s\u0027en rendent compte.","roomId":907457591,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-501872196,1436123423],"speakers":[{"speakerId":-501872196,"name":"Pierre Chaussalet"},{"speakerId":1436123423,"name":"Eric le Merdy"}]},{"sessionId":1605537794,"scheduleId":816689555,"title":"The Spring BOF","summary":"Join Spring Developer Advocate Josh Long for a discussion on all things Spring - including Spring MVC, Spring Boot, etc. Bring questions, concerns and ideas and let\u0027s discuss. \r\n\r\n","roomId":102724395,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-432559871],"speakers":[{"speakerId":-432559871,"name":"Josh Long"}]},{"sessionId":1620966898,"scheduleId":1487993632,"title":"BrownBagLunch France, un an déjà !","summary":"BrownBagLunch France est une initiative née au début de l\u0027année 2013. Elle permet à des entreprises de recevoir des experts passionnés (aussi appelés _baggers_) entre midi et 2 en échange d\u0027un déjeuner. BrownBagLunch France c\u0027est un catalogue de près de 250 sessions présentées par plus de 70 baggers dans toute la France.\r\n\r\nCe BOF est l\u0027occasion pour le public de découvrir l\u0027initiative et pour les baggers de parler de leur expérience.\r\n\r\nVenez nombreux !","roomId":3346362,"experience":"","sponsored":false,"tags":["\u0026","Startups","innovation"],"speakerIds":[138362904,636392698],"speakers":[{"speakerId":138362904,"name":"François Sarradin"},{"speakerId":636392698,"name":"Nathaniel Richand"}]},{"sessionId":1665894387,"scheduleId":-662759144,"title":"La révolution Docker","summary":"En très peu de temps, Docker a su s\u0027imposer comme un standard _de facto_ dans le monde du Cloud, ne laissant aucun fournisseur impassible. A mi-chemin entre IaaS et PaaS, Docker brouille les cartes et ouvre de nouvelles opportunités.\r\n\r\nAu cours de ce talk, nous vous présenterons ce qu\u0027est techniquement Docker, son impact sur l\u0027écosystème, comment il a été adopté par Google et CloudBees et comment vous pouvez le mettre à profit pour vos propres développements.\r\n","roomId":1975599280,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[368456049,-472782615],"speakers":[{"speakerId":368456049,"name":"Nicolas de Loof"},{"speakerId":-472782615,"name":"Ludovic Champenois"}]},{"sessionId":1732717031,"scheduleId":1717682655,"title":"BOF Future - Interfaces Gestuelles","summary":"Fans du Leap Motion Controller, de Thalmic Labs Myo, d\u0027autres nouveaux moyens de communiquer avec les ordinateurs, ce BOF est pour vous!","roomId":1596492292,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[-1696480317,1828996194],"speakers":[{"speakerId":-1696480317,"name":"Geert Bevin"},{"speakerId":1828996194,"name":"Claude Falguiere"}]},{"sessionId":1734233090,"scheduleId":-30528601,"title":"MeteorJS : extinction imminente des dinosaures du web","summary":"Recueillez les impressions d\u0027un développeur qui utilise [Meteor](http://meteor.com). Il vous dira que c\u0027est impressionnant, facile, presque magique.\r\n\r\nVenez découvrir pourquoi la planète Internet est aussi enthousiaste à l\u0027égard de cette **plateforme 100% Javascript, 100% libre, qui permet de faire des applications web en un temps record**.","roomId":843733077,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[1095151456,-767251966],"speakers":[{"speakerId":1095151456,"name":"Vianney Lecroart"},{"speakerId":-767251966,"name":"Pascal Richier"}]},{"sessionId":1749666273,"scheduleId":933931521,"title":"Un framework Web from scratch en Scala","summary":"Découvrez Scala à travers la mise en place d\u0027un framework Web asynchrone non-bloquant et multi-thread de moins de 100 lignes de code, en partant de... rien du tout !\r\n\r\nAu programme : fonctions, pattern matching, futures et live coding","roomId":1975599281,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[138362904],"speakers":[{"speakerId":138362904,"name":"François Sarradin"}]},{"sessionId":1758900431,"scheduleId":-1492989618,"title":"Introduction aux Google Glass","summary":"les Google Glass, tout le monde en parle. Mais peu les ont vraiment testées ou ont développé dessus.\r\nCette conférence est une introduction sur les Google Glass et couvrira ce que sont les Glass, comment elles fonctionnent et ce qu\u0027on peut déjà faire avec. On parlera ensuite de développement via la Mirror API et le GDK Sneak Peek, pour finir par un retour d\u0027expérience en tant que Glass Explorer et développeur depuis presque un an. \r\nLa présentation sera accompagnée de démos.\r\n\r\n","roomId":843733077,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[-195068034],"speakers":[{"speakerId":-195068034,"name":"Alain Regnier"}]},{"sessionId":1841366267,"scheduleId":300094631,"title":"Bootstrap your Productivity with Spring Boot","summary":"This talk is a live-coded action packed look at Spring Boot, the convention-over-configuration framework that\u0027s turning heads! ","roomId":907457591,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-432559871],"speakers":[{"speakerId":-432559871,"name":"Josh Long"}]},{"sessionId":1855276543,"scheduleId":-1598657106,"title":" La puissance de mon monoïde est supérieure à 9000","summary":" Marre des explications absconses du type \"Un monoïde est un magma unifère associatif\" ? Cette présentation est faite pour vous ! \r\nÀ l\u0027aide d\u0027un exemple incluant super sayiens et techniques de fusion, découvrez ce qu\u0027est un monoïde en langage intelligible, et surtout, apprenez quel est l\u0027utilité de ce concept dans votre vie quotidienne de développeur.","roomId":907457591,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[-794680994],"speakers":[{"speakerId":-794680994,"name":"Benoit Lemoine"}]},{"sessionId":1899603628,"scheduleId":2105722858,"title":"Développer en mode Kick-Ass","summary":"Développer en mode Kick-Ass permet de vraiment faire les choses.\r\n\r\nDans cette présentation je vous montrerai comment:\r\n- nous utilisons les Pull Requests pour la qualité du code\r\n- collaborer rapidement pour développer vos idées\r\n- éviter les meetings pour être productif\r\n- raccourcir les boucles de retour pour échouer plus rapidement\r\n- raccourcir vos cycles de livraison\r\n- et travailler ensemble à travers différents continents.\r\n\r\nCela peut fonctionner aussi dans votre entreprise.","roomId":907457591,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-1033255198],"speakers":[{"speakerId":-1033255198,"name":"Samuel le Berrigaud"}]},{"sessionId":1919920068,"scheduleId":1101563272,"title":"Reactive Angular","summary":"There\u0027s been a lot of talk about Reactive Programming lately, but nobody really knows exactly what it is. I\u0027ll first talk a little bit about what Reactive Programming is and then we\u0027ll dive into practical examples on how to use it with AngularJS. We\u0027ll see how beautiful and clean our code can be when we use Reactive code with Angular.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[113749325],"speakers":[{"speakerId":113749325,"name":"Martin Gontovnikas"}]},{"sessionId":1932459489,"scheduleId":-2051839411,"title":"BOF de la communauté Software Craftsmanship","summary":"Cette rencontre BOF sera l\u0027occasion de découvrir ce qui se cache derrière le Software Craftsmanship, dans le cadre même de Devoxx. Dans un format de discussion libre, rejoignez-nous avec vos questions, retours et opinions sur les techniques de code et de tests, sur les façons de collaborer en pair programming ou en mob programming, ou encore sur l\u0027attitude en entreprise et sur la notion de professionalisme dans notre métier.\r\n\r\nComme à notre habitude le choix des sujets de discussion sera laissé aux participants en début de session.","roomId":3346362,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-332665943],"speakers":[{"speakerId":-332665943,"name":"Cyrille Martraire"}]},{"sessionId":1932858196,"scheduleId":105600461,"title":"Robotium vs Espresso: Get ready to rumble ! ","summary":"Ladies and gentlemen, boys and girls. Dans le coin rouge, accusant un poids de 104KB, le plus populaire de tous les frameworks de test: Robotium. Dans le coin bleu, avec un poids de 262KB et le support des équipes Google, celui qu’on qualifie de “new comer” : Espresso. Que le match commence !!  \r\n\r\nAu programme nous verrons avec du code le fonctionnement de ces bibliothèques, leurs avantages mais aussi leurs inconvénients. Nous y parlerons également de Calabash Android et de UI Automator. ","roomId":907347320,"experience":"","sponsored":false,"tags":["Mobile"],"speakerIds":[-965883086],"speakers":[{"speakerId":-965883086,"name":"Thomas Guerin"}]},{"sessionId":1954955628,"scheduleId":392989800,"title":"PIT, pour savoir si vos tests vous protègent des mutants","summary":"Vous écrivez des tests, et c\u0027est bien. Mais êtes-vous sûrs qu\u0027ils sont vraiment efficaces ?\r\nPIT est un outil de mutation testing. Cette technique consiste à vérifier que vos tests unitaires passent au rouge lorsque le code testé est modifié, quand on y injecte des bugs, des mutants...\r\nVenez voir par vous même comment il est facile de mettre en place PIT, de l\u0027intégrer à votre build et à SonarQube.\r\nAvec PIT, les mutants n\u0027ont qu\u0027à bien se tenir !","roomId":1707225347,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-1451388362],"speakers":[{"speakerId":-1451388362,"name":"Alexandre Victoor"}]},{"sessionId":2015911861,"scheduleId":1515724548,"title":"One tool to module them all","summary":"Haine farouche envers les variables globales ? Amoureux de Node et de ses modules ? Envie d\u0027exploiter NPM à 100% mais dans votre front-end ? Marre d\u0027écrire toutes vos closures à la main ? Fatigué de gérer par vous même les dépendances entre les différentes parties de votre application ?\r\n\r\nIntroducing Browserify ! Un simple outil en ligne de commande qui va résoudre tous vos problèmes pour enfin avoir un code JavaScript qui respire le propre sans être verbeux à outrance.\r\n\r\n(également disponible en version plugin pour Grunt et Gulp)","roomId":-2049135608,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[1405493915],"speakers":[{"speakerId":1405493915,"name":"Paul Dijou"}]},{"sessionId":2063340364,"scheduleId":1128258962,"title":"Deux années de Continuous Delivery au pays des traders","summary":"Livrer au moins une fois par semaine de la valeur métier à 900 utilisateurs ultra exigeants répartis sur 3 continents.\r\nCe qui était à l’origine une expérience sur une application isolée fait aujourd’hui école dans notre organisation.\r\nLors de cette session, nous vous présenterons le chemin parcouru, des difficultés rencontrées et des changements profonds qui ont été initié","roomId":1975599282,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-1451388362,145684268],"speakers":[{"speakerId":-1451388362,"name":"Alexandre Victoor"},{"speakerId":145684268,"name":"Patrice Séqué"}]},{"sessionId":2064856457,"scheduleId":553397964,"title":"Spring4TW!","summary":"Spring 4\u0027s here and with it comes a bevy of new features (Groovy support, webosckets and STOMP, `@Conditional` beans, asynchronous processing support, Java 8 and Jave EE 7 support, etc) designed to support modern developers. Spring 4 also serves as the underpinning of Spring Boot, the entry point into the Spring platform. Join [Spring Developer Advocate Josh Long](http://spring.io/team/jlong) for a running tour of all these features and more.\r\n","roomId":1975599281,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-432559871],"speakers":[{"speakerId":-432559871,"name":"Josh Long"}]},{"sessionId":-2047852207,"scheduleId":1194374556,"title":"Développer ou debugger ? ","summary":"Comment augmenter la productivité de vos équipes de dev en diminuant leur charge de debugging en prod ? Pour corriger un problème de performance ou de disponibilité, il est souvent nécessaire de le reproduire. Les études souhaitent des informations contextuelles, que la prod ne peut pas fournir. Imaginez que vous puissiez obtenir la pile d\u0027appel de l\u0027utilisateur se plaignant... la résolution ne serait-elle pas plus aisée ? Grâce aux technologies dynaTrace PurePath™ et PureStack™ de Compuware, il vous est possible de corriger des incidents survenus en prod sans passer par la case reproduction.","roomId":907457591,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-739697580,-1050227807],"speakers":[{"speakerId":-739697580,"name":"Gilles Portier"},{"speakerId":-1050227807,"name":"Eric Maillard"}]},{"sessionId":-1951472312,"scheduleId":1095508306,"title":"Reactive All The Way Down","summary":"In this workshop you will build a Reactive application with Play Framework, Scala, WebSockets, and AngularJS.  We will get started with a template app in Typesafe Activator.  Then we will add a Reactive RESTful JSON service and a WebSocket in Scala.  We will then build the UI with AngularJS.","roomId":3346363,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[-816479188,-1306213818],"speakers":[{"speakerId":-816479188,"name":"James Ward"},{"speakerId":-1306213818,"name":"Nicolas Leroux"}]},{"sessionId":-1950619489,"scheduleId":-690005837,"title":"Java SE 8 for Tablets, Pis, and Legos","summary":"This is not your grandfather\u0027s Java ME. Deep dive and demonstration on the new Java Embedded support for ARM processors. We will demonstrate the full power of Java 8 with lambdas running on embedded devices such as Raspberry Pi and PandaBoard, the new Lego Mindstorms EV3, and powering the Internet of Things with embeddable ARM processors. See end-to-end coding on devices, discuss coding practices for building performant applications, and learn how to kick-start your own crowd-sourced device project.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[-1802182073],"speakers":[{"speakerId":-1802182073,"name":"Stephen Chin"}]},{"sessionId":-1931749400,"scheduleId":-1186060028,"title":"Tester simplement et efficacement une application mobile avec Rational Test Workbench","summary":"L\u0027émergence des applications mobiles complexifie le rôle du testeur. En plus des contraintes habituelles, s\u0027en ajoutent d\u0027autres liées à la nature même de ce type d\u0027applications: la diversité des OS et des technologies, les éléments liés à la mobilité (GPS, audio, vidéo...), la grande diversité des caractéristiques techniques des mobiles du marché contribuent à augmenter de façon significative la durée des phases de test. L\u0027objectif de cette session est de présenter comment l\u0027outil RTW peut aider le testeur d\u0027applications mobiles à résoudre ces difficultés inhérentes à ce type d\u0027applications. ","roomId":1707225347,"experience":"","sponsored":false,"tags":["Mobile"],"speakerIds":[539079069],"speakers":[{"speakerId":539079069,"name":"Dominique Guilbaud"}]},{"sessionId":-1917895533,"scheduleId":1776611602,"title":"Test Driven Infrastructure: TDD pour DevOps","summary":"Le Test Driven Infrastructure, c\u0027est un peu le TDD pour les projets DevOps. Il va vous permettre de tester votre infrastructure unitairement, de bout en bout et à chaque changement.\r\n\r\nLors de ce Hand\u0027s on Lab, nous mettrons en oeuvre une infrastructure avec Chef ainsi que les tests associés.\r\n","roomId":3346361,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-1837000334,1220022739],"speakers":[{"speakerId":-1837000334,"name":"Olivier Bazoud"}]},{"sessionId":-1914599131,"scheduleId":1090638539,"title":"Des maths et des recommandations","summary":"Autant dans les systèmes de recommandations que dans le machine learning, beaucoup d\u0027algorithmes reposent sur des concepts et des formules mathématiques pas toujours évidentes à saisir.\r\nJe vous propose donc, au travers de cette présentation, de démystifier les choses en reprenant pas à pas les étapes qui ont permis de construire les systèmes de recommandations actuels.\r\nNous aborderons plus particulièrement le cas du collaborative filtering.","roomId":1975599282,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[1761703803],"speakers":[{"speakerId":1761703803,"name":"Loïc KNUCHEL"}]},{"sessionId":-1896063679,"scheduleId":-1059667821,"title":"Fault Tolerance In Erlang","summary":"Erlang is famous for its use in mission critical, highly concurrent applications like Ericsson\u0027s AXD301, which achieved an unbelievable nine nines uptime! What makes Erlang so suited for building fault tolerance systems? In this talk, Erlang expert Garrett Smith will dissect Erlang\u0027s design and discuss the principles of reliability. He\u0027ll cover language features, the Erlang virtual machine, and application architecture to give you an understanding of what makes Erlang tick and how you can apply the same principles to software you build in other languages.","roomId":907457591,"experience":"","sponsored":false,"tags":["languages","Alternate"],"speakerIds":[865688649],"speakers":[{"speakerId":865688649,"name":"Garrett Smith"}]},{"sessionId":-1879503531,"scheduleId":184989512,"title":"Karma et Protractor, testons vos applications AngularJS","summary":"AngularJS est un framework conçu pour écrire des applications testables. Dans cette présentation je vous propose un tour des solutions offertes pour les tests. Nous commencerons par les tests unitaires pour vos controllers, services, filtres et directives. Pour cela nous utiliserons angular-mock et Karma. Dans une seconde partie nous ferons des tests d\u0027acceptances avec Protractor et ses sélecteurs spécifiques pour AngularJS.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[1470711791],"speakers":[{"speakerId":1470711791,"name":"Christophe Jollivet"}]},{"sessionId":-1834251967,"scheduleId":-1969943616,"title":"JavaScript, the next big ... bytecode","summary":"\"Write once, run everywhere\" ça vous dit quelque chose ? Mais est-ce toujours en référence à Java, ou bien à JavaScript ? Dart, CoffeeScript ou encore TypeScript, pour ne citer que les plus connus, sont des nouveaux langages qui s\u0027exécutent du serveur au browser en étant compilés en JavaScript.\r\n\r\nCette présentation vous fera une revue des langages, des raisons de leurs créations, de leurs avantages et inconvénients et, peut-être, découvrir quel sera le langage de vos futurs développements web.","roomId":1975599280,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[1968825446],"speakers":[{"speakerId":1968825446,"name":"Mathieu Breton"}]},{"sessionId":-1773893391,"scheduleId":580121678,"title":"L\u0027ère numérique","summary":"L\u0027ère numérique","roomId":307138528,"experience":"","sponsored":false,"tags":["\u0026","Startups","innovation"],"speakerIds":[-748407895,1112006927],"speakers":[{"speakerId":-748407895,"name":"Gilles Babinet"},{"speakerId":1112006927,"name":"Kwame Yamgnane"}]},{"sessionId":-1757598920,"scheduleId":-771744882,"title":"Java 8 Streams \u0026 Collectors : patterns, performances, parallélisation","summary":"Java 8 est la, on en parle au présent. La nouveauté majeure de Java 8 est bien sûr l\u0027introduction des lambda expressions. Cette introduction n\u0027aurait pas été utile si l\u0027API Collection n\u0027avait été revue. Cette révision s\u0027appelle l\u0027API Stream, qui, ajoutée à la notion de Collector, rend un peu vieillot notre bon vieux pattern Iterator. Cette université se propose de présenter les patterns construits sur les Streams, et de montrer sur de nombreux exemples, simples et complexes, les nouveaux patterns proposés par cette API. On parlera patterns, parallélisation, implémentation et performances. ","roomId":1975599280,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[557142915],"speakers":[{"speakerId":557142915,"name":"José Paumard"}]},{"sessionId":-1742166751,"scheduleId":988311305,"title":"Mongodb aggregation pipeline","summary":"Présentation du framework aggregation pipeline sorti depuis la version 2.2 de mongodb.","roomId":1975599280,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[1639481107],"speakers":[{"speakerId":1639481107,"name":"Pauline Iogna"}]},{"sessionId":-1723365290,"scheduleId":-170647596,"title":"Application Web Moderne en Java - The CodeStory Way.","summary":"Venez participer à un Hand\u0027s On Lab de 3 heures. L\u0027objectif est simple : apprendre à développer une application web moderne en Java. Rapidement, de manière pragmatique et en toute confiance.\r\n\r\nAvec l\u0027assistance et les démos live de David Gageot et Jean-Laurent de Morlhon.\r\n\r\nAu menu : du Java 8, un poil d\u0027Angular, un soupçon de CoffeeScript, du MongoDB, du pair-programming, des tests IHM, des hotkeys de malade, des plugins de fou et un cycle de développement ultra rapide. Oui vous ne rêvez pas on parle bien de Java.\r\n\r\nLundi, au boulot, vous ne verrez plus votre projet java de la même manière.","roomId":102724459,"experience":"","sponsored":false,"tags":["Web,","HTML5"],"speakerIds":[-1850394981,737726641],"speakers":[{"speakerId":-1850394981,"name":"Jean-Laurent de Morlhon"},{"speakerId":737726641,"name":"David Gageot"}]},{"sessionId":-1722438043,"scheduleId":-1924462774,"title":"Les Applications Réactives : un nouveau paradigme pour relever les défis de l\u0027économie numérique.","summary":"A quels enjeux est confrontée une entreprise qui souhaite développer sa stratégie digitale ? Pourquoi les paradigmes de développement classiques ne sont pas adaptés pour développer les applications du futur ?\r\nNous montrerons tout d\u0027abord pourquoi au delà du buzz marketing, les Applications Réactives apportent une réponse aux défis que doivent relever les organisations. \r\nNous décrirons ensuite les principes réactifs et en illustrerons la mise en oeuvre avec la Plate-forme Play/Akka en Scala. ","roomId":1707225347,"experience":"","sponsored":false,"tags":["\u0026","Startups","innovation"],"speakerIds":[-2066873952,-1232183042],"speakers":[{"speakerId":-2066873952,"name":"Fabrice Croiseaux"}]},{"sessionId":-1442947746,"scheduleId":-1957789784,"title":"Machine Learning, Python et Open Data : démonstration d\u0027un cas d\u0027usage pour geek","summary":"Nous ferons une démonstration réelle d’un cas d’usage de **machine learning** (apprentissage automatique) à l’aide des librairies Python **scikit-learn** et **pandas**.\r\n\r\n- Le jeu de données : un set de 30 000 combinaisons Euromillions, soumises par des joueurs réels (via la plateforme de crowdsourcing [http://www.onewinner.me](http://www.onewinner.me))\r\n\r\n- Le challenge : entrainer un modèle pour prédire si une combinaison donnée (exemple : 3 - 9 - 19 - 32 - 45 / 2 6) est plutôt humaine, ou parfaitement aléatoire\r\n\r\n- L\u0027objectif : aider les geeks à choisir des combinaisons *vraiment* aléatoires !","roomId":1707225347,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-441127472],"speakers":[{"speakerId":-441127472,"name":"Christophe Bourguignat"}]},{"sessionId":-1264701466,"scheduleId":-836094180,"title":"BOF Future - Internet Of Things \u0026 Java","summary":"Stephen Chin and Gary Collins will discuss  the state-of-the art in Java SE and Java ME embedded implementations and evolutions of the Java APIs for Rapsberry Pi.  You will also learn behind-the-scenes secrets of the Raspberry Pi powered Chess Demo. ","roomId":1596492292,"experience":"","sponsored":false,"tags":["Future\u003cDevoxx\u003e"],"speakerIds":[-1802182073],"speakers":[{"speakerId":-1802182073,"name":"Stephen Chin"}]},{"sessionId":-1158766971,"scheduleId":1083541871,"title":"Etre développeur à la sortie de l\u0027école","summary":"Nombre de développeurs seniors partagent avec humour leur expérience à 40 ans du métier de développeur. Mais croyez moi, vous n\u0027imaginez pas les situations loufoques auxquelles un jeune diplômé est confronté dans son quotidien... Laissez moi vous raconter les aventures d\u0027un débutant passionné par notre fabuleux métier.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-1704603637],"speakers":[{"speakerId":-1704603637,"name":"Frédéric Bouquet"}]},{"sessionId":-1063708410,"scheduleId":-1606877701,"title":"Devops Mercenaries 3.0 : Let\u0027s ops !","summary":"DevOps n\u0027est plus une révolution, c\u0027est une pratique d\u0027une grande diversité qui d\u0027années en années donne aux équipes de développement une capacité incroyable.\r\nSi certaines équipes livrent toutes seules et quotidiennement en production, d\u0027autres n\u0027ont toujours pas fait le pas de sérieusement rapprocher les développeurs de la production.\r\nPour cette saison 3 les \"Devops Mercenaries\" reviennent pour vous aider à passer à l\u0027action : un état de l\u0027art de Devops, une revue des outils Devops, des témoignages d\u0027experts, et des idées pour la semaine prochaine.\r\nAlors venez échanger sur Devops à Devoxx !!\r\n","roomId":3094955,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[-98521890,-168686296,-550411125],"speakers":[{"speakerId":-98521890,"name":"Pierre-Antoine Grégoire"},{"speakerId":-168686296,"name":"Dimitri BAELI"},{"speakerId":-550411125,"name":"Henri Gomez"}]},{"sessionId":-807236267,"scheduleId":-881201230,"title":"Git++ : Passez au niveau supérieur de la gestion de version","summary":"On utilise tous git mais on constate trop souvent qu\u0027il est utilisé comme SVN malheureusement. Git apporte de la valeur dans le quotidien d\u0027un développeur sans forcément ajouter de complexité.\r\n\r\nAvec git rebase et un peu de volonté, on peut réussir à avoir un historique expressif qui aidera tous les développeurs à s\u0027y retrouver et il vous permettra même de générer un changelog fonctionnel !\r\nVous pouvez aussi récupérer des commits d\u0027une branche sur une autre. Et plus encore!\r\n\r\nVenez apprendre quelques astuces simples qui vous permettrons d\u0027améliorer votre manière de gérer votre code!","roomId":1975599281,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[1763647671,2121126010],"speakers":[{"speakerId":1763647671,"name":"Cyril Lakech"},{"speakerId":2121126010,"name":"Hubert SABLONNIERE"}]},{"sessionId":-32793451,"scheduleId":-797594494,"title":"Google App Engine... Ca bouge, ca bouge beaucoup....","summary":"Il y a 6 ans, App Engine a pris le monde par surprise en sortant la première Platforme As A Service (PAAS). La révolution continue avec de millions d\u0027applications écrites en Java, Python, Go, ou PHP, du petit site gratuit, jusqu\u0027au monstre qu\u0027est SNAPCHAT, qui échange plus de 400 millions de photos par jour! Toujours la même simplicité d\u0027utilisation. Une à une, les limitations initiales explosent, grâce a l\u0027intégration avec les machines virtuelles de Compute Engine, les containers Docker offrant une fléxibilité extrème, de nouveaux outils (Gradle, Maven) qui vous aident à définir vos APIs Web, vos Connections Mobiles (Android, iOS), Le Cloud DataStore accessible universellement Developeurs: restez au top de la révolution perpétuelle Google.","roomId":1975599280,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[-472782615],"speakers":[{"speakerId":-472782615,"name":"Ludovic Champenois"}]},{"sessionId":30011961,"scheduleId":-1980909885,"title":"Il n\u0027y a pas que les war dans la vie... Les bundles OSGI ça marche aussi.","summary":"Souvent application Java d\u0027entreprise rime avec conteneur de servlet. Cette session présente une solution alternative s\u0027appuyant sur les modèles d\u0027intégration d\u0027entreprise (EIP Enterprise Intégration Patterns) et mettant en oeuvre un ESB \"léger\" embarqué dans un conteneur OSGI. Entre autre seront abordés au cours de la présentation :\r\n l\u0027intérêt de la modularité de cette solution orientée composants.\r\n la construction et le déploiement de bundles OSGI sur un serveur Apache Karaf à partir d\u0027un référentiel Maven. \r\n l\u0027utilisation d\u0027Apache ActiveMQ/Camel pour réaliser une solution orientée message et assurer les couplages minimaux entre les composants.\r\n l\u0027intégration dans l\u0027architecture de systèmes hérités.\r\n\r\nL\u0027ensemble sera illustré par l\u0027exemple","roomId":907457591,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[-1358097018,-503551714],"speakers":[{"speakerId":-1358097018,"name":"Jean-Baptiste Defard"},{"speakerId":-503551714,"name":"Alexandre Lacroux"}]},{"sessionId":1312777615,"scheduleId":-1268496575,"title":"Comment développer un PaaS Java en 30 minutes avec docker","summary":"Les plateformes **Cloud** de type **PaaS** se démocratisent chaque jour au sein des DSI et des équipes de développeurs. En parallèle la gamme des solutions s’étoffe régulièrement OpenShift, CloudFoundry, CloudUnit et évolue techniquement très vite.\r\n\r\nEn 2013, [**docker**](http://docker.io) a révolutionné la mise en place des **PaaS** comme la virtualisation à ses débuts a révolutionné la création de IaaS. Certainement la technologie à suivre en 2014 !\r\n\r\nCette session vous permettra de comprendre l’intérêt d’une plateforme **PaaS** à travers l’outil OSS [**docker**](http://docker.io). Un exemple concret de développement Java/REST permettra de fournir un catalogue de services tels que Tomcat, JBoss, Jenkins, Apache RollerBlog.","roomId":1975599281,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[1309831831,-844371386],"speakers":[{"speakerId":1309831831,"name":"Nicolas Muller"},{"speakerId":-844371386,"name":"Fabien Amico"}]},{"sessionId":1690495962,"scheduleId":1414879112,"title":"Pourquoi vous ne devriez jamais écrire AES ou SHA dans votre code ?","summary":"L\u0027utilisation directe d\u0027algorithmes cryptographiques réputés sûrs ne suffit pas à garantir la sécurité de nos applications. Par ex., l\u0027emploi de SHA + un salt pour l\u0027authentification par mot de passe ou l\u0027usage seul de l\u0027AES pour le chiffrement des données ne sont pas sûrs. Lors de ce talk, à travers un rapide panorama des attaques possibles et le cassage en live d\u0027un système basé sur AES, vous comprendrez que le développeur doit se placer à un niveau d\u0027abstraction plus élevé qu\u0027il n\u0027a l\u0027habitude de le faire. Vous découvriez également des bibliothèques dont l\u0027API résouds ces problèmes.","roomId":1975599282,"experience":"","sponsored":false,"tags":["Agility,","DevOps"],"speakerIds":[210119652],"speakers":[{"speakerId":210119652,"name":"Thierry Abaléa"}]},{"sessionId":1954359894,"scheduleId":33192591,"title":"Tout ce que vous avez toujours voulu savoir de la JVM sans jamais oser lui demander en ligne de commande","summary":"Cette session vous propose une piqûre de rappel (ou découverte) des outils fournis dans le JDK, mais pas n\u0027importe lesquels: il sera essentiellement question du terminal et de la ligne de commande!\r\nQue vous soyez un nerd ne jurant que par la pureté de la ligne de commande ou bien simplement un dev à la recherche d\u0027un kit de survie dans un environnement dépourvu d\u0027interface graphique, venez passer en revue les informations que la JVM tient à votre disposition: de la configuration de la JVM, en passant par l\u0027état de la mémoire, des threads ou encore l\u0027activité du Garbage Collector et du JIT.","roomId":907347320,"experience":"","sponsored":false,"tags":["EE","Java","SE,"],"speakerIds":[1644086909],"speakers":[{"speakerId":1644086909,"name":"Brice Leporini"}]},{"sessionId":1979032228,"scheduleId":1488990799,"title":"Lambda Architecture - Choose your tools for Real-Time Big Data","summary":"\"Lambda Architecture\" est un terme générique pour décrire les architectures Big Data qui stockent et traitent en temps réel de la donnée, et savent la gérer à la fois comme un stock et comme un flux. \r\nDe nombreuses architectures et outils ont été développés dans les mois précédents pour répondre à cette problème et aller au-delà d\u0027Hadoop1: Storm+Hadoop, Spark Streaming, SummingBird, Hydra. Les stores NoSQL (CouchBase...MongoDb..) peuvent aussi fournir une solution à ces problème jusqu\u0027à un certain point.\r\nDans cette présentation nous présenterons et comparerons ces outils.","roomId":1975599282,"experience":"","sponsored":false,"tags":["NoSQL","Big","Cloud,","Data,"],"speakerIds":[163938140],"speakers":[{"speakerId":163938140,"name":"Florian Douetteau"}]}],"version":3}