{"sessions":[{"sessionId":3078,"scheduleId":840484962,"title":"Le cloud c\u0027est quoi ?","summary":"Sacha Labourey, CEO et fondateur de Cloudbees, vous donnera les enjeux du Cloud pour les entreprises d\u0027aujourd\u0027hui et de demain","type":"AM des décideurs","theme":"Startup, architecture et entreprenariat","roomId":27,"experience":"SENIOR","sponsored":false,"tags":["cloud"],"speakerIds":[1539],"speakers":[{"speakerId":1539,"name":"Sacha Labourey"}]},{"sessionId":3092,"scheduleId":825297544,"title":"Normal ou décaféiné ?","summary":"Nous voyons tous vers où s’oriente le web. Mais cet avenir sera-t-il caféiné ou décaféiné ?","type":"Conference","theme":"Jeux, Web et Mobile","roomId":12,"experience":"SENIOR","sponsored":false,"tags":["web"],"speakerIds":[182],"speakers":[{"speakerId":182,"name":"Alexis Moussine-Pouchkine"}]},{"sessionId":2258,"scheduleId":964235240,"title":"24 Plugins Chrono","summary":"Pas de Jack Bauer dans cette session mais un développeur qui passe en revue 24 plugins pour \u003cà barrer\u003esauver le monde\u003c/à barrer\u003e booster votre IDE !","type":"Tools in Action","theme":"Développeur au quotidien","roomId":13,"experience":"NOVICE","sponsored":false,"tags":["IDE"],"speakerIds":[1415],"speakers":[{"speakerId":1415,"name":"Romain MATON"}]},{"sessionId":2848,"scheduleId":965276003,"title":"Déminage d\u0027une application avec JRockit Mission Control","summary":"Vous avez certainement déjà entendu parler de la JVM JRockit.\r\nJRockit fournit un ensemble d\u0027outils nommé JRockit Mission Control.\r\nDurant cette session, je partirai d\u0027une application présentant de nombreux problèmes de performances.\r\nNous verrons comment éradiquer les problèmes avec JRockit Mission Control !\r\n\r\nAvec la fusion \"prochaine\" de la JRockit et de Hotspot, cette problématique risque de vous intéresser.","type":"Tools in Action","theme":"Java, one track to rule them all","roomId":14,"experience":"SENIOR","sponsored":false,"tags":["javase","performance","javaee"],"speakerIds":[1615],"speakers":[{"speakerId":1615,"name":"François Ostyn"}]},{"sessionId":2691,"scheduleId":841502661,"title":"Modèles de concurrence en Go","summary":"La concurrence est un facteur clé pour le design de services sur le réseau à haute performance. Les primitives Go pour la concurrence, goroutines et channels (canaux), offrent un moyen pour l\u0027exprimer d\u0027une façon simple et efficace. Pendant cette session nous verrons comment des problèmes complexes peuvent être résolus gracieusement avec du code Go simple.","type":"Conference","theme":"Langages alternatifs","roomId":16,"experience":"SENIOR","sponsored":false,"tags":["patterns","google","Concurrency"],"speakerIds":[2577],"speakers":[{"speakerId":2577,"name":"Francesc Campoy Flores"}]},{"sessionId":3029,"scheduleId":979011035,"title":"JUG Leader BOF","summary":"BOF des JUG Leaders Français (et francophone)","type":"BOF","theme":"Java, one track to rule them all","roomId":19,"experience":"SENIOR","sponsored":false,"tags":["JUG"],"speakerIds":[116],"speakers":[{"speakerId":116,"name":"Antonio Goncalves"}]},{"sessionId":2464,"scheduleId":964235240,"title":"Présentation de Frege, un langage fonctionnel dans l\u0027esprit d\u0027Haskell tournant sur la JVM","summary":"Frege est un langage fonctionnel à typage fort. Il est pure, possède un système d\u0027inférence basé sur l\u0027algorithme d\u0027Hindley–Milner. Comme pour Haskell, les annotations de type sont très rarement nécessaires. Comme le langage tourne sur la JVM, il est possible d\u0027appeler du code Java dans Frege de manière transparente. Voici les points qui seront abordés durant la présentation:\r\n\r\n- Présentation générale de Frege\r\n- La syntaxe\r\n- Principales différences avec Haskell\r\n- Les différents outils (compilateur et REPL)\r\n- Les futures fonctionnalités","type":"Tools in Action","theme":"Langages alternatifs","roomId":18,"experience":"NOVICE","sponsored":false,"tags":["FunctionalProgramming"],"speakerIds":[2454],"speakers":[{"speakerId":2454,"name":"Yorick Laupa"}]},{"sessionId":2288,"scheduleId":0,"title":"Hackergarten Paris","summary":"Envie de voir l’autre coté du miroir ? Saisissez la chance de contribuer à des projets open-source. Ensemble nous allons, avec plusieurs commiters open-source pour nous accompagner, soumettre des patchs, des features ou d’autres contributions. Pendant ces 3 heures, tout le monde est le bienvenu ou la bienvenue, amenez juste votre portable et votre volonté !\r\n\r\nCet évènement est la déclinaison parisienne du hackergarten original créé par Hamlet D\u0027Harcy.","type":"Hands-on Labs","theme":"Java, one track to rule them all","roomId":0,"experience":"NOVICE","sponsored":false,"tags":["mockito","Maven","jenkins","javaee","Testing"],"speakerIds":[1431,1393],"speakers":[{"speakerId":1431,"name":"Brice Dutheil"},{"speakerId":1393,"name":"Mathilde Lemee"}]},{"sessionId":2547,"scheduleId":993849416,"title":"Live coding avec Yeoman \u0026 AngularJS","summary":"Qui n’a jamais réalisé une interface d’édition de données type CRUD ? Il faut toujours beaucoup de code passe plat et ce n’est jamais aussi facile que cela le devrait.\r\nL’ecosystème JavaScript permet aujourd’hui de le faire plus simplement que jamais. Après une rapide présentation des solutions Yeoman http://yeoman.io et AngularJS http://angularjs.org, réalisation en live coding d’une interface Web permettant consultation, création, modification et suppression à partir d’un service REST existant.","type":"Tools in Action","theme":"Jeux, Web et Mobile","roomId":30,"experience":"NOVICE","sponsored":true,"tags":["javascript","HTML5"],"speakerIds":[2378],"speakers":[{"speakerId":2378,"name":"Matthieu Lux"}]},{"sessionId":2697,"scheduleId":965276003,"title":"Build \u0026 Deploy on your own cloud","summary":"You have a crazy new idea you\u0027d like to try but you need an application server to run it ? You also need to store your data in MySQL, PostgreSQL... or maybe even in MongoDB ? Are you also looking for Continuous Integration ?\r\n\r\nIn this session, you\u0027ll see how OpenShift Origin, Red Hat\u0027s open source PaaS lets you easily deploy your Java applications on your own infrastructure. You\u0027ll also see how it integrates with JBoss Tools to seamlessly code and then publish without leaving your Eclipse IDE.","type":"Tools in Action","theme":"Infrastructure, hardware d’hier et de demain","roomId":13,"experience":"NOVICE","sponsored":false,"tags":["OpenShift","jboss","Tools"],"speakerIds":[1471],"speakers":[{"speakerId":1471,"name":"Xavier Coulon"}]},{"sessionId":2199,"scheduleId":1609775878,"title":"BOF du Paris Scala User Group","summary":"Nous allons organiser une session special du Scala User Group. Avec si possible des guest star etc (un peu comme l\u0027année precédente). Oui je sais Nico, je te dois une girafe de biere ;)","type":"BOF","theme":"Langages alternatifs","roomId":27,"experience":"SENIOR","sponsored":false,"tags":["scala"],"speakerIds":[1555],"speakers":[{"speakerId":1555,"name":"Alexis Agahi"}]},{"sessionId":2613,"scheduleId":811945029,"title":"Les tests: pourquoi et comment ?","summary":"Comme tout développeur, vous vous êtes intéressé aux tests pour votre projet ou votre application perso. Mais voilà, vous êtes perdu entre tous les articles en ligne, les retours plus ou moins positifs que vous entendez:\r\nQuel framework ? Quel type de test ? Est-ce que l’investissement en temps/code est vraiment rentable? Par où commencer ? Faut-il tout tester ? Comment faire en sorte que les tests soient pertinents ? Comment les valoriser au maximum ?\r\nN’ayez plus peur des tests et venez apprendre différentes façons d’en écrire et de les valoriser !","type":"Conference","theme":"Développeur au quotidien","roomId":14,"experience":"NOVICE","sponsored":true,"tags":["Legacy","Testing","TDD","refactoring","mocking"],"speakerIds":[2534,2536,2469],"speakers":[{"speakerId":2534,"name":"Axel Haustant"},{"speakerId":2536,"name":"xavier renaudin"},{"speakerId":2469,"name":"Grégory PAUL"}]},{"sessionId":2770,"scheduleId":129461629,"title":"Memory Systems and how to get the best out of them","summary":"We keep hearing that \"the free lunch is over\" and our CPUs are not getting any faster.  What most people do not realise is that CPUs are spending the majority of their time idle while they wait to be feed by our memory systems.  Memory systems include our Caches, DRAM, Rotating Hard Drives, and Solid State Drives (SSDs).\r\n\r\nIn this talk we will explore these memory systems to gain an understanding of how they work.  With this understanding we can show mechanical sympathy in the code that we write to get much better performance.  We will also gaze into the future at what new technology is coming and muse about what we would like to see.","type":"University","theme":"Java, one track to rule them all","roomId":13,"experience":"SENIOR","sponsored":false,"tags":["performance"],"speakerIds":[2511],"speakers":[{"speakerId":2511,"name":"Martin Thompson"}]},{"sessionId":2936,"scheduleId":1540131208,"title":"Objects and functions, conflict without a cause?","summary":"Keynote : \r\nHow and why objects became popular, and what we can learn from that for the current shift towards functional programming.","type":"Conference","theme":"Langages alternatifs","roomId":12,"experience":"SENIOR","sponsored":false,"tags":["FunctionalProgramming","Lambda","scala"],"speakerIds":[304],"speakers":[{"speakerId":304,"name":"Martin Odersky"}]},{"sessionId":2406,"scheduleId":1609775878,"title":"BOF Duchess France","summary":"Rencontre de la communauté Duchess France","type":"BOF","theme":"Développeur au quotidien","roomId":19,"experience":"NOVICE","sponsored":false,"tags":["Duchess"],"speakerIds":[1285],"speakers":[{"speakerId":1285,"name":"Claude Falguière"}]},{"sessionId":3072,"scheduleId":841502661,"title":"Raising Your Visibility Seed Round","summary":"Startup success takes more than sharp vision and smart code. Early\r\nadopters of your product, along with excited press, bloggers and\r\nengaged social users spreading the word can mean the difference. We\u0027ll\r\ntalk about how to find these early first users, how to gain a\r\nrelationship with top press and use all channels possible to get your\r\nword out.","type":"Conference","theme":"Startup, architecture et entreprenariat","roomId":13,"experience":"NOVICE","sponsored":false,"tags":["google","collaboration","social"],"speakerIds":[2650],"speakers":[{"speakerId":2650,"name":"Gray Louis"}]},{"sessionId":3082,"scheduleId":0,"title":"Voyages SNCF et le Cloud","summary":"VSCT a utilisé la souplesse offerte par le cloud pour lancer très rapidement des développements de nouvelles applications afin\r\n- de ne pas dépendre du provisionning de serveurs physiques (via Amazon)\r\n- de ne pas dépendre de la mise en place d\u0027une usine logicielle (via cloudbees)\r\nPour de multiples raisons (coûts, SLA, ...) VSCT récupère en interne l\u0027hébergement de ces applications.\r\nVSCT se dote progressivement d\u0027une solution de virtualisation, d\u0027usine logicielle et d\u0027indus pour répondre à ce besoin","type":"AM des décideurs","theme":"Startup, architecture et entreprenariat","roomId":0,"experience":"SENIOR","sponsored":false,"tags":["cloud"],"speakerIds":[2663],"speakers":[{"speakerId":2663,"name":"Philippe Martin"}]},{"sessionId":2488,"scheduleId":723287013,"title":"FLATMAP ZAT SHIT : les monades expliquées aux geeks","summary":"Vous commencez à peine dans la programmation fonctionnelle avec Scala, Java 8, CoffeeScript, etc. et on vous sort déjà des noms à dormir debout. Parmi ceux-ci, il en a un qui fait la joie des Scalaïstes les plus velus : je veux parler des monades.\r\n\r\nDans cette session, je vous propose de découvrir ce qu\u0027est une monade, à quoi ça sert et est-ce qu\u0027il y a un intérêt de les étudier... ou pas ! La présentation qui contient plus de code que de slides se fera autour de deux langages : Java 8 et Scala.","type":"Conference","theme":"Langages alternatifs","roomId":27,"experience":"SENIOR","sponsored":false,"tags":["Java8","FunctionalProgramming","SoftwareCraftsmanship","scala"],"speakerIds":[1476],"speakers":[{"speakerId":1476,"name":"François Sarradin"}]},{"sessionId":2412,"scheduleId":864506538,"title":"Les Cast Codeurs Podcast... putain 4 ans déjà!","summary":"Les Cast Codeurs est LE podcast francophone de la communauté Java. Animé par Emmanuel Bernard (Hibernate, JBoss by Red Hat), Antonio Goncalves (ParisJUG, Indep), Guillaume Laforge (Groovy, VMWare), Vincent Massol (XWiki, Eponyme) et bien sûr Mr 1/2 Arnaud Héritier (Maven, eXo Platform), le podcast vous informe dans la bonne humeur des nouvelles de Java au sens large.\r\n\r\nVenez fêter avec nous notre quatrième anniversaire pour un enregistrement en direct à Devoxx France!\r\n\r\nhttp://lescastcodeurs.com","type":"Conference","theme":"Développeur au quotidien","roomId":16,"experience":"NOVICE","sponsored":false,"tags":["Podcast"],"speakerIds":[117,1414,647,6,116],"speakers":[{"speakerId":117,"name":"Emmanuel Bernard"},{"speakerId":1414,"name":"Vincent Massol"},{"speakerId":647,"name":"Arnaud Heritier"},{"speakerId":6,"name":"Guillaume Laforge"},{"speakerId":116,"name":"Antonio Goncalves"}]},{"sessionId":2281,"scheduleId":129461629,"title":"Les mains dans le Ceylon : venez coder avec les auteurs du langage","summary":"Pendant ce hands-on vous pourrez découvrir les attraits du langage Ceylon. \r\n\r\nCeylon a pour buts d´être un langage de programmation puissant, lisible et prévisible, mais également une plate-forme complète avec modularité et outillage moderne.\r\n\r\nLes auteurs du langage seront là pour vous faire découvrir, le langage, les outils, et l´écosystème de Ceylon, jusqu´à vous faire publier votre premier module sur Ceylon Herd.\r\n\r\nIdéal pour ceux qui aiment mettre les mains dans le cambouis et qui veulent voir pour croire :)","type":"Hands-on Labs","theme":"Langages alternatifs","roomId":29,"experience":"NOVICE","sponsored":false,"tags":["Ceylon"],"speakerIds":[762,117],"speakers":[{"speakerId":762,"name":"Stephane Epardaud"},{"speakerId":117,"name":"Emmanuel Bernard"}]},{"sessionId":3077,"scheduleId":870129890,"title":"Photobox et le Cloud","summary":"L\u0027activité de Photobox comprend un fort pic en fin d\u0027année. L\u0027élasticité du cloud permet de réduire les investissements tout en améliorant les services clients. Le cloud a aussi permis la manipulation de volumes de données ingérables jusque là.","type":"AM des décideurs","theme":"Startup, architecture et entreprenariat","roomId":27,"experience":"SENIOR","sponsored":false,"tags":["cloud"],"speakerIds":[2660],"speakers":[{"speakerId":2660,"name":"Bruno Emsellem"}]},{"sessionId":2299,"scheduleId":716734529,"title":"Quelle JVM prendre pour votre carte ARM ?","summary":"Développer en Java sur des cartes ARM (Raspberry Pi, Beaglebone, ...), proche du monde de l\u0027embarqué, est encore assez peu répandu.\r\nLes ressources sur ces cartes sont assez contraintes (puissance CPU, mémoire, ...) et variées (ARM v6 / v7 / ...). Choisir la bonne JVM pour son projet est donc très important.\r\nDans ce quickie, différentes JVM sont passées en revue et un petit bench comparatif permettra de se faire une idée de cet écosystème.","type":"Quickie","theme":"Infrastructure, hardware d’hier et de demain","roomId":15,"experience":"SENIOR","sponsored":false,"tags":["javase","RaspberryPI"],"speakerIds":[2275],"speakers":[{"speakerId":2275,"name":"Laurent HUET"}]},{"sessionId":3076,"scheduleId":811024546,"title":"Joemobile et le Cloud","summary":"10 mois pour construire son SI et devenir opérateur mobile: voilà le challenge que Joemobile a relevé en faisant appel à des acteurs reconnus du Cloud. Au final, un environnement applicatif hautement scalable et des coûts de développement optimisés.","type":"AM des décideurs","theme":"Startup, architecture et entreprenariat","roomId":27,"experience":"SENIOR","sponsored":false,"tags":["cloud"],"speakerIds":[2659,139],"speakers":[{"speakerId":2659,"name":"Didier Herbault"},{"speakerId":139,"name":"Cyrille Le Clerc"}]},{"sessionId":2808,"scheduleId":993849416,"title":"eXtreme testing avec Byteman","summary":"Comment faire pour tester les situations les plus extrêmes avec les frameworks de tests les plus courants ? Du code legacy ?\r\n\r\nDe la simulation d\u0027un disque plein à la simulation d\u0027un ralentissement d\u0027une liaison client-serveur, byteman est la solution la plus facile et efficace à mettre en place.\r\nNous verrons à l\u0027aide d\u0027exemples concrets comment byteman peut aider le développeur au quotidien pour fournir des tests d\u0027intégrations/systèmes les plus simples et efficaces possible.","type":"Tools in Action","theme":"Java, one track to rule them all","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["javase","Testing"],"speakerIds":[1393],"speakers":[{"speakerId":1393,"name":"Mathilde Lemee"}]},{"sessionId":2556,"scheduleId":1639328550,"title":"BOF Devoxx 4 Kids France","summary":"L’initiative Devoxx4Kids a été lancée en Belgique l’an dernier : celle ci consiste à organiser, une fois par an, une journée d’ateliers d’initation à la programmation et de découverte de l’informatique en général pour les enfants. Une sorte de Devoxx pour les mini geeks, avec des robots, du code et du fun :) \r\n\r\nL’objet de ce BOF sera de présenter les membres qui vont porter l’initiative en France et les objectifs du groupe aux participants qui ne connaîtraient pas encore Devoxx4Kids ou, à ceux qui au contraire, la connaissent déjà et aimeraient la porter dans leur ville.","type":"BOF","theme":"Développeur au quotidien","roomId":19,"experience":"NOVICE","sponsored":false,"tags":["children"],"speakerIds":[1654,1285],"speakers":[{"speakerId":1654,"name":"Audrey Neveu"},{"speakerId":1285,"name":"Claude Falguière"}]},{"sessionId":2376,"scheduleId":965276003,"title":"Soon, in a galaxy not so far away","summary":"Après une exposition des capacités temps réel de Play2 qui répondra à cette éternelle question : \"WTF are Iteratees ?\", cette présentation vous permettra de découvrir leur mise en application dans des applications web fun et ludiques à base de Akka, SSE, WebSocket, Canvas, webcam et de vaisseaux spatiaux ...\r\n\r\nCes applications seront l\u0027occasion de voir concrètement comment utiliser la puissance offerte par les APIs de Play2 depuis votre langage préféré.","type":"Tools in Action","theme":"Jeux, Web et Mobile","roomId":19,"experience":"SENIOR","sponsored":false,"tags":["real-time","HTML5","scala","PlayFramework"],"speakerIds":[966],"speakers":[{"speakerId":966,"name":"Mathieu Ancelin"}]},{"sessionId":2559,"scheduleId":717748229,"title":"The bright dynamic future of Java","summary":"Maintenant que Java 8 est fini (au moins feature complete), il est temps de se pencher sur ce que pourrait être Java 9 :)\r\nJava a une longue tradition qui consiste à offrir aux développeurs utlisant le JDK les mêmes outils que ceux utilisés par les développeurs écrivant le JDK. Cette tradition a été rompu lors de la release du JDK 7 (puis du JDK8) car il est possible pour les développeurs core d\u0027utiliser invokedynamic (les lambdas par exemple l\u0027utilise) mais il n\u0027est pas possible de l\u0027utiliser directement en Java.\r\n\r\nCe talk décrit, comme marche invokedynamic, comment il est actuellement utiliser dans le JDK ou par des runtime de langages comme Groovy ou JRuby puis dans un second temps propose une syntaxe qui pourrait être inclue dans Java 9 permettant introduire un peu de dynamicité que l\u0027on voit habituellement dans les langages dynamiques en gardant le système de typage statique.","type":"Conference","theme":"Java, one track to rule them all","roomId":14,"experience":"SENIOR","sponsored":false,"tags":["Java9","JVM","Lambda"],"speakerIds":[1479],"speakers":[{"speakerId":1479,"name":"Remi Forax"}]},{"sessionId":2445,"scheduleId":747305861,"title":"The Lightning Memory-Mapped Database","summary":"The Lightning Memory-Mapped Database (LMDB) is a new database library written by Symas Corp. for the OpenLDAP Project. LMDB is a highly optimized B+tree implementation that is orders of magnitude faster and more efficient than everything else in the software world. Reads scale perfectly linearly across arbitrarily many CPUs with no bottlenecks, and data is returned with zero memcpy\u0027s. Writes are on average twenty times faster than commonly available databases such as SQLite. The entire library compiles down to only 32K of object code, allowing it to execute completely inside a typical CPU\u0027s L1 cache. Backends for OpenLDAP slapd, Cyrus SASL, Heimdal, SQLite, OpenDKIM and many other projects have already been written.\r\n\r\nThis talk gives an overview of the library design, example code, and operational results of using LMDB in various projects.","type":"Conference","theme":"Jeux, Web et Mobile","roomId":13,"experience":"SENIOR","sponsored":false,"tags":["NoSQL","performance","scalable","big data"],"speakerIds":[2446],"speakers":[{"speakerId":2446,"name":"Howard Chu"}]},{"sessionId":2470,"scheduleId":1639328550,"title":"La mort prochaine du GC ?","summary":"* Des signaux faibles :\r\n- Fin de la loi de Moore en 2018\r\n- NECESSITE de l’algorithme G1\r\n- Ralentissement des programmes en 64 bits par rapport à 32 bits\r\n- De nouveaux frameworks pour gérer la mémoire hors heap\r\n- Émergence du Big-Data et du Database in Memory\r\n- Apple déprécie le GC d’Objective-C\r\n* Comment retarder l’échéance ?\r\n* Les solutions alternatives ?\r\n* Sélectionner maintenant les technos de demain\r\n\r\nVenez polémiquer !!!","type":"BOF","theme":"Java, one track to rule them all","roomId":15,"experience":"SENIOR","sponsored":false,"tags":["performance"],"speakerIds":[1591],"speakers":[{"speakerId":1591,"name":"Philippe PRADOS"}]},{"sessionId":2224,"scheduleId":964235240,"title":"3615 Cloud@Devoxx","summary":"!! Exclusivité pour DevoxxFr !! \r\n\r\nDans cette session, vous allez découvrir comment \"marier l\u0027internet français d\u0027hier avec le Cloud d\u0027aujourd\u0027hui !\"\r\n\r\nDe manière décalée, venez découvrir comment, avec un petit peu de hardware, on peut superviser ses instances du cloud avec un Minitel et une carte Raspberry Pi! Ce bricolage trans-générationnel servira de support pour présenter la programmation sur Raspberry, depuis le niveau hardware jusqu\u0027à notre bonne vielle JVM","type":"Tools in Action","theme":"Infrastructure, hardware d’hier et de demain","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["cloud","RaspberryPI"],"speakerIds":[2275,998],"speakers":[{"speakerId":2275,"name":"Laurent HUET"},{"speakerId":998,"name":"nicolas loof"}]},{"sessionId":2448,"scheduleId":129461629,"title":"Monitoring Open Source pour Java avec JmxTrans, Graphite et Nagios","summary":"Le feedback rapide offert par le monitoring est un élément essentiel des bonnes pratiques de Continuous Delivery. Java dispose dans son écosystème d\u0027un composant robuste dédié à cela : JMX.\r\n\r\nCependant, la difficulté de raccordement de JMX à des outils de supervision et de graphe a longtemps été un frein à son adoption.\r\n\r\nJetez aux orties les solutions bancales à base de logs applicatifs ou d\u0027interface web mal protégées, et venez découvrir une voie ouverte. Une nouvelle génération d\u0027outils Open Source permet de grapher simplement les métriques de vos applications et de les fournir à un système de supervision et d\u0027alerte.\r\n\r\nDans une logique DevOps, nous verrons ensemble comment intégrer la dimension Monitoring dans un projet : de la conception des métriques par les développeurs, à l\u0027intégration des besoins des équipes Ops et Q\u0026A, en déploiement traditionnel ou dans le Cloud. JmxTrans, Graphite et Nagios, ce tryptique peut vous faciliter la vie, venez découvrir comment.","type":"University","theme":"Infrastructure, hardware d’hier et de demain","roomId":27,"experience":"NOVICE","sponsored":false,"tags":["performance","DevOps","JMX"],"speakerIds":[817,1463],"speakers":[{"speakerId":817,"name":"Cyrille Le Clerc"},{"speakerId":1463,"name":"Henri Gomez"}]},{"sessionId":2806,"scheduleId":129461629,"title":"Pratiques de caching avancées","summary":"Dans des systèmes avec des contraintes de plus en plus fortes, chaque milliseconde gagnée compte.  A tous les niveaux, le cache peut nous aider à diminuer nos temps de réponses. Nous verrons comment, en utilisant en exemple concret, nous pourrons au fur et à mesure améliorer drastiquement les performances d\u0027une application web et aller jusqu\u0027à le clusterer.","type":"Hands-on Labs","theme":"Java, one track to rule them all","roomId":19,"experience":"NOVICE","sponsored":false,"tags":["cache","Ehcache"],"speakerIds":[1393,2555],"speakers":[{"speakerId":1393,"name":"Mathilde Lemee"},{"speakerId":2555,"name":"Aurélien Broszniowski"}]},{"sessionId":2428,"scheduleId":717748229,"title":"Real Options: quand et comment (ne pas) prendre des decisions","summary":"L\u0027analyse par les Options Réelles (http://fr.wikipedia.org/wiki/Analyse_par_les_options_r%C3%A9elles) est une technique qui permet de prendre des décisions sur les décisions. C\u0027est cool, c\u0027est meta.\r\n\r\nMais quel est l\u0027intéret pour le développeur au quotidien?\r\n\r\nVous prenez plein de décisions chaque jour comme développeur ou architecte. Des décisions qui peuvent couter cher.\r\n\r\nLes Options Réelles ne sont pas très compliquées, cela s\u0027explique en quelques minutes. Mais en applicant les Options Réelles sur les projets informatiques et lsur \u0027architecture des logiciels j\u0027ai découvert que plein de choses que je croyais vrai ou qui me semblaient intuitivement correct étaient fausses.\r\n\r\nDécouvrez une autre façon de voir les décisions, des techniques simples pour gérer des projets ou définir une architecture de logiciel. Vous découvrirez peut-être que vous aussi croyez des choses qui sont fausses.\r\n\r\nAu minimum vous entendrez quelques histoires belges... :-)","type":"Conference","theme":"Développeur au quotidien","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["agile","Methodology"],"speakerIds":[2442],"speakers":[{"speakerId":2442,"name":"Pascal Van Cauwenberghe"}]},{"sessionId":2218,"scheduleId":129461629,"title":"Introduction iOS6 pour les développeurs Java","summary":"Dans la révolution mobile d\u0027aujourd\u0027hui, il est important de comprendre un minimum les bases de toutes les plates-formes disponibles. Sans aucun doute, la plate-forme iOS joue un grand rôle dans cet univers. Il est utile de savoir comment elle fonctionne.\r\n\r\nPour créer des applications iOS, nous aurons besoin de nous familiariser avec le langage propriétaire d\u0027Apple, Objective C. Etant développeurs Java, Objective C peut paraître bizarre au début, mais c\u0027est un langage dynamique puissant, ayant ses racines en C .\r\n\r\nDans cette université, nous discuterons les différences entre les concepts linguistiques, en comparant Objective C et Java. Aussi, nous vous présenterons les principes généraux pour la construction d\u0027une application iOS.","type":"University","theme":"Jeux, Web et Mobile","roomId":14,"experience":"NOVICE","sponsored":false,"tags":["iPhone","Apple","iOS","mobile"],"speakerIds":[1985],"speakers":[{"speakerId":1985,"name":"Michael Seghers"}]},{"sessionId":2891,"scheduleId":834948906,"title":"Android Bad Practices : comment foirer son app","summary":"Comment écrire du code incompréhensible ? Comment garantir l\u0027incompatibilité avec les différentes versions d\u0027Android ? Comment faire planter une appli en cas de rotation, d\u0027interaction avec la backstack ou de retour à la Home ? Comment construire un build non reproductible ?\r\n\r\nVenez découvrir de nombreuses erreurs, comment les expliquer et comment les éviter à l\u0027avenir.\r\n\r\nNous couvrirons des problématiques allant du build à l\u0027archi, avec au milieu beaucoup de code. J\u0027en profiterais pour vous présenter la stack technique de Square.","type":"Conference","theme":"Jeux, Web et Mobile","roomId":15,"experience":"NOVICE","sponsored":false,"tags":["android"],"speakerIds":[1514],"speakers":[{"speakerId":1514,"name":"Pierre-Yves Ricau"}]},{"sessionId":3073,"scheduleId":841502661,"title":"De compiletout.bat à l\u0027Usine Logicielle pour Java","summary":"Le couple IDE + gestionnaire de sources ne suffit plus à une équipe de développement. Ajoutez maintenant à cela : construction continue, entrepôt d\u0027artefacts, déploiement continu, générateurs et relecteurs de code et vous passez de l\u0027établi à la véritable usine de fabrication logicielle ou \"Software Factory\".\r\n\r\nCette session vous propose un tour d\u0027horizon de l\u0027outillage actuel du développement Java (les plans de l\u0027usine en quelque sorte).\r\nChacun des composants recensés sera présenté pour expliquer son utilité, comment il intervient, quels sont les outils qui permettent de le mettre en œuvre et surtout quelques conseils et bonnes questions à se poser.\r\nEt pour finir, nous constaterons l’émergence d\u0027un nouveau profil, voire d\u0027un nouveau métier : Software Factory Manager.","type":"Conference","theme":"Infrastructure, hardware d’hier et de demain","roomId":15,"experience":"NOVICE","sponsored":true,"tags":["CI"],"speakerIds":[2656],"speakers":[{"speakerId":2656,"name":"Rams Guillaume"}]},{"sessionId":2609,"scheduleId":658678597,"title":"WTF - What\u0027s The Fold ?","summary":"Venez découvrir le concept de Fold !\r\nHérité de la programmation fonctionnelle, le Fold abstrait l\u0027itération sur vos structures de données, et améliore l\u0027expressivité de votre code.\r\nAvec de vrais bouts de Java 8 et une pincée de Haskell !","type":"Conference","theme":"Java, one track to rule them all","roomId":14,"experience":"SENIOR","sponsored":false,"tags":["Java8","FunctionalProgramming"],"speakerIds":[1567],"speakers":[{"speakerId":1567,"name":"Olivier Croisier"}]},{"sessionId":2620,"scheduleId":929150666,"title":"The Adventurous Developer\u0027s guide to JVM Languages","summary":"Today there are over 50 actively worked JVM languages in existence today. Some have been ported to the JVM while others have been written specifically for the JVM.  This hands on session with take an introductory (but non hello, world) look at a number of JVM languages including, Java 8, Scala, Groovy, Kotlin, Ceylon, Xtend and Clojure as well as the tooling support, discussing how and why they came about along with the evolution of the languages and distinguish the innovative languages versus those which consolidate existing features from other languages. We\u0027ll cover our initial experiences including what rocked and sucked learning each one with example code snippets of a sample HTTP Server from each language. \r\n\r\nYou don\u0027t need any prior knowledge in these languages to attend the session. You will learn about why these other languages have come about, whether they are for you and hear some real life experiences of trying these languages for the first time.","type":"Conference","theme":"Langages alternatifs","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["Java8","groovy","Clojure","Ceylon","scala"],"speakerIds":[2541],"speakers":[{"speakerId":2541,"name":"Simon Maple"}]},{"sessionId":2424,"scheduleId":723287013,"title":"Developers: Prima Donna\u0027s of the 21st Century","summary":"We are developers. We are creators. We are misunderstood by customers, by managers and even co-workers, we are undervalued and often overworked. People don\u0027t appreciate the value we put in our craft and and our drive for innovation. We are central to business in the 21st century yet people don\u0027t appreciate us! \" Of course you are, but you also forgot to mention: You suck at communication. You often put business at risk based on personal ambitions and waste serious amounts of time trying to improve and discuss the wrong things, all in the name of the next great thing that\u0027s going to solve it all. You\u0027ve completely forgotten the plot! Don\u0027t believe me? Why don\u0027t you come along to this talk and get a wake up call. But don\u0027t expect to be treated nicely.","type":"Conference","theme":"Développeur au quotidien","roomId":14,"experience":"NOVICE","sponsored":false,"tags":["HTML5"],"speakerIds":[2028],"speakers":[{"speakerId":2028,"name":"Hadi Hariri"}]},{"sessionId":2963,"scheduleId":834948906,"title":"CodeStory 2013","summary":"CodeStory 2013","type":"Conference","theme":"Jeux, Web et Mobile","roomId":27,"experience":"NOVICE","sponsored":false,"tags":["javase","HTML5"],"speakerIds":[1382,450],"speakers":[{"speakerId":1382,"name":"David Gageot"},{"speakerId":450,"name":"Jean-Laurent de Morlhon"}]},{"sessionId":2356,"scheduleId":965276003,"title":"L\u0027épluche légume : un outil simple et efficace.  5 outils en 5 minute chacun, pour être plus productif dans le développement de tous les jours","summary":"Certains outils ne sont pas juste bien, ils sont extrêmement intuitifs, simples et efficaces et n\u0027imposent pas de contraintes à l\u0027utilisateur. \r\nCette démo montrera quelques outils que j\u0027ai souvent trouvé très utiles dans le développement (java)","type":"Tools in Action","theme":"Développeur au quotidien","roomId":30,"experience":"SENIOR","sponsored":false,"tags":["Tools"],"speakerIds":[1501],"speakers":[{"speakerId":1501,"name":"Guillaume Tardif"}]},{"sessionId":2777,"scheduleId":979011035,"title":"DataGeeks Meetup","summary":"A la demande de certains, je soumets à votre haute bienveillance l\u0027idée d\u0027organiser un petit meetup Datageeks dans le cadre du Devoxx. Les informations sur ce groupe se trouvent : http://www.meetup.com/Paris-Datageeks\r\n\r\n\r\nQuelles sont les frontières actuelles du BigData? Études de cas réels et des perspectives sur les avenirs immédiats et lointains. Quels sont les cas au-delà de l\u0027utilisation en marketing et e-commerce? Qu\u0027est-ce que les BigData signifie  pour la culture et la politique?\r\n\r\nSur le plan technique, nous allons plonger dans la BigData sémantique (hey, c\u0027est déjà assez difficile de le faire sur une petite échelle ...)! Le text mining! et Apprentissage Machine en Katascale! Spark! Cuda et agrégats en temps réel. Mais comme cela sera dans le cadre des BOFs, le contenu sera celui proposé par les participants","type":"BOF","theme":"Startup, architecture et entreprenariat","roomId":17,"experience":"SENIOR","sponsored":false,"tags":["big data"],"speakerIds":[2339],"speakers":[{"speakerId":2339,"name":"Ori Pekelman"}]},{"sessionId":2800,"scheduleId":964235240,"title":"Gradle, 30 minutes pour tout changer","summary":"Gradle amène une syntaxe déclarative et une grande souplesse pour organiser son build, vous pourrez assister au live-coding d\u0027un script de build. En partant d\u0027une feuille blanche vous verrez comment packager l\u0027application en jar puis en war, démarrer un serveur jetty contenant l\u0027application et enfin personnaliser la phase de tests pour utiliser jacoco.\r\nLa deuxième partie montrera comment mettre en place l\u0027intégration continue pour cette application en se basant sur Jenkins,Sonar et Gradle.","type":"Tools in Action","theme":"Java, one track to rule them all","roomId":30,"experience":"NOVICE","sponsored":false,"tags":["CI","jenkins"],"speakerIds":[2448],"speakers":[{"speakerId":2448,"name":"Sébastien cogneau"}]},{"sessionId":2422,"scheduleId":0,"title":"Mercenaires de Devops: Les fous du labo 4","summary":"Vous êtes développeur, et vous en avez marre que les packages natifs fournis pour vos outils de développement soient inadaptés?\r\nVous êtes agacés parce que ces packages ne permettent pas d\u0027installer en parallèle plusieurs version de votre logiciel?\r\nVous souhaitez avoir plus de maîtrise ou comprendre comment créer vos propres packages natifs?\r\n\r\nVenez nous rejoindre dans cette aventure folle qui va consister à hacker des packages natifs à tout va tout au long de la conférence, en utilisant une approche Kanban pour suivre l\u0027avancement et prioriser la préparation des packages.\r\n\r\nC\u0027est une aventure à laquelle nous invitons les contributeurs des outils que nous allons packager, ainsi que les utilisateurs pour incorporer leurs judicieuses remarques.\r\n\r\nNous tenterons tout au long du processus d\u0027expliquer un maximum ce qui sera fait par les spécialistes.","type":"Hands-on Labs","theme":"Infrastructure, hardware d’hier et de demain","roomId":0,"experience":"SENIOR","sponsored":false,"tags":["DevOps"],"speakerIds":[622,1611,1463],"speakers":[{"speakerId":622,"name":"Pierre-Antoine Grégoire"},{"speakerId":1611,"name":"Dimitri Baeli"},{"speakerId":1463,"name":"Henri Gomez"}]},{"sessionId":2712,"scheduleId":129461629,"title":"6 Minute Apps!  Build Your First Modern Web App","summary":"This session will get you started building modern web apps with HTML5 and the Play Framework.  You will learn how to create a new Play application, add JSON REST services, use JavaScript + jQuery, and make it all look good with Bootstrap.  On the server we will use a combination of Java and Scala.","type":"Hands-on Labs","theme":"Jeux, Web et Mobile","roomId":18,"experience":"NOVICE","sponsored":false,"tags":["javascript","javase","jQuery","REST","HTML5","scala","PlayFramework"],"speakerIds":[993,39],"speakers":[{"speakerId":993,"name":"James Ward"},{"speakerId":39,"name":"Nicolas Leroux"}]},{"sessionId":3001,"scheduleId":899593034,"title":"Structures de données exotiques, au delà de ArrayList, HashMap et autres HashSet.","summary":"Dans notre vie de développeur au quotidien, nous en revenons assez à manipuler les mêmes structures de données. Cependant ces derniers ne représentent qu\u0027une infime partie de ce que nos librairies préférées nous fournissent.\r\nDans ce talk nous souhaitons faire découvrir ou rappeler l\u0027existence de structures de données avancées, tels que les bloom filtrés, les Banker\u0027s queues, les Trie, ou les arbres rouge noir.  Ces structures se retrouvent dans nos bases de données préférées, dans nos frameworks adorés, leur garantissant des performances intéressantes. Nous présenterons leurs caractéristiques, ainsi que dans quels cas ils ont avantageux.","type":"Conference","theme":"Java, one track to rule them all","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["Java8","Guava"],"speakerIds":[2600],"speakers":[{"speakerId":2600,"name":"Sam Bessalah"}]},{"sessionId":2781,"scheduleId":658678597,"title":"Sécurité pour les entreprises dans un monde nuageux et mobile.","summary":"Les besoins de sécurité de l\u0027information ont dramatiquement évolués ces dernières années, avec l\u0027émergence de 3  tendances fortes : la prolifération des appareils mobiles, l\u0027importance des réseaux sociaux et l\u0027utilisation des services de cloud-computing. Face à ces changements, les entreprises se doivent de réagir,  transformer leur infrastructure et renforcer leurs capacité à sécuriser l\u0027information et ses échanges. Au coeur du sujet, se trouve la gestion des identités.\r\nA travers l\u0027exemple de la solution Open Identity Stack de ForgeRock, une solution de gestion des identités open source et en Java, nous regarderons les différents besoins, les nouveaux standards en train d\u0027emerger, et nous en mesurerons l\u0027impact sur les infrastructures du système d\u0027information et l\u0027architecture des applications.\r\n\r\nMots Clés : Sécurité, Authentification, autorisation, federation, approvisionnement, SSO, OAuth, SCIM,","type":"Conference","theme":"Infrastructure, hardware d’hier et de demain","roomId":16,"experience":"NOVICE","sponsored":false,"tags":["social","authentication","OAuth","cloud","authorization","security","mobile","OpenAM"],"speakerIds":[200],"speakers":[{"speakerId":200,"name":"Ludovic Poitou"}]},{"sessionId":2640,"scheduleId":811945029,"title":"What Every Hipster Should Know About Functional Programming","summary":"Different programming paradigms serve different purposes. Systems programmers prefer tools that are dumb, imperative and close to the metal. Enterprise programmers prefer tools which foster complexity, increasing billable hours and the client\u0027s dependency on the developer.\r\n\r\nAnd, let me just come clean and admit it, functional programmers do it for that delicious feeling of superiority that comes from looking down your nose at the normals in their caves banging together for loops and mutable state to make fire.\r\n\r\nTreat yourself to a crash course in the vocabulary of functional programming: lambdas, higher order functions, purity and immutability, the infinite opportunities to throw the word \"monad\" in the face of anyone who thinks an ironic moustache is enough to justify all that self-assured smugness these days. You\u0027ll never have to lose a programming argument again once you\u0027ve learned where to casually toss terms like \"applicative functor\" and \"Kleisli triple\" into the conversation.","type":"Conference","theme":"Langages alternatifs","roomId":16,"experience":"NOVICE","sponsored":false,"tags":["javascript","FunctionalProgramming"],"speakerIds":[1456],"speakers":[{"speakerId":1456,"name":"Bodil Stokke"}]},{"sessionId":2615,"scheduleId":687279724,"title":"Un code JavaScript à toute épreuve avec l\u0027aide PMD","summary":"Avec l\u0027émergence de AJAX, et de nombreux \"frameworks\" JavaScript comme JQuery, node.js, angular.js et bien d\u0027autre, ce langage de script devient une part de plus en plus importante de toutes applications \"web\". Néanmoins, il est très difficile avec ce dernier de garantir la cohérence sur l\u0027ensemble d\u0027un projet - deux développeurs peuvent réaliser la même fonctionnalité de manière radicalement différente !\r\n\r\nEn plus de rendre le code peu maintenable, ceci n\u0027aide pas non plus à partager les mêmes pratiques de programmation. Heureusement, depuis la sortie de PMD 5.0, il est désormais possible de réaliser de contrôle le code Javascript et ainsi de non seulement assurer la cohérence d\u0027un projet mais aussi de facilement partager les \"bonnes pratiques\" entre développeurs.\r\n\r\nDémonstrations par la pratique !","type":"Quickie","theme":"Langages alternatifs","roomId":13,"experience":"SENIOR","sponsored":false,"tags":["javascript"],"speakerIds":[1372],"speakers":[{"speakerId":1372,"name":"Romain PELISSE"}]},{"sessionId":3070,"scheduleId":864506538,"title":"Live Coding session: Une application WOA en 50 minutes","summary":"Nous vous proposons de nous suivre pendant 50 minutes en direct pendant que nous écrivons une application WOA (basée sur Play Framework et Scala) intégrant un service Web (l’API twitter), manipulant du JSON à la volée, connecté à un DataStore NoSQL (MongoDB), distribuant des données en temp réel (Server Sent Events) vers une interface Web HTML5, CSS3 rendue dynamique avec une touche de JavaScript.\r\n\r\nZéro slides, Guillaume Bort sera au clavier, pendant que Sadek Drobi comentera et donnera les éléments nécessaire à la compréhension du code et de l’architecture.\r\n\r\nNous sauvegarderons en direct vers un dépot GitHub pour que tout le monde puisse suivre pendant, ou se rattraper après.","type":"Conference","theme":"Jeux, Web et Mobile","roomId":15,"experience":"NOVICE","sponsored":true,"tags":["CSS3","JSON","MongoDB","HTML5","scala","PlayFramework","Twitter"],"speakerIds":[1640,1292],"speakers":[{"speakerId":1640,"name":"Guillaume Bort"},{"speakerId":1292,"name":"Sadek Drobi"}]},{"sessionId":2419,"scheduleId":964235240,"title":"Git Push Deploy - developer collaboration in the cloud with Github \u0026 Heroku","summary":"Using the flexibility of git \u0026 your favorite build tool it becomes a natural process to deploy your applications to the cloud. Git enables collaboration between developer \u0026 underpins an effective build process along with continuous integration servers like Travis-CI / Jenkins. Deployment to Heroku uses the build process you already established to make application deployment seamless. \r\n\r\nThe session will show developer workflows for real-time deployment, with the audience collaborating on the application development. \r\n\r\nThe cloud can also be a great way for developers to try out new technology, like MongoDB, Redis, etc. I\u0027ll show how services like Heroku enable developers \u0026 technical communities to build amazing applications in the space of a hackathon. The cloud is also great for startups too and for larger organisation it the cloud can be used as an R\u0026D environment for new technologies","type":"Tools in Action","theme":"Développeur au quotidien","roomId":29,"experience":"SENIOR","sponsored":false,"tags":["collaboration","Git","Heroku"],"speakerIds":[2435],"speakers":[{"speakerId":2435,"name":"John Stevenson"}]},{"sessionId":2669,"scheduleId":717748229,"title":"NIO, pas si simple ?","summary":"Développer une application communicante n\u0027est pas une évidence. Dès qu\u0027il s\u0027agit de gérer plusieurs milliers de sessions simultanées, s\u0027appuyer sur de l\u0027IO bloquante peut s\u0027avérer impossible.\r\n\r\nNIO est une alternative permettant de s\u0027affranchir de cette limite, au prix d\u0027une complexité accrue de la gestion des IO.\r\n\r\nLe framework Apache MINA a pour objectif de vous aider à développer cette couche de communication, et de vous éviter de regarder ce qui se passe sous le capot. \r\n\r\nLes aspects suivant seront explicités afin de vous aider à construire votre solution sans (trop) de peine :\r\n- gestion concurrente des sessions\r\n- scalabilité du serveur\r\n- encodage/décodage \r\n- performances\r\n\r\nQuelques exemples réalistes seront également présentés pour montrer comment construire un serveur efficace en quelques lignes de code.","type":"Conference","theme":"Java, one track to rule them all","roomId":15,"experience":"SENIOR","sponsored":false,"tags":["nio"],"speakerIds":[1672],"speakers":[{"speakerId":1672,"name":"Emmanuel Lecharny"}]},{"sessionId":2515,"scheduleId":129461629,"title":"Gatling Crash Course","summary":"Face à l\u0027explosion du traffic internet, la résistance à la charge des applications est devenu un enjeu majeur.\r\nPour cela, il est impératif de convenablement s\u0027outiller.\r\n\r\nGatling est un injecteur très performant, grâce sur une architecture d\u0027acteurs Akka et d\u0027IO non bloquants.\r\nIl permet de monter des tests de charge à la fois maintenables et évolutifs.\r\n\r\nCe labs est l\u0027occasion de découvrir l\u0027outil ou de se perfectionner auprès des committers du projet.\r\nIl couvre tous les aspects de la réalisation des tests de charge avec Gatling:\r\n\r\n* initialisation des scripts avec le recorder\r\n* customisation à l\u0027aide du DSL (Scala ne mord pas)\r\n* exécution et analyse\r\n* reporting temps réel via Graphite\r\n* automatisation via Jenkins\r\n\r\nPlus d\u0027information sur Gatling sur http://gatling-tool.org.","type":"Hands-on Labs","theme":"Développeur au quotidien","roomId":28,"experience":"NOVICE","sponsored":false,"tags":["asynchronous","actors","Testing","Akka","Tools"],"speakerIds":[1440,2424],"speakers":[{"speakerId":1440,"name":"Stéphane Landelle"},{"speakerId":2424,"name":"Pierre DAL-PRA"}]},{"sessionId":2371,"scheduleId":929150666,"title":"Gérer une infrastructure hétéroclites facilement grâce à Puppet et MCollective","summary":"Dans la plupart des grandes compagnies, de nombreux systèmes d\u0027exploitation, tel que Windows, AIX ou de multiples déclinaisons de Linux, cohabitent. Même avec une ferme politique pour limiter ces derniers est imposée, dès les débuts de la société, les inévitables rachats et fusion, aboutissent tôt à tard, à la création d\u0027un système d\u0027information hétéroclite. Pour gérer de tels systèmes, les solutions Open Source Puppet et MCollective, reçoivent une adoption de plus en plus massive.\r\n\r\nCette présentation propose donc de décrire comment ces outils permettent à ces compagnies de gérer leur systèmes d\u0027informations avec des processus unifiés, leurs permettant de gérer ces différents systèmes, et leurs logiciels, de manière transparente. Cette présentation évoquera, en détail, l\u0027automatisation de la mise en place d\u0027infrastructure à l\u0027aide de Puppet, ainsi que leur gestion à l\u0027aide de MCollective.","type":"Conference","theme":"Infrastructure, hardware d’hier et de demain","roomId":15,"experience":"NOVICE","sponsored":true,"tags":["DevOps","cloud"],"speakerIds":[1372],"speakers":[{"speakerId":1372,"name":"Romain PELISSE"}]},{"sessionId":2238,"scheduleId":723287013,"title":"RealityIS_AGraph","summary":"Tout le monde connaît NoSQL.\r\n\r\nEt pour cause ! Vous avez remplacé vos MySQL par du MongoDB, vos commerciaux (et ceux de 10gen) sont fiers de vous.\r\n\r\nSeulement, votre domaine métier convient-il vraiment à une base de données orientée documents ? N’y a t’il pas plusieurs domaines métier au sein du vôtre ?\r\n\r\nDurant ce “code-driven talk”, nous rappellerons brièvement les principes inhérents aux graphes, leur élégance et leur facilité d’adaptation à de nombreux domaines avant d’explorer l’architecture et les différentes API de Neo4J. Nous verrons également comment créer une API REST 100% orientée métier avant d’aborder SpringData.\r\n\r\n\r\nSceptiques ?\r\nSee you at Devoxx France ;)","type":"Conference","theme":"Java, one track to rule them all","roomId":16,"experience":"NOVICE","sponsored":false,"tags":["NoSQL","Neo4J"],"speakerIds":[1614],"speakers":[{"speakerId":1614,"name":"Florent Biville"}]},{"sessionId":2852,"scheduleId":723287013,"title":"L\u0027art de Bricoler","summary":"\"Pour explorer le champ des possibles, le bricolage est la méthode la plus efficace\". \r\n- Hubert Reeves, astrophysicien. \r\n\r\nSylvain présentera comment à partir d\u0027un besoin identifié et d\u0027un peu d\u0027huile de coude, il a su créé un jeu de toute pièce dans le navigateur web. Tirant partie des technologies Javascript Gamepad API et de la balise HTML5 video, Sylvain nous partagera ses réflexions autour d\u0027une interface de contrôle inattendue : le tapis de danse. Des volontaires seront alors invités sur scène à s\u0027affronter sur le jeu \"Running Spree\" en direct.\r\n\r\nTechnologies abordées :\r\n* Gamepad API\r\n* Balise video\r\n* WebFonts\r\n* Web Audio API\r\n* CSS Gradient\r\n* CSS Transition","type":"Conference","theme":"Jeux, Web et Mobile","roomId":13,"experience":"NOVICE","sponsored":false,"tags":["CSS3","javascript","web","HTML5"],"speakerIds":[2611],"speakers":[{"speakerId":2611,"name":"Sylvain Weber"}]},{"sessionId":2215,"scheduleId":629120965,"title":"Domotique Low Cost, façon DIY","summary":"La multiplicité des cartes accessibles aux développeurs que nous sommes permet d\u0027imaginer des solutions de domotique à coût réduit, pour peu qu\u0027on soit prêt à adopter la méthode DIY (Do It Yourself) ...\r\n\r\nDans cette session, vous allez avoir quelques idées facilement reproductibles chez vous pour :\r\n- Superviser votre compteur EDF\r\n- Monitorer la météo\r\n- Piloter votre chauffage, VMC, Volets roulant, ...\r\n- Sécuriser votre maison\r\n- Et bien d\u0027autres choses\r\n\r\nCoté technologies, il y aura du Hard et du Soft !\r\nPour le Hard, les cartes Beablebone, Raspberry Pi et Arduino seront présentées ainsi que l\u0027interfaçage de divers capteurs.\r\nPour le Soft, différentes alternatives seront présentées pour interfacer les éléments Hard avec les langages / frameworks classiques sur nos projets (Java, nodeJS, HTML, WebSocket, Android).\r\n\r\nUne démonstration sera de la partie avec différents capteurs.\r\n\r\nLa conclusion sera l\u0027estimation de coût des principaux éléments à mettre en place","type":"Conference","theme":"Infrastructure, hardware d’hier et de demain","roomId":27,"experience":"NOVICE","sponsored":false,"tags":["javase","HTML5","RaspberryPI"],"speakerIds":[2275],"speakers":[{"speakerId":2275,"name":"Laurent HUET"}]},{"sessionId":2520,"scheduleId":658678597,"title":"Animez vos pages HTML5: un tour d\u0027horizon complet des techniques d\u0027animation en HTML5","summary":"Android et iOS ont habitué le public à de nouvelles interfaces utilisateur, où les animations, utilisées à bon escient, rendent l\u0027expérience plus fluide et plus intuitive. Les utilisateurs exigent maintenant le même confort sur le web, fixe ou mobile.\r\n\r\nCette présentation fait le tour des 4 technologies d\u0027animation offertes par HTML5 et disponibles dans les navigateurs modernes: CSS3 et SVG pour le côté déclaratif, Canvas et WebGL pour la partie programmatique. La présentation est elle-même écrite en HTML5 et riche en illustrations et animations.\r\n\r\nslides: http://animateyourhtml5.appspot.com/\r\n\r\n(\"Animate Your HTML5\" a été présenté, à différents stades d\u0027achèvement l\u0027an dernier à de nombreuses conférences. C\u0027est la première fois que la présentation apparaîtra dans sa version complète, couvrant toutes les technologies d\u0027animation.)","type":"Conference","theme":"Jeux, Web et Mobile","roomId":13,"experience":"NOVICE","sponsored":true,"tags":["CSS3","animations","HTML5","webgl"],"speakerIds":[1622],"speakers":[{"speakerId":1622,"name":"Martin Gorner"}]},{"sessionId":3071,"scheduleId":776884325,"title":"Real-time Hadoop: Do it right now with Hadoop and Storm","summary":"This talks explains how real-time applications that have long been considered off-limits for Hadoop clusters are now possible.  Ted describes how latencies of less than 5 seconds can be achieved for a sample metrics application while still retaining years of data with high availability and durability.  This real-time approach is done using a hybrid system consisting of Storm plus Hadoop that cooperates to do something neither can do alone.","type":"Conference","theme":"Infrastructure, hardware d’hier et de demain","roomId":16,"experience":"SENIOR","sponsored":false,"tags":["MapReduce","Hadoop","performance","big data"],"speakerIds":[2649],"speakers":[{"speakerId":2649,"name":"Ted Dunning"}]},{"sessionId":2862,"scheduleId":848884488,"title":"Android, take it to the next level","summary":"Vous avez développé votre application Android ? Vous en êtes plutôt satisfait et vous demandez comment encore l\u0027améliorer ?\r\n\r\nDurant cette présentation nous allons aborder, par la pratique, les sujets sensibles dans la conception et le développement d\u0027une application Android qui, lorsqu\u0027ils sont jugés avec justesse, vous permettrons de satisfaire au mieux vos futurs utilisateurs.\r\nNous démarrerons à partir d\u0027un projet déjà construit que nous améliorerons ensemble de manière itérative afin de l\u0027optimiser un maximum, en 3 heures de temps.\r\n\r\nL\u0027ensemble des personnes souhaitant améliorer en même temps que nous l\u0027application afin de tester en directe les applications devront posséder un ordinateur avec le SDK Android installé et fonctionnel (voir ici : http://d.android.com)\r\nLe code source utile pour la session sera disponible sur Github. Un lien sera posté asap.","type":"Hands-on Labs","theme":"Jeux, Web et Mobile","roomId":19,"experience":"NOVICE","sponsored":false,"tags":["GUI","android","performance","Livecoding","security","Design"],"speakerIds":[1452,2554,2547],"speakers":[{"speakerId":1452,"name":"Eyal Lezmy"},{"speakerId":2554,"name":"Sylvain Galand"},{"speakerId":2547,"name":"Thierry Dassonville"}]},{"sessionId":2142,"scheduleId":899593034,"title":"Mastering Android Drawables","summary":"Over the past few years, the quality of apps in the Google Play Store has increased substantially. Developers are taking Android UI seriously and producing beautiful apps made of tons of graphics resources (Bitmaps, 9-patches, shapes, etc.) every day. To avoid developers the pain of handling all types of resources, the Android framework provides the Drawable abstraction.\r\n\r\nIn this session we will deep dive into the android.graphics.drawable package and how the framework uses it internally to render scalable and responsive UIs. The Drawable notion is essential to the creation of UIs on Android but developers usually only scratch the surface of it. The class will help you to understand how framework-provided and custom Drawables can be used to make both your code cleaner and your app better, smoother and more polished.","type":"Conference","theme":"Jeux, Web et Mobile","roomId":14,"experience":"SENIOR","sponsored":false,"tags":["GUI","android"],"speakerIds":[1619],"speakers":[{"speakerId":1619,"name":"Cyril Mottier"}]},{"sessionId":2298,"scheduleId":848884488,"title":"The Mocha Raspberry Pi Lab","summary":"The Rasberry Pi is a $25, credit-card sized computer that that plugs in to a TV and keyboard. It includes an ARM chip that is powerful enough to run a full version of Java SE including JavaFX. In this lab you will get a chance to test out Java and JavaFX technology running on a very accessible embedded platform. With a full Java Virtual Machine at your disposal, the possibilities are endless!\r\n\r\nPlease pre-install a VNC client on your machine (TightVNC for Windows, Chicken VNC for Mac are both free):\r\n\r\n    http://www.tightvnc.com/download.php\r\n    http://sourceforge.net/projects/chicken/files/Chicken-2.1.1/","type":"Hands-on Labs","theme":"Jeux, Web et Mobile","roomId":28,"experience":"SENIOR","sponsored":false,"tags":["JavaSE7","RaspberryPI","javafx"],"speakerIds":[98,1912],"speakers":[{"speakerId":98,"name":"Stephen Chin"},{"speakerId":1912,"name":"Simon Ritter"}]},{"sessionId":2688,"scheduleId":848884488,"title":"Introduction à Go","summary":"Cette session de trois heures est un mélange de théorie, exercices de programmation, et beaucoup de fun.\r\n\r\nLe cours est composé de trois sections assez indépendantes. \r\n1 - Les bases de Go.\r\n2 - Composition: Types, méthodes et interfaces.\r\n3 - Concurrence: Goroutines et channels (canaux).","type":"Hands-on Labs","theme":"Langages alternatifs","roomId":17,"experience":"NOVICE","sponsored":false,"tags":["google","Concurrency"],"speakerIds":[2577],"speakers":[{"speakerId":2577,"name":"Francesc Campoy Flores"}]},{"sessionId":2430,"scheduleId":629120965,"title":"Le classpath n\u0027est pas mort, mais presque","summary":"En 2009, la mort du classpath a été annoncée. Les classloaders à plat ou hiérarchiques devaient être remplacés par des systèmes modulaires et tous nos problèmes de dépendance devaient se résoudre d\u0027eux-même. Quatre ans plus tard, le classpath vit toujours et pour quelques années encore.\r\n\r\nDans la première partie de cette session, je vous propose de revenir sur le fonctionnement des classloaders du JDK et les problèmes infernaux posés par le classpath. Nous verrons aussi comment les serveurs d\u0027applications, comme Tomcat, gèrent leur classloaders de façon hiérarchique, afin d\u0027isoler les applications entre elles. \r\n\r\nDans la deuxième partie, je parlerai de modularité et de son impact sur la gestion des dépendances, à l\u0027exécution des applications. Des solutions existent déjà, comme OSGi et Jigsaw, d\u0027autres émergent, comme JBoss Modules. Je vous montrerai comment ce dernier fonctionne, dans JBoss AS 7, en autonome, ou même dans Tomcat.\r\n\r\nVous saurez ainsi comment vous sortir de l\u0027enfer du classpath.","type":"Conference","theme":"Java, one track to rule them all","roomId":16,"experience":"SENIOR","sponsored":false,"tags":["javase"],"speakerIds":[447],"speakers":[{"speakerId":447,"name":"Alexis Hassler"}]},{"sessionId":2506,"scheduleId":834948906,"title":"Winter is coming","summary":"La technologie Java et plus généralement Java EE est à son apogée. Fort de ce constat les technologistes de tous bords, qu’ils soient des experts en back ou en front, luttent pour faire chuter le royaume. Dans cette drôle de confrontation, il est difficile de s’y retrouver. Qui va réussir à imposer sa vision ?\r\n\r\nVous pouvez chercher la réponse dans le marc du café absorbé chaque jour par les développeurs, consulter l’Oracle, tenter de Googler la réponse... Ou venir à cette session et découvrir la démarche et les concepts pour toujours garder un coup d’avance sur le marché.\r\n\r\nNous ne parlerons pas seulement ici de la pertinence technique d’une technologie, mais de tous les facteurs qui influencent la place qu’elle peut prendre dans l’ecosysteme futur.","type":"Conference","theme":"Développeur au quotidien","roomId":12,"experience":"NOVICE","sponsored":true,"tags":["javaee"],"speakerIds":[1518,1534],"speakers":[{"speakerId":1518,"name":"Aurélien Pelletier"},{"speakerId":1534,"name":"Didier Girard"}]},{"sessionId":2802,"scheduleId":716734529,"title":"Posez vos conventions Java sur le divan de Freud.","summary":"Si vous répétez inlassablement aux membres de votre équipe les conventions du projet et les interdits.\r\nQue vous rappelez sans cesse que :\r\n - Il ne faut jamais utiliser equals pour comparer les BigDecimal\r\n - new Date() est prohibé, il faut utiliser l’injection pour assurer la testabilité de l’application.\r\n - il est interdit d’utiliser System.out.println, les loggers sont là pour ça.\r\n\r\net des millions d’autres conventions spécifiques à votre projet.\r\n\r\nAlors Freud est fait pour vous !\r\n\r\nFreud est un DSL léger, écrit en Java, pour coder des  règles d’analyses syntaxiques adaptées à votre projet. En complément de Findbugs ou Checkstyle, vous pourrez ainsi coder vos propres conventions.\r\nInutile de configurer un environnement compliqué, Freud s’exécute au seins de vos test automatisés JUnit.\r\n\r\nEn quelques exemples je vous ferai découvrir l’API et vous ferai disparaitre cette désagréable sensation de répéter en boucle les mêmes interdits.\r\n\r\nSite du projet : https://github.com/LMAX-Exchange/freud/","type":"Quickie","theme":"Java, one track to rule them all","roomId":14,"experience":"NOVICE","sponsored":false,"tags":["findbugs","TDD","Testing","Tools"],"speakerIds":[2539],"speakers":[{"speakerId":2539,"name":"Raphael Brugier"}]},{"sessionId":2821,"scheduleId":717748229,"title":"Creating Games with WebGL and Three.js","summary":"There was once a time where gaming in the browser meant Flash. That time is no more. Based on OpenGL ES, WebGL brings the 3D world to the browser without any plugins. Three.js, a scenegraph library for WebGL, allows us to make creating 3D web apps easier by abstracting away many of the low-level API calls. In this session, you’ll learn the basics of game programming, WebGL, and how to use Three.js to create WebGL applications.","type":"Conference","theme":"Jeux, Web et Mobile","roomId":13,"experience":"NOVICE","sponsored":false,"tags":["HTML5","webgl"],"speakerIds":[114],"speakers":[{"speakerId":114,"name":"James Williams"}]},{"sessionId":2811,"scheduleId":687279724,"title":"Programmation fonctionnelle, Haskell vous intéresse?","summary":"Disclaimer :\r\nRassurez-vous, nous ne parlerons pas de monades dans ce talk ;o)\r\n\r\nDans cette présentation du langage Haskell, notre but sera de rester accessible tout en montrant ce qui peut rendre ce langage attractif et son utilisation efficace.\r\n\r\nNous couvrirons les thèmes principaux de son paradigme. Nous vous montrerons : \r\n- comment modéliser sans objets mutables grâce aux types de données algébriques et au pattern matching ;\r\n- quel intérêt peut avoir de séparer, via le système de typage, le code déterministe (« pur ») et le code à effets de bord (« impur ») tant du point de vue du développeur que de celui du compilateur ;\r\n- comment augmenter la ré-utilisabilité de son code avec les fonctions d’ordre supérieur ;\r\n- ce qu’apporte le modèle d’évaluation à la demande (« lazy ») de Haskell.\r\n\r\nEt tout cela au travers de quelques exemples en livecoding grâce à l’interpréteur ghci.","type":"Quickie","theme":"Langages alternatifs","roomId":16,"experience":"NOVICE","sponsored":false,"tags":["Livecoding","FunctionalProgramming"],"speakerIds":[2167,2607],"speakers":[{"speakerId":2167,"name":"Mathieu Chataigner"},{"speakerId":2607,"name":"Yves Parès"}]},{"sessionId":3028,"scheduleId":811945029,"title":"Coprocesseur de calcul: Intel Xeon Phi","summary":"Après une brève introduction sur l\u0027architecture du nouveau Intel Xeon Phi (http://software.intel.com/en-us/mic-developer),\r\nle but de cette présentation est d\u0027expliquer comment optimiser les codes calculs pour tirer profit de la puissance de calcul disponible.\r\nTout d’abord les différents modes d\u0027utilisations du coprocesseur, puis les techniques de parallélisation et de vectorisation.\r\nEnfin, je présenterai des pistes pour comparer objectivement les performances du coprocesseur aux architectures traditionnelles.","type":"Conference","theme":"Infrastructure, hardware d’hier et de demain","roomId":15,"experience":"NOVICE","sponsored":false,"tags":["multicore","DevOps","cpu"],"speakerIds":[2524],"speakers":[{"speakerId":2524,"name":"victor arslan"}]},{"sessionId":2649,"scheduleId":1609775878,"title":"BOF de la communauté Software Craftsmanship Paris","summary":"Cette rencontre BOF sera l\u0027occasion de découvrir ce qui se cache derrière le Software Craftsmanship dans le cadre même de Devoxx. Dans un format de discussion libre, rejoignez-nous avec vos questions et opinions sur les techniques de code ou sur la notion de professionalisme dans notre métier !\r\n\r\nComme à notre habitude le choix des sujets de discussion sera laissé aux participants en début de session.","type":"BOF","theme":"Développeur au quotidien","roomId":18,"experience":"NOVICE","sponsored":false,"tags":["ATDD","TDD","SoftwareCraftsmanship","Testing","Design","mocking","refactoring"],"speakerIds":[1532],"speakers":[{"speakerId":1532,"name":"Cyrille Martraire"}]},{"sessionId":2293,"scheduleId":782366565,"title":"No(Geo)SQL","summary":"15 ans que la géo a pris ses quartiers dans le relationnel, mais toujours pas mainstream.\r\nNoSQL à la rescousse ?\r\n\r\nChallenges et opportunités pour des solutions agiles dans le monde du No(Geo)Sql\r\nSolutions pratiques mises en oeuvre pour la recherche de points d\u0027intérêt\r\n\r\nFocus Lucene/Hibernate Search : facettes + spatial ?","type":"Conference","theme":"Jeux, Web et Mobile","roomId":13,"experience":"SENIOR","sponsored":false,"tags":["NoSQL","Hibernate"],"speakerIds":[1481],"speakers":[{"speakerId":1481,"name":"Nicolas Helleringer"}]},{"sessionId":2366,"scheduleId":1609775878,"title":"BOF du Paris Android User Group","summary":"Rencontre informel avec la communauté Android, workshop pour la Droidcon Paris, ...\r\n\r\nPlus de contenu a venir !","type":"BOF","theme":"Jeux, Web et Mobile","roomId":15,"experience":"NOVICE","sponsored":false,"tags":["Podcast","android"],"speakerIds":[1452,1592],"speakers":[{"speakerId":1452,"name":"Eyal Lezmy"},{"speakerId":1592,"name":"Stéphane Guérin"}]},{"sessionId":2463,"scheduleId":964235240,"title":"Musclez vos applis Android avec les outils du monde Java","summary":"Tirons parti de la maturité de l\u0027écosystème Java\u000b pour améliorer la qualité de nos apps Android.\r\n\r\nDans cette session Tools in Action, nous ferons un tour d\u0027horizon des technologies qui peuvent nous aider à Amener Android aux standards industriels Java.\r\n\r\nNous proposons à la communauté Android de profiter des 17 ans d\u0027expérience de la communauté Java (Android vient de fêter ses 4 ans...) et d\u0027utiliser des outils reconnus de qualité industrielle tels que Jenkins, Maven, Sonar, findbugs, pmd, checkstyle et de les combiner à Lint, Robolectric, UIAutomator.","type":"Tools in Action","theme":"Jeux, Web et Mobile","roomId":17,"experience":"SENIOR","sponsored":false,"tags":["android","Maven","jenkins","Tools"],"speakerIds":[2453,2307],"speakers":[{"speakerId":2453,"name":"Stephane Nicolas"},{"speakerId":2307,"name":"Jerome Van Der Linden"}]},{"sessionId":2633,"scheduleId":687279724,"title":"Les lambda arrivent. En attendant, êtes-vous sûr d\u0027avoir compris les génériques?","summary":"Les lambda expressions en Java arrivent à grands pas. Les génériques sont eux apparus en 2004. Eh oui, 9 ans déjà. Et comme dit Joshua Bloch: \"Chaque langage a un quota de complexité. Les génériques ont fait exploser celui de Java.\" Êtes-vous bien sûrs d\u0027avoir tout compris? De bien savoir comment vous débarrasser de tous ces warnings qui sournoisement apparaissent dans votre code au moment où vous vous y attendez le moins? Et plus subtilement, savez-vous justifier l\u0027implémentation?\r\n\r\nCette session remet les compteurs à zéro, vous donne les clés qu\u0027il vous manquait pour maîtriser les génériques. Et vous permettra donc d\u0027attendre l\u0027arrivée des lambda sereinement.","type":"Quickie","theme":"Java, one track to rule them all","roomId":14,"experience":"NOVICE","sponsored":false,"tags":["javase"],"speakerIds":[932],"speakers":[{"speakerId":932,"name":"Henri Tremblay"}]},{"sessionId":2485,"scheduleId":782366565,"title":"Java EE 7 en détail","summary":"Depuis plusieurs années, un des buts de Java EE est de simplifier la vie du développeur mais Java EE 7 ne se cantonne pas qu\u0027à ça. HTML 5 est un des focus de Java EE 7. En effet, Java EE 7 dispose d\u0027une API WebSocket permettant de développer facilement des applications bidirectionnelle Full Duplex compatible avec des clients HTML5.  \r\nCitons aussi le support en standard d\u0027une API permettant d\u0027intégrer des mécanismes de caches, la possibilité de développer des traitements par lots (processus  Batch) ou encore l\u0027écriture de code concurrentiel. JAX-RS 2 apporte aussi son lot d\u0027améliorations pour le développement de services RESTful. Enfin, la doyenne des APIs de Java EE, à savoir JMS, a subi une cure de jeunesse bien méritée.\r\n\r\nCette session propose de donner, quelques semaines avant sa sortie, un large aperçus de Java EE 7 et de ses différentes technologies (WebSocket, JSON-P, JAXS-RS 2, JMS 2, ‘Concurrency for Java EE’, Cache et Batch API, etc.), le tout illustré par des démos.","type":"Conference","theme":"Java, one track to rule them all","roomId":12,"experience":"NOVICE","sponsored":true,"tags":["Glassfish","javaee7"],"speakerIds":[23,184],"speakers":[{"speakerId":23,"name":"Arun Gupta"},{"speakerId":184,"name":"David Delabassee"}]},{"sessionId":2645,"scheduleId":776884325,"title":"5 ans et 500 releases en 50 minutes !","summary":"Le développement logiciel est l\u0027activité coeur chez SonarSource, celle qui mobilise les passions et les énergies. Lors de cette session, nous vous présenterons 5 ans d\u0027évolution de nos pratiques de développement au travers plusieurs aspects: l\u0027organisation, les frameworks, l\u0027architecture, les hommes et l\u0027infrastructure... et ce sans utiliser de buzzwords !\r\n\r\nAu programme : du très concrêt !","type":"Conference","theme":"Développeur au quotidien","roomId":15,"experience":"SENIOR","sponsored":false,"tags":["DevOps","Testing","agile"],"speakerIds":[1032,1600],"speakers":[{"speakerId":1032,"name":"Olivier Gaudin"},{"speakerId":1600,"name":"Freddy Mallet"}]},{"sessionId":2431,"scheduleId":979011035,"title":"BOF du Google Developer Group Paris","summary":"Les GDGs (Google Developer Groups) sont des groupes de développeurs intéressés par les technologies Google. Plus de 340 GDG sont présents dans 96 pays et permettent aux membres de se rencontrer pour discuter, assister à des présentations techniques et des démos, participer à des hackathons... le tout dans une ambiance conviviale et participative.","type":"BOF","theme":"Jeux, Web et Mobile","roomId":15,"experience":"NOVICE","sponsored":false,"tags":["dart","google","android","GAE","GWT","HTML5"],"speakerIds":[1435,2670,2669],"speakers":[{"speakerId":1435,"name":"Alain Regnier"},{"speakerId":2670,"name":"Cyprien Decouty"},{"speakerId":2669,"name":"Louis Rouffineau"}]},{"sessionId":2767,"scheduleId":723287013,"title":"\"Faciliter le développement d’applications Web hors-ligne en JAVA avec GWT\"","summary":"A l\u0027heure où les API HTML5 deviennent incontournables, le navigateur reste la plateforme de choix pour développer des applications autrefois considérées comme natives : applications hors-ligne, stockage local de données, moteur SQL embarqué, etc. Malgré l\u0027apparition de nombreux frameworks JavaScript, le langage Java permet de maintenir, débuguer et travailler confortablement sur des programmes de plus de 100 000 lignes. Quels sont donc les outils qui permettent d’exploiter ces opportunités techniques tout en continuant à \"coder en paix avec Java\" ? Vous découvrirez les technologies que nous pourrons utiliser pour garantir aux utilisateurs une disponibilité totale de l\u0027application - même sans accès Internet – et tout ceci en gardant nos développeurs heureux et sereins puisqu’ils n\u0027ont qu\u0027un code à maintenir, et qui plus est en Java !","type":"Conference","theme":"Jeux, Web et Mobile","roomId":15,"experience":"SENIOR","sponsored":true,"tags":["sql","javaee","GWT","HTML5","mobile"],"speakerIds":[2487],"speakers":[{"speakerId":2487,"name":"Arnaud Tournier"}]},{"sessionId":2655,"scheduleId":993849416,"title":"No more (unsecure) secrets, Marty","summary":"Le récent épisode de la recherche sur GitHub qui a permis de trouver tout un tas de données sensibles (clefs privées, certificats, mots de passe) dans le code hébergé nous rappelle combien il est difficile de conciler sécurité et fonctionnement des applications.\r\n\r\nCette session vise à présenter OSS (Open Secret Server), un module de sécurité destiné à stocker pour le compte d\u0027applications tierces des données sensibles. La libération des secrets se fait par authentification par clef SSH.\r\n\r\nLe composant idéal de toute infrastructure pour mettre (enfin) un terme à la présence de données sensibles dans les sources...","type":"Tools in Action","theme":"Infrastructure, hardware d’hier et de demain","roomId":17,"experience":"SENIOR","sponsored":false,"tags":["authentication","DevOps","authorization","security"],"speakerIds":[2415],"speakers":[{"speakerId":2415,"name":"Mathias Herberts"}]},{"sessionId":2492,"scheduleId":0,"title":"Atelier Programatoo pour les enfants","summary":"Alors que l’informatique est de plus en plus présente dans notre vie, son apprentissage à l’école reste très superficiel : un peu d’internet, un peu de logiciel type traitement de texte ... mais pas de programmation. A l’heure où les enfants naissent avec ces technologies, on ne prend pas la peine de leur donner les clés pour devenir utilisateur de l’outil informatique, et pas seulement consommateur. \r\n\r\nComment leur faire découvrir notre métier ? Comment éveiller leur curiosité à la programmation et à son potentiel illimité ? De nombreux outils existent déjà, adaptés à chaque âge, et lors de cette session entièrement pratique, nous vous proposons de les prendre en main ensemble.\r\n\r\nUn atelier Programatoo pour les petits qui durera toute une journée. Programmation, mind-storm, chasse aux énigmes geek, film... bref, tout ce que vos enfants ont voulu savoir sur la programmation... sans avoir osé vous le demander","type":"Hands-on Labs","theme":"Développeur au quotidien","roomId":0,"experience":"NOVICE","sponsored":false,"tags":["children"],"speakerIds":[1654,1652],"speakers":[{"speakerId":1654,"name":"Audrey Neveu"},{"speakerId":1652,"name":"Aline Paponaud"}]},{"sessionId":3090,"scheduleId":747305861,"title":"Entre HPC et big data: un case study sur la simulation du risque de contrepartie","summary":"En finance de marché, la mesure du risque de contrepartie introduit des problématiques techniques au confluent du calcul intensif et des données massives. Modéliser les sources de variabilité des actifs financiers apporte un élément calculatoire complexe et gourmand en CPU ou GPU. Ce calcul produit des données de grande taille qui doivent être agrégées de façon transactionnelle et rapide. Comment implémenter un map/reduce très spécialisé capable de supporter un flux incrémental et concurrent de modifications et de what-ifs?","type":"Conference","theme":"Jeux, Web et Mobile","roomId":14,"experience":"SENIOR","sponsored":true,"tags":["big data"],"speakerIds":[2668,2667],"speakers":[{"speakerId":2668,"name":"Jonathan Lellouche"},{"speakerId":2667,"name":"Adrien Tay Pamart"}]},{"sessionId":2353,"scheduleId":129461629,"title":"Mise en Production Continue avec Puppet","summary":"\"Infrastructure as code\", venez voir ce que ça veut vraiment dire !\r\nVous mettrez en production une application simple en java avec Puppet.\r\n\r\nLe principe est de comprendre par la pratique qu\u0027on peut voir plus loin que l\u0027intégration continue pour aller vers la mise en production continue. De même que l\u0027intégration continue nous a poussé à tester automatiquement notre code, qu\u0027est-ce-qui change dans nos pratiques bien établies de développement avec le déploiement continu ? Quelles stratégies adopter pour avoir un taux de disponibilité de la prod maximal ET des livraisons fréquentes ? Êtes vous prêt à sortir de votre isolation confortable de développeur pour vous responsabiliser face à la prod ?","type":"Hands-on Labs","theme":"Infrastructure, hardware d’hier et de demain","roomId":30,"experience":"SENIOR","sponsored":false,"tags":["javase","DevOps","cloud"],"speakerIds":[1743,1704],"speakers":[{"speakerId":1743,"name":"Eric Le Merdy"},{"speakerId":1704,"name":"Pierre Chaussalet"}]},{"sessionId":2543,"scheduleId":781378657,"title":"Les bronzés font du dev","summary":"Martin 23 ans et fraîchement diplômé vient d\u0027être embauché chez SSII Consulting. Son commercial lui a proposé une superbe mission où il pourra développer ses compétences en Java/J2EE ! Chouette car c\u0027est exactement ce qu\u0027il cherchait : \"Spring, Hibernate et Struts les technos du moment !\" lui dit son commercial. \"Mais avec un petit peu de maintenance sur l\u0027ancienne appli en PHP mais c\u0027est vraiment minime !\" rassure-t-il.\r\n\r\nEt c\u0027est tout enthousiaste qu\u0027il commence sa première journée de mission, dans une équipe ... un peu particulière ...\r\n\r\n\r\nAu travers de cette histoire, je souhaite illustrer (en dessin) le quotidien d\u0027une équipe caricaturée mais pas si éloignée que ça de la réalité de nos projets ...\r\n\r\n\r\nRemarque : les dessins seront de meilleurs qualités pour le quickie par rapport à ce que l\u0027on trouve sur mon blog (http://uneviededev.wordpress.com/)","type":"Quickie","theme":"Développeur au quotidien","roomId":16,"experience":"NOVICE","sponsored":false,"tags":["social"],"speakerIds":[480],"speakers":[{"speakerId":480,"name":"Ellène Dijoux"}]},{"sessionId":2414,"scheduleId":716734529,"title":"Coder un outil en Java... en 15 minutes !","summary":"La conception d\u0027un programme Java, spécialement une application Web/JEE, étant souvent un travail laborieux, on n\u0027a rarement recours à Java pour réaliser \"un petit outil\" rapide. C\u0027est bien dommage, car, en fait, avec les nombreux outils et librairie OpenSource à notre disposition, et un peu de maîtrise, il n\u0027est non seulement pas si difficile de concevoir, très rapidement, un tel outil, mais surtout la JDK et on dispose souvent des bibliothèques nécessaires facilement !\r\n\r\nDémonstration par l\u0027exemple, avec la réalisation d\u0027une petit appli en 15 minutes !","type":"Quickie","theme":"Java, one track to rule them all","roomId":13,"experience":"SENIOR","sponsored":false,"tags":["annotations"],"speakerIds":[1372],"speakers":[{"speakerId":1372,"name":"Romain PELISSE"}]},{"sessionId":2630,"scheduleId":848884488,"title":"Le fantome, le zombie et testacular, panorama des outils de tests pour application web moderne.","summary":"Nous vous proposons dans cette université de 3h, de balayer les principaux outils de test javascript afin que vous puissiez connaitre les forces de chacun de ces outils.\r\n\r\nCe talk essentiellement basé sur du live coding, (dont nous vous offrons le code à la fin de la session), nous permettra de voir en détail\r\nCasperJS, Zombie.js et Testacular associé à Jasmine, Mocha et QUnit\r\nNous vous ferons une démontration avancée de chacun et nous les comparerons afin de vous permettre en fonction de vos gouts et des contraintes techniques de votre projet de faire le bon choix pour votre prochain projet web moderne.\r\n\r\nLes exemples et situations sont tirés de plus d\u00271 an de plusieurs projets sur lesquels nous avons réellement utilisé ces outils.","type":"University","theme":"Jeux, Web et Mobile","roomId":14,"experience":"SENIOR","sponsored":false,"tags":["javascript","Testing"],"speakerIds":[450,2386],"speakers":[{"speakerId":450,"name":"Jean-Laurent de Morlhon"},{"speakerId":2386,"name":"Pierre Gayvallet"}]},{"sessionId":2446,"scheduleId":965276003,"title":"Trucs et astuces avec Java et MongoDB sur Raspberry PI","summary":"Le Raspberry PI est la sensation du moment, petit, pas cher, fun. On peut faire pas mal de choses avec ce petit objet. Beaucoup s’en serve comme serveur XBMC mais en tant que développeur Java, que puis-je en faire ?\r\nDurant ces 30 minutes nous verrons comment installer et jouer avec Java et MongoDB. Le tout sera saupoudré par quelques tips \u0026 tricks.","type":"Tools in Action","theme":"Infrastructure, hardware d’hier et de demain","roomId":27,"experience":"NOVICE","sponsored":false,"tags":["MongoDB","RaspberryPI"],"speakerIds":[1125],"speakers":[{"speakerId":1125,"name":"Guillaume Scheibel"}]},{"sessionId":3084,"scheduleId":910320638,"title":"L’histoire des écritures","summary":"L’histoire des écritures commence dans la région du monde qui nous intéresse, Moyen-Orient, Méditerranée, Europe, Nouveau Monde, Monde !, à la fin du IV e millénaire avant notre ère : tout début avec des petits objets matérialisant des nombres. Ce qui décida de la suite, car dans ce grand fleuve de signes, ce sont les nombres qui mènent la danse des écritures. La suite appartient à l’invention de la monnaie frappée, vecteur d’écriture\r\narithmo-géométrique, puis à l’informatique. Cette histoire longue de 53 siècles laisse apparaître pourtant une étrange cohérence dans certains procédés imaginaires qui impliquent la représentation du corps humain…","type":"Conference","theme":"Développeur au quotidien","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["Podcast"],"speakerIds":[2664],"speakers":[{"speakerId":2664,"name":"Clarisse Herrenschmidt"}]},{"sessionId":2557,"scheduleId":965276003,"title":"Developing Modern Web Apps With Backbone.js","summary":"In just 2 years, Backbone.js has emerged as the favourite framework for developing client-side apps in JavaScript \u0026 HTML5. Its users include AirBNB, LinkedIn, Foursquare, ...\r\n\r\nThis will be a hands-on session showing the creation of a Backbone.js app from empty directory to working demo, explaining which \"best practices\" tools are used along the way: yeoman, LiveReload, require.js, ...\r\n\r\nIn the process I will explain the architecture of a Backbone.js app and share some war stories from my experience building large projects with Backbone.","type":"Tools in Action","theme":"Langages alternatifs","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["javascript","HTML5"],"speakerIds":[2502],"speakers":[{"speakerId":2502,"name":"Sylvain Zimmer"}]},{"sessionId":2280,"scheduleId":658678597,"title":"99 recettes de Ceylon","summary":"Ceylon a pour buts d´être un langage de programmation puissant, lisible et\r\nprévisible, mais également une plate-forme complète avec modularité et \r\noutillage moderne. Mais c´est loin de suffir pour décrire le langage.\r\n\r\nVenez nous rejoindre pour explorer les facilités qu´offre Ceylon par rapport\r\nà Java. Propriétés, modules, protection contre null, exceptions de typage,\r\ntravail avec les collections, varargs ou types genériques : nous vous montrerons\r\nles multiples aspects que les développeurs Java aimeront en Ceylon.","type":"Conference","theme":"Langages alternatifs","roomId":15,"experience":"NOVICE","sponsored":false,"tags":["Ceylon"],"speakerIds":[762,117],"speakers":[{"speakerId":762,"name":"Stephane Epardaud"},{"speakerId":117,"name":"Emmanuel Bernard"}]},{"sessionId":2331,"scheduleId":781378657,"title":"Le templating en JavaScript","summary":"Vous avez encore des concaténations de chaines partout dans votre code Javascript dès que vous insérez un élément dans le DOM et en avez assez ?\r\n\r\nDécouvrez rapidement comment mieux gérer tout ça et faciliter la maintenance du code avec une présentation rapide du concept de templating en JavaScript et de frameworks vous permettant de le mettre en place dans vos sites webs.","type":"Quickie","theme":"Jeux, Web et Mobile","roomId":14,"experience":"NOVICE","sponsored":false,"tags":["javascript","web"],"speakerIds":[2394],"speakers":[{"speakerId":2394,"name":"Mathieu PARISOT"}]},{"sessionId":2863,"scheduleId":751923852,"title":"Comment inspecter le code généré par le compilateur JIT de la JVM ?","summary":"S\u0027il est facile d\u0027inspecter le byte code généré par le compailteur javac, il est en revanche plus difficile de voir le code généré par le compilateur JIT de la JVM puisque c\u0027est effectué à la volée.\r\nIl est cependant possible de brancher un désassembleur sur la JVM pour afficher le code assembleur.\r\nNous allons présenter dans ce quickie comment faire et appliquer cette technique pour observer quelles sont les optimisations effectuées par la JVM (virtual calls, volatile, vérrous, gestion d\u0027exceptions).","type":"Quickie","theme":"Java, one track to rule them all","roomId":14,"experience":"SENIOR","sponsored":false,"tags":["javase","performance","JVM"],"speakerIds":[2308],"speakers":[{"speakerId":2308,"name":"Jean-Philippe BEMPEL"}]},{"sessionId":2947,"scheduleId":965276003,"title":"NFC, l\u0027interaction facilitée des mobiles avec leur environnement","summary":"Nous voyons de plus en plus de smartphones/téléphones mobile équipés de la technologie NFC, sans que son usage ne soit encore largement diffusé.\r\nCette technologie promet un usage simplifié pour l\u0027interaction entre les téléphones mobiles et leur environnement.\r\n\r\nCette session commencera par une description de la norme et des racines de cette technologie : RFID et cartes à puces, et l\u0027implementation de cette norme, APIs et applications sur les différents OS mobiles, avec une attention plus particulière pour Android, moteur actuel de la diffusion de cette technologie.\r\nEn deuxième partie nous développerons une application Android pour interagir avec des objets.","type":"Tools in Action","theme":"Jeux, Web et Mobile","roomId":17,"experience":"SENIOR","sponsored":false,"tags":["android","NFC","mobile"],"speakerIds":[1602],"speakers":[{"speakerId":1602,"name":"Romain Menetrier"}]},{"sessionId":2377,"scheduleId":782366565,"title":"Le Space-Mountain du développement Java d\u0027entreprise","summary":"A travers une démo je présente en direct-live de mon Eclipse une application d\u0027entreprise avec au menu les technologies suivantes:\r\n\r\nMaven 3\r\nSpring 3.2\r\nJPA 2.2\r\nBean Validation 1.0\r\nJSF 2.1\r\nPrimefaces 3.4\r\nJunit 4\r\nMockito\r\nSelenium 2\r\nJprofiler\r\n\r\nTout cela en moins d\u0027une heure avec un speaker aussi rapide que Speedy Gonzales, et probablement une occasion de découvrir au moins 2 ou 3 choses que vous pourrez mettre en oeuvre dès votre retour dans vos projets chez VOS clients !\r\n\r\nBonus : si vous ne retenez pas au moins une chose de ce talk, je vous offre un Mojito !","type":"Conference","theme":"Développeur au quotidien","roomId":15,"experience":"NOVICE","sponsored":false,"tags":["patterns","JSF2","performance","spring","JPA"],"speakerIds":[1578],"speakers":[{"speakerId":1578,"name":"Florent Ramière"}]},{"sessionId":2594,"scheduleId":811945029,"title":"JCP \u0026 Adopt-a-JSR Workshop","summary":"Learn how to join the Java Community Process (JCP) program as an individual, corporation or institutions, ie Java User Groups (JUG).  Step by step instructions on how to participate in the Adopt-a-JSR program, the Transparency project, and tools to run JUG events as part of Adopt-a-JSR program, such as hack days and collaboration with other JUG leads on Adopt-a-JSR activities.","type":"Conference","theme":"Java, one track to rule them all","roomId":13,"experience":"NOVICE","sponsored":false,"tags":["javame","javase","javaee","jcp"],"speakerIds":[2111,2111,23],"speakers":[{"speakerId":2111,"name":"Patrick Curran"},{"speakerId":2111,"name":"Patrick Curran"},{"speakerId":23,"name":"Arun Gupta"}]},{"sessionId":2865,"scheduleId":899593034,"title":"The Wearable Application Server and Other Adventures in Software Engineering","summary":"Mobile technology has so far mostly been confined to the client side, for fairly obvious reasons - traditionally, clients are mobile, and servers are not. However, not only is hardware getting smaller, servers are too. When your application server can run on pocket-sized £25 hardware it opens up some pretty cool possibilities - your server is literally lightweight. Not only can you have location-based services, you can have locatable servers. Servers can run on phones, they can run on the Raspberry Pi, and so they can go almost anywhere you can think of. Modularity gives software the flexibility it needs to cram into these tight spaces without sacrificing power. This talk will demonstrate developing and deploying a web application to an application server embedded in a silly hat.","type":"Conference","theme":"Jeux, Web et Mobile","roomId":13,"experience":"NOVICE","sponsored":true,"tags":["javaee"],"speakerIds":[2044],"speakers":[{"speakerId":2044,"name":"Holly Cummins"}]},{"sessionId":2854,"scheduleId":129461629,"title":"Lab : Introduction et mise en pratique de Java EE 7","summary":"Outre le support HTML 5, un des buts de Java EE 7 est d\u0027améliorer la productivité du développeur.\r\nParmi les nouveautés de Java EE 7, nous pouvons notamment citer :\r\n- JAX-RS 2 qui introduit une API permettant à un client d\u0027invoquer des services REST.\r\n- JMS 2 qui subit un remaniement en profondeur afin de notamment tirer parti des nouvelles fonctionnalités de Java SE.\r\n- JavaServer Faces qui supporte maintenant les formulaires HTML5. \r\n- La notation JSON qui fait maintenant partie intégrante de la plateforme.\r\n- Les WebSockets qui permettent des liaisons full-duplex.\r\n- Une API Batch qui permet d\u0027écrire des traitements par lot.\r\n- etc.\r\n\r\nEnsemble ces APIs devraient simplifier vos futurs développements Java EE... et ansi vous rendre plus productif!\r\n\r\nCe laboratoire vous propose une introduction à Java EE 7 et ses nouveautés. En y participant, vous apprendrez Java EE 7 et différentes cas d\u0027utilisation. Enfin, vous serez amené à construire une application complète qui utilisera GlassFish 4.","type":"Hands-on Labs","theme":"Java, one track to rule them all","roomId":17,"experience":"SENIOR","sponsored":false,"tags":["JAX-RS","Glassfish","javaee","JMS","HTML5"],"speakerIds":[184,23,2662],"speakers":[{"speakerId":184,"name":"David Delabassee"},{"speakerId":23,"name":"Arun Gupta"},{"speakerId":2662,"name":"Laurent Ruaud"}]},{"sessionId":2268,"scheduleId":811945029,"title":"Architecting for Continuous Delivery","summary":"Votre système d\u0027intégration continue fonctionne parfaitement et s\u0027exécute après chaque commit. Votre code est compilé. Vos tests sont verts. Vous êtes prêts pour la prochaine étape et l\u0027évolution vers le déploiement continu (Continuous Delivery).\r\n\r\nCette transition peut être dure et apporte de nouveaux défis. Ensemble nous nous pencherons sur 5 piliers de l\u0027architecture qui en feront un succès: la détection d\u0027environnements, l\u0027auto-configuration, les migrations DB, les Feature Toggles et la gestion d\u0027état. À la fin de cette présentation vous aurez une vue solide sur ce dont on a besoin pour créer des applications capables d\u0027être déployées en production plusieurs fois par jours, sans arrêt du système.","type":"Conference","theme":"Java, one track to rule them all","roomId":12,"experience":"SENIOR","sponsored":false,"tags":["javase","javaee","DevOps","Design"],"speakerIds":[108],"speakers":[{"speakerId":108,"name":"Axel Fontaine"}]},{"sessionId":3023,"scheduleId":979011035,"title":"L\u0027open-source au quotidien","summary":"Utilisateurs, contributeurs ou développeurs de projets open-sources, venez échanger avec les membres de l\u0027OSSGTP (http://www.ossgtp.org/) qui représentent un large panel d\u0027acteurs de ce milieu.","type":"BOF","theme":"Développeur au quotidien","roomId":27,"experience":"NOVICE","sponsored":false,"tags":["FOSS"],"speakerIds":[1672,762,748,647],"speakers":[{"speakerId":1672,"name":"Emmanuel Lecharny"},{"speakerId":762,"name":"Stephane Epardaud"},{"speakerId":748,"name":"Emmanuel Hugonnet"},{"speakerId":647,"name":"Arnaud Heritier"}]},{"sessionId":2242,"scheduleId":723287013,"title":"Elastifiez votre application : du SQL au NoSQL en moins d\u0027une heure","summary":"Au cours de cette session \"live coding\", Tugdual et David reprendront une application full SQL \"à papa\" pour la réécrire en NoSQL en 45 minutes.\r\nEn s\u0027appuyant sur CouchBase et Elasticsearch, ils mettront en avant les bénéfices de cette nouvelle architecture : \r\n- la facilité de mise en place (productivité)\r\n- l\u0027élasticité (scalabilité)\r\n\r\nLes thèmes abordés seront :\r\n- Approche document\r\n- JSon\r\n- REST\r\n- Cache / Memcache\r\n- Filtres et Facettes\r\n\r\nNotre plan diabolique est de vous convertir au NoSQL à tel point que vous ne puissiez faire autrement que de le mettre chez vous (et chez vos amis) ! Niark ! Niark ! Niark ! (rire satanique)","type":"Conference","theme":"Java, one track to rule them all","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["NoSQL","cloud","big data"],"speakerIds":[1409,1505],"speakers":[{"speakerId":1409,"name":"David Pilato"},{"speakerId":1505,"name":"Tugdual Grall"}]},{"sessionId":3075,"scheduleId":870037634,"title":"Mappy et le Cloud","summary":"Après avoir lancé de nombreux projets innovants autour des vues immersives basés sur le Cloud, Mappy a fait le choix  de revenir vers son hébergement historique une fois les projets portés à maturité pour des raisons économiques.","type":"AM des décideurs","theme":"Startup, architecture et entreprenariat","roomId":27,"experience":"SENIOR","sponsored":false,"tags":["cloud"],"speakerIds":[2658],"speakers":[{"speakerId":2658,"name":"Cyril Morcrette"}]},{"sessionId":3093,"scheduleId":0,"title":"Invokedynamic in 45 Minutes","summary":"You\u0027ve heard about it. Maybe you\u0027re even using a language like JRuby that uses it. But what exactly is invokedynamic and how can it help you as a Java developer? In this talk, we\u0027ll cover the basics of what invokedynamic is and how you can use it. We\u0027ll do step through some simple examples to show the mechanics of the invokedynamic bytecode, the bootstrap method, call sites, and method handles. And finally \r\nwe\u0027ll build a toy language to show how it all fits together","type":"Conference","theme":"Java, one track to rule them all","roomId":0,"experience":"SENIOR","sponsored":false,"tags":["javase"],"speakerIds":[2653],"speakers":[]},{"sessionId":3006,"scheduleId":751923852,"title":"Gavagai, un pont entre Java et Clojure","summary":"La force du langage Clojure réside entre autres dans ses nombreuses\r\nstructures de données immutables et l\u0027interface cohérente et unifiée\r\nqui permet de les manipuler. Sa présence dans la JVM lui permet de\r\nprofiter du gigantesque écosystème de Java, mais il est souvent\r\ndifficile d\u0027intéragir de manière idiomatique avec lui, du fait de la\r\nprésence universelle d\u0027arbre d\u0027objets mutables de classes diverses. Cette\r\nprésentation introduit gavagai, une librairie permettant de traduire\r\nautomatiquement et de manière efficace ces arbres en structures\r\nimmutables Clojure. La motivation derrière cette librairie, son\r\nprincipe de fonctionnement et des exemples d\u0027usage seront abordés.\r\nlink: https://github.com/ngrunwald/gavagai","type":"Quickie","theme":"Langages alternatifs","roomId":15,"experience":"NOVICE","sponsored":false,"tags":["Clojure"],"speakerIds":[2617],"speakers":[{"speakerId":2617,"name":"Nils Grunwald"}]},{"sessionId":3087,"scheduleId":658677636,"title":"Quick Start avec le Cloud Google","summary":"Savoir coder sur le Cloud de Google, c’est préparer son avenir technologique : oseriez-vous postuler pour un projet IT innovant sans connaître le Cloud de Google? Cette session couvrira, démonstrations à l’appui :\r\nle bigdata simplifié\r\nl’utilisation d’un SGBDR “as a service”\r\nl’intégration de services depuis des clients mobiles natifs (Android, iPhone)\r\nl’utilisation d’OAuth2 à grande échelle\r\nla recherche full-text dans vos applications web\r\nle calcul intensif à base de machines virtuelles provisionnées à la volée\r\nle datamining temps réel sur de gros volumes de données\r\n…\r\nLe tout mettra en évidence l’étendue des solutions disponibles, leur scalabilité, leur combinatoire, leur facturation à l’usage et le peu de maintenance qu’elles nécessitent. De nouvelles fonctionnalités arrivent chaque mois, il y forcément des choses à découvrir!","type":"Conference","theme":"Jeux, Web et Mobile","roomId":27,"experience":"SENIOR","sponsored":false,"tags":["cloud"],"speakerIds":[183,1534],"speakers":[{"speakerId":183,"name":"Alexis Moussine-Pouchkine"},{"speakerId":1534,"name":"Didier Girard"}]},{"sessionId":2564,"scheduleId":716734529,"title":"Une appli mobile pour plusieurs tailles d’écran. Que faire ?","summary":"La rude concurrence entre les constructeurs mobiles les a poussé à diversifier la taille des écrans et à augmenter leur densité de pixels. L\u0027appellation « Retina » a même vu le jour pour désigner ces écrans à très forte densité.\r\nCette course effrénée n\u0027est pas sans conséquences sur le développement des applications mobiles : Images trop petites ou floutées en sont les principales problématiques.\r\nDans 15 minutes vous allez mieux comprendre ces complications ainsi que les remèdes prescrits par Apple et Android.","type":"Quickie","theme":"Jeux, Web et Mobile","roomId":16,"experience":"NOVICE","sponsored":false,"tags":["android","iOS","mobile"],"speakerIds":[1423],"speakers":[{"speakerId":1423,"name":"Atef Haouari"}]},{"sessionId":2687,"scheduleId":929150666,"title":"Play Framework vs. Grails Smackdown","summary":"Matt and James have developed two apps that do the same thing.  One was built with Grails and the other with Play Framework.  This session walks through the differences between the two frameworks in the context of the real-world \"UberTracks\" application.  You will learn about the frameworks and their differences, including Performance, Lines of Code, Scalability, and Ecosystems.","type":"Conference","theme":"Jeux, Web et Mobile","roomId":13,"experience":"NOVICE","sponsored":false,"tags":["grails","PlayFramework"],"speakerIds":[993,20],"speakers":[{"speakerId":993,"name":"James Ward"},{"speakerId":20,"name":"Matt Raible"}]},{"sessionId":2321,"scheduleId":781378657,"title":"Découvrir WebMotion","summary":"WebMotion est un framework Java pour créer des applications web, basé sur une approche orienté outils. C\u0027est à dire qu\u0027il s\u0027occupe principalement des interactions entre le client et le serveur d\u0027application. L\u0027une des forces de WebMotion est de ne pas imposer de technologie autre, libre à chacun d\u0027utiliser les technologies adaptées à vos besoins. WebMotion est basé sur le standard JEE avec les Servlet 3.\r\n\r\nLa présentation est axée sur les analogies entre WebMotion et les différents frameworks dont il s\u0027inspire.\r\n\r\nDans les points positifs nous retrouvons :\r\n - le fichier de route centralisé\r\n - la gestion des paramètres et des appels de méthode\r\n - la gestion de plugins\r\n\r\nEn contre partie nous trouvons de mauvais points :\r\n - les architectures contraignantes\r\n - l\u0027excès d\u0027annotations\r\n - les fichiers de configuration trop verbeux\r\n\r\nVous pouvez retrouver sur le site web http://webmotion-framework.org, une documentation et un ensemble d\u0027exemple permettant à chacun de découvrir les fonctionnalités.","type":"Quickie","theme":"Java, one track to rule them all","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["Servlet3","javaee","web"],"speakerIds":[2317],"speakers":[{"speakerId":2317,"name":"Julien Ruchaud"}]},{"sessionId":2734,"scheduleId":716734529,"title":"QueryDSL: du typage fort au quotidien","summary":"D\u0027abord dédiée au typage fort des requêtes JPA, QueryDSL est une librairie utilitaire qui a su s\u0027élargir sans s\u0027égarer. \r\n\r\nCette courte présentation se consacre à présenter les ambitions communes et les implémentations particulières de QueryDSL au travers d\u0027exemples incluant la construction programmatique de requêtes SQL et JPQL, le requêtage de collections Java mais aussi la création de requêtes propres à MongoDB.","type":"Quickie","theme":"Java, one track to rule them all","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["NoSQL","sql","MongoDB","collections","JPA"],"speakerIds":[1614],"speakers":[{"speakerId":1614,"name":"Florent Biville"}]},{"sessionId":2716,"scheduleId":751923852,"title":"CSS: more or Less ?","summary":"Il n’existe à ce jour plus une seule application Web qui n’utilise pas  « CSS », ces fichiers qui permettent de styliser son application. Aujourd’hui, « CSS3 » nous permet d’écrire des applications du plus en plus attrayantes mais n’est pas encore idéal puisque nous constatons des manques comme par exemple la définition de constantes de couleurs, chose appréciable pour les sites en marque blanche. Notons également la difficulté pour factoriser et maintenir ce code.\r\n\r\nUne lueur d’espoir est apparue, grâce à « Less ». C’est un framework qui non seulement nous facilite l’écriture de nos fichiers CSS, mais nous aide également à les maintenir et à mieux les structurer, tout en ayant des outils que nous pouvons utiliser dans nos usines logiciels.\r\n\r\nJe suis un développeur Web, et je n’ai pas peur de dire que désormais, j’aime le CSS !","type":"Quickie","theme":"Jeux, Web et Mobile","roomId":16,"experience":"NOVICE","sponsored":false,"tags":["web"],"speakerIds":[1693],"speakers":[{"speakerId":1693,"name":"Julien Roche"}]},{"sessionId":2380,"scheduleId":782366565,"title":"Comparing JVM Web Frameworks","summary":"One question developers often ask is \"What web framework should I use to build my application?\" High-traffic sites (e.g. eBay, LinkedIn, Twitter, Overstock) have proven that the JVM is a great platform for web scaling. This session takes a look at the top web frameworks for the JVM and discusses various methodologies for choosing one. It describes different techniques (a ratings matrix, performance testing, surveys) for comparing and uses these to choose the top 5.","type":"Conference","theme":"Java, one track to rule them all","roomId":14,"experience":"SENIOR","sponsored":false,"tags":["grails","JSF2","javaee","GWT","web","HTML5","JVM","Tapestry","PlayFramework","SpringMVC"],"speakerIds":[20],"speakers":[{"speakerId":20,"name":"Matt Raible"}]},{"sessionId":2921,"scheduleId":629120965,"title":"Continuous (Cloud) Cost Testing","summary":"Jusque là, les équipes de Dev se focalisaient sur la perf, la fiabilité ou la robustesse des applications. Et c\u0027était déjà pas mal ... Maintenant que beaucoup de choses tournent sur le Cloud, il y a un autre paramètre : le coût !\r\n\r\nCette session présentera les astuces utilisées par les startups pour économiser sur le fonctionnement de leurs applications sur les Clouds AWS et AppEngine :\r\n\r\n  - AWS - DevOps et scripting à volonté ! Obligatoire pour optimiser ses coûts\r\n  - AWS - Instances Spot pour les Batch et même pour les sites Web\r\n  - AWS - Robustesse : déployer sur AWS en Multi-AZ ou en Multi-Région, c\u0027est pas le même coût !\r\n  - AWS - Amazon S3 pour votre site Web\r\n  - AppEngine - Optimisation de votre code : cas pratique du changement de tarif en 2011\r\n  - AppEngine - Impact du Datastore HDR\r\n  - AppEngine - Faible traffic, faible latence et faible coût ? Peut-on avoir les 3 à la fois ? Pas si simple !\r\n\r\nLa session de terminera sur la notion de Continuous Cost Testing","type":"Conference","theme":"Startup, architecture et entreprenariat","roomId":15,"experience":"SENIOR","sponsored":false,"tags":["google","DevOps","cloud","Amazon"],"speakerIds":[1586],"speakers":[{"speakerId":1586,"name":"Nicolas Fonrose"}]},{"sessionId":2998,"scheduleId":834948906,"title":"Git : quand une application complexe saute le pas","summary":"2013. Difficile de présenter Git comme une solution d\u0027avant-garde : répandus et appréciés, les DVCS ont déjà changé notre manière de développer, qu\u0027il s\u0027agisse de nos propres projets voire ceux de nos clients. Pourtant, il peut rester des réticences dans les entreprises : de fait, tout oppose un projet communautaire sur GitHub et une application critique de l\u0027industrie, bancaire par exemple.\r\n\r\nVoici un retour d\u0027expérience sur une migration vers Git et Maven dans le secteur de la banque d\u0027investissement.\r\nL\u0027application concernée : 2 millions de lignes de code Java et C++, 80 développeurs et 10 projets parallèles, 10 ans d\u0027historique et la stabilité exigée d\u0027une application règlementaire.\r\n\r\nCette présentation revient sur les raisons et objectifs du projet, les défis spécifiques, les stratégies mises en œuvre, les obstacles, les compromis, les résultats.","type":"Conference","theme":"Développeur au quotidien","roomId":16,"experience":"SENIOR","sponsored":true,"tags":["Maven","Git"],"speakerIds":[2623],"speakers":[{"speakerId":2623,"name":"Francois Nollen"}]},{"sessionId":2723,"scheduleId":993849416,"title":"Space Chatons: Bleeding Edge HTML5","summary":"Une présentation HTML5 bleeding edge en 4 courtes séquences :\r\n\r\nWebSockets, FileReader \u0026 Web Workers : Jeu multiplayer avec reconnaissance faciale de Chatons pour lequel on a recodé facebook graph search (en mieux). Dix joueurs, triés sur le volet, seront sélectionnés pour l\u0027expérience (connexion filaire) ;\r\n \r\nCSS3D \u0026 getUserMedia : Affichage des résultats sur une sphère pour lequel on a recodé Minority Report (en mieux) ;\r\n \r\nReconnaissance et Synthèse Vocale : Calcul avancé du highscore et introduction du vainqueur pour lequel on a recodé HAL (sachant que cette partie est un fork d\u0027une demo Google, mais recodée en mieux) ;\r\n \r\nCanvas, SVG, génération audio : Affichage du grand vainqueur avec un final sous la forme d\u0027une performance scénique.\r\nCette humble présentation a déjà été testée au XKE du 9 janvier:\r\nhttps://twitter.com/morlhon/status/288955815543586816","type":"Tools in Action","theme":"Jeux, Web et Mobile","roomId":19,"experience":"NOVICE","sponsored":false,"tags":["javascript","websockets","web","HTML5"],"speakerIds":[1682,2386],"speakers":[{"speakerId":1682,"name":"Philippe Antoine"},{"speakerId":2386,"name":"Pierre Gayvallet"}]},{"sessionId":2143,"scheduleId":993849416,"title":"Good Bad and Ugly Maven - a puzzler session","summary":"Maven, de renommée mondiale, est bourré de bugs, de non-sens et d\u0027anti-patterns ... et malgré tout un standard de fait ! Au cours de cette session, nous vous proposons de tester vos connaissance autour de quelques puzzlers, avec explication à la clé et surtout nos conseils pour éviter ces travers sur vos projets.","type":"Tools in Action","theme":"Développeur au quotidien","roomId":29,"experience":"SENIOR","sponsored":false,"tags":["Maven","puzzlers"],"speakerIds":[998,647],"speakers":[{"speakerId":998,"name":"nicolas loof"},{"speakerId":647,"name":"Arnaud Heritier"}]},{"sessionId":2411,"scheduleId":1639328550,"title":"BOF Not Only SSII","summary":"NoSSII vous connaissez ? Au-delà du buzzword ?\r\nDe la même façon que NoSQL signifie \"Not only SQL”, NoSSII signifie \"Not only SSII\". Loin d\u0027être antagoniste, NoSSII regroupe d’autres façons de travailler dans l\u0027informatique que nous vous proposons de découvrir.\r\nComme NoSQL, le mouvement NoSSII est un terme récent mais désigne des pratiques plus anciennes.\r\nComme NoSQL, NoSSII n’est pas un mouvement “contre” les SSII, mais un mouvement qui promeut des façons alternatives de travailler dans l’informatique.\r\n\r\nCe BOF sera animé par une partie des membres de 3 “NoSSII” :\r\n- Scopyleft (Stéphane Langlois et David Larlet) : http://scopyleft.fr/\r\n- Ninja Squad (Agnès Crépet, Cyril Lacôte) : http://ninja-squad.com/\r\n- Lateral Thoughts (Jean-Baptiste Lemée, Florent Biville, Hugo Lassiège, Nicolas Rey) : http://www.lateral-thoughts.com/\r\n\r\nCes différentes approches permettront d’enrichir le débat et de montrer qu’en matière de structure d’entreprise : “rien n’est impossible”","type":"BOF","theme":"Startup, architecture et entreprenariat","roomId":27,"experience":"NOVICE","sponsored":false,"tags":["SoftwareCraftsmanship"],"speakerIds":[1739,635,2432],"speakers":[{"speakerId":1739,"name":"Agnes CREPET"},{"speakerId":635,"name":"Jean-Baptiste Lemée"},{"speakerId":2432,"name":"David Larlet"}]},{"sessionId":2496,"scheduleId":964235240,"title":"Spock, le testing nouvelle génération","summary":"Spock est un framework de tests pour la JVM gonflé aux stéroïdes. Facile à apprendre, élégant, il supporte de nombreux paradigmes de tests : TDD, BDD, mocking, data driven, ... Rares sont ceux qui aiment écrire des tests et Spock peut vous réconcilier avec ces derniers : la syntaxe est claire, les résultats et les rapports de tests sont lisibles et on se concentre vraiment sur ce qu\u0027on veut tester. Par ailleurs, Spock est particulièrement extensible, le rendant compatible avec de nombreux frameworks, y compris les vôtres ! Enfin, Spock étant basé sur JUnit, il est compatible avec vos IDE favoris !\r\n\r\nA traverts quelques exemples en live coding, nous montrerons ce dont Spock est capable et \"c\u0027est fascinant !\".","type":"Tools in Action","theme":"Développeur au quotidien","roomId":27,"experience":"NOVICE","sponsored":false,"tags":["groovy","jUnit","TDD","Testing"],"speakerIds":[1376],"speakers":[{"speakerId":1376,"name":"Cédric Champeau"}]},{"sessionId":3091,"scheduleId":889940711,"title":"Bonjour et bienvenue","summary":"L\u0027équipe de Devoxx France vous souhaite la bienvenue et vous présente le déroulement de la conférence","type":"Conference","theme":"Java, one track to rule them all","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["javaee"],"speakerIds":[116,1395,1420,1089],"speakers":[{"speakerId":116,"name":"Antonio Goncalves"},{"speakerId":1395,"name":"zouheir cadi"},{"speakerId":1420,"name":"José Paumard"},{"speakerId":1089,"name":"Nicolas Martignole"}]},{"sessionId":3074,"scheduleId":1639328550,"title":"BOF du Groovy User Group","summary":"Tout est dans le titre","type":"BOF","theme":"Langages alternatifs","roomId":18,"experience":"SENIOR","sponsored":false,"tags":["groovy"],"speakerIds":[6],"speakers":[{"speakerId":6,"name":"Guillaume Laforge"}]},{"sessionId":2799,"scheduleId":717748229,"title":"Secret Diaries of the Performance Tuning Superhero","summary":"The year is 2013, many organizations have lost their grip on application performance and scalability as they innovate using agile release cycles and new technologies. Architectures are at cloud bursting point with logic and data stores becoming more distributed, virtual and elastic than ever before. This session takes a look back at the major performance and scalability bottlenecks of 2012, described using real-life customer case studies. It will cover common architecture pain points, the troubleshooting process and the end root cause many customers faced in production environments. It will also discuss the key challenges and best practices for Dev and Ops teams to manage application performance and scalability in live environments.\r\n\r\nSlides: http://www.slideshare.net/appdynamics/secret-diary-of-a-performance-tuning-superheros","type":"Conference","theme":"Startup, architecture et entreprenariat","roomId":16,"experience":"SENIOR","sponsored":true,"tags":["scalable"],"speakerIds":[2672],"speakers":[{"speakerId":2672,"name":"Alexandre Mechain"}]},{"sessionId":2646,"scheduleId":751923852,"title":"Montez votre serveur OAuth 2 avec Apache Oltu (ex Amber)","summary":"Et si en 15 minutes je vous présentais : \r\n - le flux principal de OAuth 2 \r\n - une lib java pour l\u0027implémenter  \r\n\r\nEt hop dès lundi vous aurez les éléments nécessaire pour mettre en place votre propre serveur OAuth 2 et ainsi proposer à vos partenaires une solution d\u0027authentification et d\u0027autorisations commune !","type":"Quickie","theme":"Jeux, Web et Mobile","roomId":13,"experience":"NOVICE","sponsored":false,"tags":["JAX-RS","OAuth","apache"],"speakerIds":[1428],"speakers":[{"speakerId":1428,"name":"Guillaume LOURS"}]},{"sessionId":2629,"scheduleId":848884488,"title":"Stratégie de testing de code legacy","summary":"Dans ce hands\u0027on de 3H, pour lequel vous devez emmener votre propre machine avec un environnement de développement java, nous vous proposons de voir les differentes stratégies de test que nous pouvons mettre en place, face à un code legacy d\u0027un autre age.\r\n\r\nParceque c\u0027est bien beau de voir tous ces exercices et démonstrations de code sur un projet from scratch ou crée pour l\u0027occasion, mais c\u0027est pas trés réaliste. Dans la vraie vie, y\u0027a du static partout, des frameworks fait-maison, des requêtes sql de 4 pages écrans et c\u0027est la dedans que nous devons évoluer. Nous vous proposons la base de code de FinancialEarthTakeDown Inc qui vient tout récemment de vous embaucher, et avec laquelle nous allons experimenter pendant 3 h.\r\n\r\nVous repartirez avec de bonnes notions de legacy testing, vous aurez decouvert des outils et probablement une bonne biliothèque ou deux qui feront que vous verrez autrement votre base de code de lundi prochain","type":"Hands-on Labs","theme":"Java, one track to rule them all","roomId":30,"experience":"SENIOR","sponsored":false,"tags":["Java7","Legacy","Testing"],"speakerIds":[450,1382],"speakers":[{"speakerId":450,"name":"Jean-Laurent de Morlhon"},{"speakerId":1382,"name":"David Gageot"}]},{"sessionId":2641,"scheduleId":776884325,"title":"Le brevet logiciel en Europe? Kit de survie.","summary":"Alors que la protection légale par le biais de brevets de développements techniques tangibles, i.e. hardware, ne semble pas engendrer de polémique particulière, la question de la protection des logiciels est l\u0027objet de houleux débats. Si le droit d\u0027auteur constitue pour beaucoup un instrument légal suffisant, l\u0027octroi d\u0027un droit exclusif par brevet pour ces méthodes abstraites est souvent remis en question.\r\n\r\nA travers quelques exemples illustratifs, la session adressera des éléments clés relatifs au droit européen des brevets appliqué aux logiciels:\r\n- Quels sont les caractéristiques et enjeux du brevet d\u0027invention en comparaison avec le droit d\u0027auteur?\r\n- Que doit démontrer un développeur au sujet de son logiciel afin de mériter une telle protection juridique?\r\n- Quel rôle tout développeur et la communauté dans son ensemble peuvent-ils jouer en tant que tiers dans la procédure de délivrance de brevet?","type":"Conference","theme":"Développeur au quotidien","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["social"],"speakerIds":[2671],"speakers":[{"speakerId":2671,"name":"Michaël De Smet"}]},{"sessionId":2774,"scheduleId":629120965,"title":"Du Javascript propre ? Challenge Accepted","summary":"Il y a quelques années, je bidouillais en JavaScript. Un effet “bling bling” par-ci, un contrôle de saisie par-là. L’essentiel de mon application était écrite en Java et tournait côté serveur.\r\nMais voilà, Gmail et Google Spreadsheets sont sortis depuis longtemps. On s’attend maintenant à des applications web qui répondent instantanément et qui fonctionnent offline. \r\nEt pour cela, il faut bien plus de code JavaScript qu’avant.\r\nMais 20 000 lignes de JavaScript pour un site web ? Sérieux ? Dans ce langage sale, qui n’a pas la moitié des outils de Java ?\r\nJ’ai appris. Et l’écosystème JavaScript a évolué. \r\nLors de cette session, je vous dévoilerai comment maintenant j’écris, sans stress, des applications JavaScript complexes.","type":"Conference","theme":"Jeux, Web et Mobile","roomId":13,"experience":"NOVICE","sponsored":false,"tags":["javascript","web","HTML5"],"speakerIds":[875,1406],"speakers":[{"speakerId":875,"name":"Julien Jakubowski"},{"speakerId":1406,"name":"Romain Linsolas"}]},{"sessionId":2776,"scheduleId":781378657,"title":"JavaScript pour les développeurs Java : quels sont les pièges à éviter ?","summary":"Javascript a été inspiré par différents langages. Java lui a donné sa syntaxe, ses objets et ses méthodes.\r\nLes syntaxes de Javascript et Java sont très proches, les développeurs Java pensent de la même manière lorsqu\u0027ils codent dans ces 2 langages. Cependant Javascript possèdent de nombreuses subtilités qui peuvent se transformer en bugs si elles ne sont pas connues.\r\nA travers ce quickie, je vais lister les prinicipaux pièges dans lesquels les développeurs Java ont tendance à tomber et comment les éviter. Voici une liste non exhaustive des points qui seront abordés :\r\n- Les différents opérateurs permettant de tester l\u0027égalité : \u003d\u003d et \u003d\u003d\u003d\r\n- La portée des variables \r\n- L\u0027enfer des variables globales ou comment isoler les variables pour qu\u0027elles ne soient pas globales\r\n- Les conversions de chaînes de caractères en nombre\r\n- Les objets natifs Javascript ne devant pas être utilisés comme en Java\r\n- L\u0027objet this et ses différentes utilisations\r\nEt d\u0027autres encore !","type":"Quickie","theme":"Langages alternatifs","roomId":13,"experience":"NOVICE","sponsored":false,"tags":["javascript","web"],"speakerIds":[2578],"speakers":[{"speakerId":2578,"name":"Florian Boulay"}]},{"sessionId":2212,"scheduleId":964235240,"title":"Solutions pour programmation calcul de masse - Hadoop distribuée-  Pig / Hive / Cascading /  MapReduce","summary":"Le calcul sur un cluster hadoop peut s\u0027effectuer avec différents formalismes, du plus déclaratif (SQL) au plus programmatique (programmation Java Map Reduce directe). \r\n\r\nQuels sont les schémas d\u0027utilisation typiques de chacune de ses solutions, leur contraintes de performance, leur expressivité. \r\n\r\nQuand est-ce que le calcul \"cluster\" fait sens par rapport au mono-machine?  \r\n\r\nLa présentation se fera en prenant et comparant des exemples issus de cas réels issues de l\u0027analyse de comportement utilisateur en marketing Web (analyse de sessions utilisateurs, recommandation produit, analyse de texte ...)","type":"Tools in Action","theme":"Développeur au quotidien","roomId":19,"experience":"SENIOR","sponsored":false,"tags":["MapReduce","Hadoop","performance","big data"],"speakerIds":[2302],"speakers":[{"speakerId":2302,"name":"Florian Douetteau"}]},{"sessionId":2528,"scheduleId":747305861,"title":"Groovy et les DSLs statiquement typés","summary":"Groovy a toujours été un langage de choix pour le développement de DSLs internes. Grâce à une syntaxe flexible, à ses capacités de méta-programmation au runtime et à la compilation, le langage offre un excellent compromis entre temps de développement, support et outillage.\r\n\r\nGroovy 2 a quant à lui introduit un typage statique optionnel. Malheureusement, typage statique et DSLs ne font pas bon ménage, en particulier lorsque l\u0027implémentation même du DSL est dynamique... Mais ça c\u0027était avant Groovy 2.1.\r\n\r\nDans cette session, nous montrerons les possibilités qu\u0027offre le langage pour être type safe à la compilation, tout en étant capable de rapporter des erreurs à l\u0027utilisateur d\u0027un DSL. Nous irons même jusqu\u0027à des exemples où Groovy peut dépasser les contrôles statiques effectués par Java...","type":"Conference","theme":"Langages alternatifs","roomId":16,"experience":"SENIOR","sponsored":false,"tags":["groovy","DSL"],"speakerIds":[1376,6],"speakers":[{"speakerId":1376,"name":"Cédric Champeau"},{"speakerId":6,"name":"Guillaume Laforge"}]},{"sessionId":2319,"scheduleId":776884325,"title":"Les secrets des Géants du Web - 10 pratiques pour mieux travailler","summary":"De l’autre côté de l’Atlantique, les Géants du Web réinventent la façon de faire de l’informatique. Ils s’appellent Amazon, Facebook, Google, Netflix ou LinkedIn pour les plus connus.\r\nLes pratiques et les technologies qu\u0027ils mettent en oeuvre sont l\u0027un des fondements du succès remarquable qu\u0027on leur connaît.\r\nGrace à ces nouvelles façons de travailler, ils sont capables de faire plus gros, plus vite, et plus efficace que ce que nous connaissons habituellement.\r\nComment ces secrets des Géants du Web peuvent-ils être une source d\u0027inspiration pour faire de l\u0027informatique différemment ?\r\nCette session, qui s\u0027appuie sur l\u0027ouvrage que nous avons publié \"les Géant du Web\"  propose une visite guidée de quelques pratiques clés : culture de la mesure, pizza-team, feature team, commodity hardware, lean startup, MVP, continuous deployment, ...","type":"Conference","theme":"Startup, architecture et entreprenariat","roomId":14,"experience":"SENIOR","sponsored":false,"tags":["NoSQL","web"],"speakerIds":[2387],"speakers":[{"speakerId":2387,"name":"Ludovic Cinquin"}]},{"sessionId":2663,"scheduleId":687279724,"title":"Do\u0027s and don\u0027ts pour le choix des exigences qualités","summary":"L\u0027amélioration, ou au minimum la non-dégradation, de la qualité du code source est un sujet qui tient de plus en plus de place au sein des équipes de développement. La mise en place d\u0027un outil tel que Sonar pour la mesurer ne suffit pas pour (re)prendre le contrôle. En effet, sans la définition et l\u0027adoption d\u0027une liste d\u0027exigences qualité partagée par tous, l’acceptation de la qualité d’une livraison sera toujours sujet à controverse ou au moins à discussion.\r\n\r\nLors de ce quickie, nous verrons quelles sont les bonnes pratique pour définir les indicateurs à choisir pour la mesure objective de la qualité d\u0027une livraison (le contrat qualité pour la release) ainsi que les indicateurs à éviter absolument. Enfin, je présenterai la liste des exigences actuellement utilisées au sein de SonarSource.","type":"Quickie","theme":"Développeur au quotidien","roomId":15,"experience":"SENIOR","sponsored":false,"tags":["Testing"],"speakerIds":[1032],"speakers":[{"speakerId":1032,"name":"Olivier Gaudin"}]},{"sessionId":2382,"scheduleId":781378657,"title":"Simplifier vos tests avec les assertions Fest Assert !","summary":"Fest Assert est une librairie d\u0027assertions riche, simple à utiliser et proche du langage naturel. \r\nElle offre des assertions spécifiques pour les collections, les String, les dates, les exceptions, les fichiers ... \r\nIl est possible d\u0027écrire des assertions spécifiques à ses propres classes ou même de les générer pour les plus faignants (malins ?).\r\n\r\nDans ce quickie, vous verrez comment :\r\n- utiliser les assertions Fest à partir d\u0027un IDE\r\n- écrire ses propres assertions\r\n- utiliser le générateur d\u0027assertions \r\n- oublier l’infâme assertEquals de JUnit !\r\n\r\nPour vous donner une idée des assertions Fest, voici un exemple : \r\n\r\n// fellowshipOfTheRing : liste contenant les 9 personnages de la communauté de l\u0027anneau\r\nassertThat(fellowshipOfTheRing).hasSize(9)\r\n                               .contains(\"frodo\", \"sam\", \"gandalf\")\r\n                               .doesNotContain(\"sauron\");","type":"Quickie","theme":"Java, one track to rule them all","roomId":15,"experience":"NOVICE","sponsored":false,"tags":["javase","Testing"],"speakerIds":[1342],"speakers":[]},{"sessionId":2635,"scheduleId":848884488,"title":"De l\u0027idée à la startup: comment concevoir un projet exceptionnel","summary":"On a tous un petit projet qui nous tient à coeur caché bien au chaud sous Github ou déployé sur Heroku. Vous venez de le releaser en version 1.0 et pour le moment hormis votre beau-frère ça ne se bouscule pas au portillon. Vous êtes convaincu par votre idée, mais vous ne savez pas comment le faire passer de l\u0027ombre à la lumière...\r\n\r\nSans coder, nous allons donner un coup d\u0027éclairage à votre projet en utilisant les principes du Lean Startup, qui permet de formaliser les hypothèses lorsque l\u0027on lance un produit et d\u0027expérimenter de manière ultra rapide.\r\nDurant ces trois heures vous allez :\r\n- Apprendre le Lean Startup\r\n- Créer le Business Canvas de votre projet\r\n- Créer votre Minimum Viable Product et le diffuser grâce à une page d\u0027aterrissage efficace sur le web et l\u0027outil Lander\r\n\r\nLe chemin vers le succès n\u0027est pas une ligne droite, mais il existe des techniques éprouvées pour vous y conduire, venez les expérimenter!\r\nSi vous n\u0027avez pas encore de projet et que votre cerveau bouillonne d\u0027idées, venez aussi!","type":"Hands-on Labs","theme":"Startup, architecture et entreprenariat","roomId":29,"experience":"NOVICE","sponsored":false,"tags":["Methodology"],"speakerIds":[1616,1470],"speakers":[{"speakerId":1616,"name":"Nathaniel Richand"},{"speakerId":1470,"name":"Yannick Grenzinger"}]},{"sessionId":2588,"scheduleId":834948906,"title":"Challenging the myths \u0026 folklore in developing high-performance systems","summary":"Building high-performance systems is tough. Today this is especially tough since a lot of the common wisdom for what makes a system high-performance is misleading at best, and often just plain wrong. This talk aims to expose the myths and folklore commonly found on the web related to building high-performance systems.\r\n\r\nMartin will cover his updated top 10 performance myths that even folk building high-performance trading or big data systems fall prey to. Taking an approach of \"measure everything\" has been an enlightening education into what works and what does not to achieve high-throughput at low-latencies. This talk highlights the findings of working on systems requiring the extremes of performance and how they truly test any high-performance systems design. Topics covered will include Java and C programming, 3rd party libraries, concurrency, and getting the best out of our operating systems, networks, and storage.","type":"Conference","theme":"Java, one track to rule them all","roomId":14,"experience":"SENIOR","sponsored":false,"tags":["javase","performance","Concurrency"],"speakerIds":[2511],"speakers":[{"speakerId":2511,"name":"Martin Thompson"}]},{"sessionId":2949,"scheduleId":899593034,"title":"Hands On with Clojure","summary":"Of all the strange new JVM languages, Clojure, with its roots in the alien world of Lisp, may well be the strangest. It is also, its proponents insist, by far the most powerful. They\u0027ll show you weird and incomprehensible proofs of this—macros, lazy lists, monads, what have you—that may well send academics into orgies of rapturous debate, but the question always remains: \"does this have any real world application at all, or are you all just geeking out on us?\"\r\n\r\nLet\u0027s find out! In this presentation, we\u0027ll build a simple web application from scratch, live on stage, using Clojure server side and its compile-to-Javascript counterpart ClojureScript client side. You\u0027ll see how Clojure\u0027s strong focus on the REPL helps improve your workflow, and how the conciseness of a truly high level language can actually let us write a whole web app in less than an hour.","type":"Conference","theme":"Langages alternatifs","roomId":16,"experience":"NOVICE","sponsored":false,"tags":["Clojure","Livecoding","web"],"speakerIds":[1456],"speakers":[{"speakerId":1456,"name":"Bodil Stokke"}]},{"sessionId":2541,"scheduleId":848884488,"title":"Collections de printemps","summary":"Avec l\u0027arrivée du JDK 8, le framework Collection s\u0027offre sa deuxième cure de jouvence. Avec le printemps poussent les petites fleurs, et fleurissent les nouvelles méthodes construites sur les lambdas expression dans le framework Collection. Cette présentation a pour objet de présenter ce noble framework, probablement parmi les plus utilisés de la plateforme Java. \r\n\r\nEn première partie : état des lieux. Les implémentations du framework Collection, leurs performances et non-performances, leurs capacités multithread, leurs implémentations immutables si elles existent. \r\n\r\nEn deuxième partie : tout d\u0027abord une rapide présentation de ce que sont les lambdas, puis l\u0027impact de leur introduction sur le framework. ForEach, Map, Filter, Reduce, Fold, Find : la signification de tout cela, la façon dont les implémentations fonctionnent, la façon d\u0027utiliser cette nouvelle approche du travail avec ces API. \r\n\r\nPublic visé : Novice, Senior, Expert","type":"University","theme":"Java, one track to rule them all","roomId":27,"experience":"SENIOR","sponsored":false,"tags":["JDK8","Lambda","collections"],"speakerIds":[1420],"speakers":[{"speakerId":1420,"name":"José Paumard"}]},{"sessionId":2536,"scheduleId":717748229,"title":"The Spring Update: Looking at Spring 3.1, 3.2, and 4.0","summary":"In its 3.2 and 4.0 generations, the Spring Framework focuses on core features for asynchronous processing and message-oriented architectures, as well as enhancements to its caching support and its language support. The Spring Framework project also comes with a new Gradle-based build and a new GitHub-based contribution model. In this session, we\u0027ll discuss key features in this year\u0027s Spring 3.2 and next year\u0027s Spring 4.0, including support for upcoming standards such as JCache, JMS 2.0, and not least of all Java 8\u0027s language features. We\u0027ll also explain how we\u0027re tracking Java EE 7.\r\n\r\nOpting for a shorter release cycle, Spring Framework 3.2 is scheduled for release in December 2012, with Spring Framework 4.0 to follow in Q4 2013. This session presents the current plan for both generations and discusses the motivations behind them.","type":"Conference","theme":"Java, one track to rule them all","roomId":27,"experience":"NOVICE","sponsored":false,"tags":["spring"],"speakerIds":[921],"speakers":[{"speakerId":921,"name":"Josh Long"}]},{"sessionId":2884,"scheduleId":993849416,"title":"Fast Forward: comment migrer un gros projet de SVN à Git","summary":"Git est devenu l\u0027outil de SCM de référence dans la communauté open-source, et commence à s\u0027imposer aussi dans le monde de l\u0027entreprise.\r\nLa problématique des projets déjà sous SVN se pose: au-dela de l\u0027analyse d\u0027opportunité vs. coût, la migration est un challenge pour tout projet non trivial (et non, git-svn ne fait pas tout!)\r\n\r\nCette présentation se base sur un cas réel: un projet de grande taille avec 5 ans d\u0027historique, 230 trunks SVN, une utilisation intensive de svn:externals, 35 développeurs, et beaucoup d\u0027outillage très lié à SVN. Nous passerons en revue les options que nous avons explorées en terme d\u0027architecture des nouveaux dépôts Git et les solutions étudiées pour remplacer svn:externals. Nous illustrerons par une demo l\u0027utilisation de git-subtree pour construire des dépôts composites et pouvoir ainsi se passer d\u0027externals. Enfin, nous vous présenterons notre retour d\u0027expérience: les succès, les pièges, les aspects humains, et l\u0027impact sur le projet.","type":"Tools in Action","theme":"Développeur au quotidien","roomId":14,"experience":"SENIOR","sponsored":false,"tags":["Legacy","Git","Tools","SVN"],"speakerIds":[1477,2618],"speakers":[{"speakerId":1477,"name":"Renaud Bruyeron"},{"speakerId":2618,"name":"Thomas Carsuzan"}]},{"sessionId":2474,"scheduleId":776884325,"title":"De Devoxx au CAC40","summary":"Si vous étiez l’année dernière à Devoxx France, peut-être avez-vous suivi Tatami : il s’agissait d’un concours de code, basé sur un projet de réseau social d’entreprise. Le projet avait été codé en quelques nuits, et est rapidement devenu populaire sur Github...\r\n\r\nOù en sommes-nous aujourd’hui?\r\n- Le projet est toujours Open Source\r\n- 2 sociétés du CAC40 l’utilisent en interne (nous donnerons les noms sous réserve de leur accord)\r\n- Nous sommes en train de monter TatamiSoft\r\n\r\nNous verrons lors de cette conférence :\r\n- La stack technique utilisée : quelles évolutions depuis 1 an?\r\n- Un état des lieux des réseaux sociaux d’entreprise : quelles sont les fonctionnalités, les besoins, les risques, les concurrents...\r\n- Le business model de TatamiSoft : pourquoi rester Open Source? Comment la société va-t-elle gagner de l’argent?\r\n\r\nPlus d’informations :\r\n- Tatami en version SaaS : https://tatami.ippon.fr/\r\n- Le code source de Tatami : https://github.com/ippontech/tatami","type":"Conference","theme":"Startup, architecture et entreprenariat","roomId":27,"experience":"NOVICE","sponsored":false,"tags":["social"],"speakerIds":[1401],"speakers":[{"speakerId":1401,"name":"Julien Dubois"}]},{"sessionId":2740,"scheduleId":629120965,"title":"IDE Java : astuces de productivité pour le quotidien","summary":"Le monde Java bénéficie sans doute des meilleurs IDE : que ce soit Netbeans, Eclipse ou IntellijIDEA, les 3 ténors du marché offrent une palette de fonctionnalités nous permettant d\u0027atteindre un excellent niveau de productivité. Mais encore faut il bien connaitre et exploiter son IDE.\r\n\r\nDans ce talk 100% demo alternant entre les 3 prétendants, je vous propose de passer en revue l\u0027essentiel des fonctionnalités clefs de ces IDE, que ce soit pour la navigation, le code ou l\u0027exécution, en passant bien sûr par les refactorings ou la programmation par intention. Une avalanche de raccourcis claviers et de petit trucs et astuces, tout cela en restant pur Java, 0 framework, 0 plugin. Bref, de quoi transformer votre vision de votre IDE et booster votre productivité et votre plaisir à développer !","type":"Conference","theme":"Développeur au quotidien","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["javase","IDE"],"speakerIds":[924],"speakers":[{"speakerId":924,"name":"Xavier Hanin"}]},{"sessionId":3083,"scheduleId":747305861,"title":"Bean Validation 1.1: on n\u0027est plus au pays des Beansounours","summary":"Bean Validation standardise la déclaration et la validation de contraintes pour la\r\nplateforme Java. La version 1.0 a été largement adoptée et intégrée avec quelques unes\r\ndes autres JSRs (JSF, JPA) et avec les frameworks Java en général.\r\n\r\nDans cette session, nous allons explorer ce que la version 1.1 amène et quelle nouvelle\r\nfonctionnalité vous pouvez attendre pour vos applications Java SE ou EE. Nous aborderons\r\nla validation des paramètres de méthode, l\u0027intégration avec Context and Dependency Injection\r\n(CDI), l\u0027utilisation des EL pour les messages et beaucoup d\u0027autres choses.\r\n\r\nVenez juger par vous-même qu\u0027on n\u0027est plus au pays des Beansounours et que Hibernate\r\nValidator est déjà là!","type":"Conference","theme":"Java, one track to rule them all","roomId":15,"experience":"SENIOR","sponsored":false,"tags":["javaee"],"speakerIds":[117],"speakers":[{"speakerId":117,"name":"Emmanuel Bernard"}]},{"sessionId":2476,"scheduleId":841502661,"title":"7 idées pour transformer une bonne équipe en équipe exceptionnelle.","summary":"Le développement d\u0027applications au fil des années est un dur travail. Il est difficile pour une équipe aussi bonne soit elle de rester motivé au jour le jour. Le but de cette présentation est de donner quelques idées qui vont permettre à ces équipes de développeurs de rester motivés et focalisées.\r\n\r\nTirées de l\u0027expérience des équipes de développement à Atlassian, je présenterai 7 idées qui peuvent aider votre équipe. Ces idées varient en degrés de faisabilité et de retour sur investissement, et je donnerai mon opinion sur celle-ci afin que vous puissiez avoir les éléments en main pour choisir les idées que vous pourrez implémenter pour vos propres équipes.","type":"Conference","theme":"Développeur au quotidien","roomId":14,"experience":"NOVICE","sponsored":true,"tags":["Atlassian","agile"],"speakerIds":[522],"speakers":[{"speakerId":522,"name":"Samuel Le Berrigaud"}]},{"sessionId":2973,"scheduleId":993849416,"title":"Développer une application web à page unique en Dart","summary":"Dart, le nouveau langage de Google, s\u0027inscrit dans la mouvance des frameworks JavaScript (Node.js, Backbone, AngularJS, etc,) et des langages compilés en JavaScript (CoffeeScript, TypeScipt, etc.) dans l\u0027objectif de faciliter le développement Web.\r\n\r\nLes applications Web sont depuis quelques années le type d\u0027application privilégié des développeurs. Néanmoins, les outils que nous possédions jusqu\u0027à très récemment n\u0027étaient absolument pas adaptés au monde professionnel.\r\n\r\nDart offre la possibilité de développer, dans un langage structuré et objet, des applications clientes et serveurs, et ceci en un temps record.\r\n\r\nMais Dart n\u0027est pas seulement un langage c\u0027est aussi tout un écosystème au service de l\u0027industrialisation.\r\n\r\nNous verrons au cours de cette présentation :\r\n    - les différents outils de l\u0027écosystème Dart,\r\n    - et comment développer une application client/serveur en Dart.","type":"Tools in Action","theme":"Langages alternatifs","roomId":28,"experience":"NOVICE","sponsored":false,"tags":["javascript","dart","google"],"speakerIds":[2517],"speakers":[{"speakerId":2517,"name":"Yohan BESCHI"}]},{"sessionId":3025,"scheduleId":834948906,"title":"Java EE 7 and EJB 3.2, what made it and what got the axe","summary":"In many non-technical regards, Java EE 7 is quite special.  Previous\r\nJava EE versions were developed entirely in a closed forum and simply\r\nemerged from the cave in various near-complete forms with little\r\ninsight or explanation as to how the group arrived to the finished\r\nproduct.  Times have changed, for the better, and Java EE 7 is the\r\nfirst major Java EE version to be developed completely in the open.\r\nThis session celebrates that openness and ability to discuss what goes\r\non in developing standards by putting you in the spec lead\u0027s seat and\r\ndiving into some of the more interesting proposals that were presented\r\nin Java EE 7 and EJB 3.2; some that made it and some that didn\u0027t.\r\nWhich would you keep, cut or hold till .next?  Did we make the right\r\ncall?  You be the judge!","type":"Conference","theme":"Java, one track to rule them all","roomId":13,"experience":"SENIOR","sponsored":false,"tags":["javaee","javaee7"],"speakerIds":[2061],"speakers":[{"speakerId":2061,"name":"David Blevins"}]},{"sessionId":2303,"scheduleId":993849416,"title":"SARAH une maison Intelligente pour connecter les objets","summary":"Depuis 8ans le sujet de l\u0027internet des objets est en pleine croissance. Un des précurseurs était le Nabaztag.\r\n\r\nAujourd\u0027hui tout le monde se lance en même temps sur le sujet:\r\n- Les FAI, la Poste, ...\r\n- Les constructeurs Apple, Samsung, Microsoft, ...\r\n- Les pure player, domotique et KickStarter\r\n- C\u0027était même le thème de LeWeb12 !\r\n\r\nMais chacun propose un framework spécifique à ses technos...\r\n\r\nSARAH est le nom d\u0027un petit projet perso visant à connecter les objets, box et services de la maison.  Simple à configurer, portable (unzip \u0026 play), en 2 parties.\r\n\r\nL\u0027idée n\u0027est pas de refaire une Nième box ! mais de:\r\n- Encapsuler les objets, box, services web dans un mini plugin\r\n- Déclencher ces plugins par la voix, geste, cron, qrcode, règles, ...\r\n\r\nUn descriptif complet: http://encausse.net/s-a-r-a-h","type":"Tools in Action","theme":"Infrastructure, hardware d’hier et de demain","roomId":18,"experience":"NOVICE","sponsored":false,"tags":["javascript","NodeJS"],"speakerIds":[2381],"speakers":[{"speakerId":2381,"name":"Jean-Philippe Encausse"}]},{"sessionId":2684,"scheduleId":964235240,"title":"Arquillian pour des tests Web simples et efficaces","summary":"Arquillian a fait ses preuves pour tester des composants Java EE. Il est aussi l\u0027outil idéal pour toutes sortes de vrais tests. Avec Drone, Graphene et Warp, vous disposez de la meilleure trousse à outils tester vos applications Web.\r\n\r\nAvec ses tests en mode client, Arquillian est capable de tester une application Web en lui envoyant des requêtes HTTP. Ses extensions Drone et Graphene permettent de bénéficier de la puissance combinée d\u0027Arquillian et de Selenium pour tester vraiment vos applications Web. En ajoutant en plus l\u0027extension Warp, on peut vérifier l\u0027état des objets coté serveur, comme la session. \r\n\r\nÇa c\u0027est ce qu\u0027on appelle de vrais tests.","type":"Tools in Action","theme":"Java, one track to rule them all","roomId":14,"experience":"NOVICE","sponsored":false,"tags":["web","Testing","Arquillian"],"speakerIds":[447],"speakers":[{"speakerId":447,"name":"Alexis Hassler"}]},{"sessionId":2844,"scheduleId":747305861,"title":"Technologies vocales pour développement web","summary":"Google, Apple, Nuance, Microsoft commencent à intégrer la reconnaissance vocale dans la plateforme OS/navigateur. La question qui nous intéresse dans cette conférence est: Pour le développeur, quelles sont les solutions accessibles ou gratuites, commerciales, ou open-source ?\r\nLa conférence donnera des notions de reconnaissance vocale, en mettant l\u0027accent sur les questions pratiques auxquelles est confronté le développeur: données linguistiques (modèle acoustique/de langage), reconnaissance à base de grammaire ou dictée, architecture cloud ou embarquée, latence, qualité de la reconnaissance vocale et stratégies de gestion des erreurs, interprétation/dialogue.\r\nParmi les solutions que nous examinerons: CMU Sphinx, Google Web Speech API (en beta dans Chrome 25), Nuance developer network, la Speech API de Windows Phone 8.","type":"Conference","theme":"Jeux, Web et Mobile","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["technology","web","mobile"],"speakerIds":[2614],"speakers":[{"speakerId":2614,"name":"Sébastien Bratières"}]},{"sessionId":2318,"scheduleId":747305861,"title":"CAS, un SSO web open source","summary":"Présentation rapide de moi-même et de SFR\r\nPrésentation de ce qu\u0027est un SSO et de leur utilisation\r\nHistoire de CAS, architecture et fonctionnement :\r\n - client + serveur, protocole\r\n - services registry (applications raccordées au SSO)\r\n - authentication handler (méthodes d\u0027authentification)\r\n - attribute repository (récupération des attributs de l\u0027utilisateur)\r\n - tickets registry (stockage des tickets)\r\n - logout\r\n - différents clients existants : Jasig CAS, Spring Security, Shiro, mod_cas\r\n - intégration avec d\u0027autres protocoles : SAML, OpenId, OAuth\r\nFocus sur certaines problématiques (vues chez SFR) :\r\n - look\u0026feel : le \"piège\" de la customisation des pages de login demandée par la MOA\r\n - performance : où stocker les tickets ? Chez SFR, nous avons d\u0027abord utilisé Oracle, puis nous avons basculé sur EhCache puis sur Memcached : pourquoi ? et avec quel gain de performance.\r\n - intégration : comment déléguer l\u0027authentification à Facebook depuis le CAS ?","type":"Conference","theme":"Jeux, Web et Mobile","roomId":27,"experience":"NOVICE","sponsored":false,"tags":["authentication","OAuth","security","OpenID"],"speakerIds":[2384],"speakers":[{"speakerId":2384,"name":"Jérôme LELEU"}]},{"sessionId":3004,"scheduleId":782366565,"title":"BigData@DevoxxFr, Saison 2","summary":"“Précédemment, à Devoxx France” : en 2012, nous présentions un retour d’expérience sur BigData chez Voyages-Sncf. \r\nDans ce nouvel épisode, une année s’est écoulée, nous avons grandi, mûri, nous nous sommes lancé un nouveau défi : développer un produit BigData ambitieux. Nous l’avons élevé aux hormones : Hadoop, Flume, ElasticSearch... Nos choix techniques, nos use cases, nos doutes, nos paris, nos débats “service cloud ou logiciel traditionnel ?”, venez découvrir les coulisses de notre aventure. \r\nA travers un cas d’utilisation simple et familier (vous avez tous un appareil WiFi dans votre poche...), nous vous montrerons comment BigData va faire une entrée fracassante dans votre quotidien.","type":"Conference","theme":"Startup, architecture et entreprenariat","roomId":16,"experience":"NOVICE","sponsored":false,"tags":["Hadoop","big data"],"speakerIds":[1630,2385],"speakers":[{"speakerId":1630,"name":"Pablo Lopez"},{"speakerId":2385,"name":"Hugo Geissmann"}]},{"sessionId":2995,"scheduleId":965276003,"title":"Programmation déclarative en Clojure: du destructuring à Datomic","summary":"Clojure est un language de programmation fonctionnel hébergé sur la\r\nJVM. S\u0027il est est surtout connu pour sa syntaxe à la LISP, l\u0027absence\r\nd\u0027objets et son adaptation à la programmation concurrente, il dispose\r\négalement de plusieurs aspects favorisant un style de programmation\r\ndéclarative, et qui ont récemment permis l\u0027apparition de systèmes et\r\nlibrairies allant dans ce sens.\r\nLe paradigme déclaratif améliore la lisibilité du code, et facilite sa\r\nmaintenance en déléguant la responsabilité du contrôle du développeur\r\nau langage. De la destructuration des paramêtres de fonctions à des\r\nsystèmes complets tels que le système de requête de la base de donnée\r\nDatomic inspiré par le Datalog, ou le système de programmation logique\r\ncore.logic, en passant par plumbing.graph, de multiples innovations\r\npermettent de tenter de s\u0027affranchir du paradigme impératif, et\r\ndémontrent la pertinence de la syntaxe de Clojure pour favoriser ce\r\ntype d\u0027explorations.","type":"Tools in Action","theme":"Langages alternatifs","roomId":18,"experience":"SENIOR","sponsored":false,"tags":["Clojure"],"speakerIds":[2617],"speakers":[{"speakerId":2617,"name":"Nils Grunwald"}]},{"sessionId":2413,"scheduleId":841502661,"title":"Boucles étranges : étranges boucles (puzzlers et curiosités)","summary":"Une promenade décousue dans les limites du code source Java, à la manière de Douglas Hofstadter.","type":"Conference","theme":"Java, one track to rule them all","roomId":12,"experience":"SENIOR","sponsored":false,"tags":["puzzlers"],"speakerIds":[871,1501],"speakers":[{"speakerId":871,"name":"Eric Lefevre-Ardant"},{"speakerId":1501,"name":"Guillaume Tardif"}]},{"sessionId":3026,"scheduleId":658678597,"title":"Building on SOLID Foundations","summary":"We know we\u0027re supposed to break code up into coherent parts, but many codebases just don\u0027t seem to get it right. To add some simple feature, we have to tear things apart or, worse, patch and work around the existing code.  In a better system, it would just take a few lines of code to change our object graph. Why is it often so hard?\r\n\r\nWe don\u0027t believe it has to be. We\u0027ve seen other systems where the code is flexible enough to support the changes we need to make.\r\n\r\nThis talk is about design principles that we\u0027ve learned help us develop large-scale code structures that are easy to read and easy to change. At the lowest level, this means well-known patterns such as avoiding globals and following SOLID guidelines. At larger scales, this means assembling those SOLID objects to avoid hidden coupling that makes the system as a whole amenable to change.  It means focusing on how objects fit together and communicate and being clear about how capabilities and information flow between objects in the running system.","type":"Conference","theme":"Java, one track to rule them all","roomId":12,"experience":"SENIOR","sponsored":false,"tags":["patterns","javase","Design"],"speakerIds":[271,2642],"speakers":[{"speakerId":271,"name":"Steve Freeman"},{"speakerId":2642,"name":"Nat Pryce"}]},{"sessionId":2292,"scheduleId":848884488,"title":"Frontend Live Coding : Tour d\u0027horizon de l\u0027outillage et des technos web d\u0027aujourd\u0027hui","summary":"Il existe aujourd\u0027hui une effervescence sur les technologies du web : tooling, nouveaux langages .. le monde du frontend commence à se structurer et à s\u0027industrialiser !\r\n\r\nDurant cette session 100% code, sans slides ajoutés, nous verrons des outils tels que Yeoman, Sass, Bower, des subtilités dans Chrome, ainsi que des frameworks tels que RequireJS, Handlebars et Backbone.\r\nVous serez à peu près certains d\u0027apprendre des choses !\r\n\r\nPlus précisément, seront présentés :\r\n- Yeoman/Grunt, orchestrateur de vos développements web made in Google\r\n- Sass/Compass, superset à CSS3 permettant notamment de variabiliser vos feuilles de style\r\n- Bower, provisionneur de librairies javascript\r\n- RequireJS, injecteur de dépendances Javascript à la demande\r\n- Handlebars, moteur de templating coté client\r\n- BackboneJS, framework MVC qui vous permettra d\u0027améliorer la maintenabilité de votre code JS\r\n- Un ensemble de tips de développement dans Chrome, dont vous ne soupçonnez peut-être pas l\u0027existence !","type":"University","theme":"Jeux, Web et Mobile","roomId":13,"experience":"NOVICE","sponsored":false,"tags":["Sass","Bower","RequireJS","BackboneJS","Livecoding","Compass","web","Yeoman","Chrome","Handlebars","Tools"],"speakerIds":[1407],"speakers":[{"speakerId":1407,"name":"Frédéric Camblor"}]},{"sessionId":2667,"scheduleId":993849416,"title":"Faire parler son code source avec Sonar","summary":"L\u0027objectif de cette session est de montrer comment faire parler le code source d\u0027une application java en moins de 30 minutes à l\u0027aide de Sonar, afin d\u0027identifier les faiblesses et les actions de remédiations à entreprendre.\r\n\r\nSonar est la plateforme Open Source d\u0027inspection continue disponible sous license LGPL, http://www.sonarsource.org","type":"Tools in Action","theme":"Développeur au quotidien","roomId":13,"experience":"SENIOR","sponsored":false,"tags":["javase"],"speakerIds":[1600],"speakers":[{"speakerId":1600,"name":"Freddy Mallet"}]},{"sessionId":2452,"scheduleId":751923852,"title":"Accès au hardware en Java pour le développement d\u0027applications industrielles","summary":"Les applications industrielles nécessitent pour la plupart de piloter des cartes d\u0027entrées/sorties. L\u0027accès à ces périphériques en Java n\u0027est cependant pas réputé simple comparé à d\u0027autres langages, et les vendeurs de matériel ne proposent que très rarement des bibliothèques d\u0027interface en Java.\r\nLe but de cette présentation est de faire un rapide panorama des solutions existantes en Java (JNI, JNA...), expliquer les erreurs les plus fréquentes, et mesurer la perte de performance par rapport à une application native sur un exemple concret (carte de réception de télémesure spatiale).","type":"Quickie","theme":"Infrastructure, hardware d’hier et de demain","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["javase"],"speakerIds":[2450],"speakers":[{"speakerId":2450,"name":"Thomas Lorblanchès"}]},{"sessionId":2334,"scheduleId":899593034,"title":"Développement d\u0027applications JavaFX 2","summary":"Depuis plus d\u0027une dizaine d\u0027années, la manière de développer des applications clientes en Java n\u0027a pas réellement évolué. JavaFX 2 se veut le digne successeur de Swing et apporte beaucoup de nouvelles fonctionnalités.\r\nVous découvrirez les nouveautés de JavaFX 2 et comment bien débuter en utilisant notamment FXML, avec lequel il est possible de réaliser aisément des interfaces complexes. Vous apprendrez à utiliser Scene Builder, un éditeur WYSIWYG vous permettant entre autres de créer vos interfaces par glisser/déposer de composants, supportant CSS afin de vous en donner un aperçu et de générer le code FXML. Les composants disponibles indispensables, leur totale personnalisation à l\u0027aide de CSS, leur création et réutilisation vous seront présentés. Vous constaterez la simplicité avec laquelle cela est possible! D\u0027autres atouts de JavaFX comme l\u0027implémentation d\u0027évènements multitouch, le glisser/déposer, la manipulation d\u0027images ne seront pas oubliées, démonstrations à l\u0027appui!","type":"Conference","theme":"Java, one track to rule them all","roomId":15,"experience":"NOVICE","sponsored":false,"tags":["javafx"],"speakerIds":[2374,1543],"speakers":[{"speakerId":2374,"name":"Thierry WASYLCZENKO"},{"speakerId":1543,"name":"Jim Weaver"}]},{"sessionId":2566,"scheduleId":629120965,"title":"Comment paraître sexy auprès des développeurs ?","summary":"Qu\u0027il s\u0027agisse d\u0027un associé pour votre start-up ou d\u0027un salarié, le choix d\u0027un développeur est tout simplement crucial. Dénicher la perle rare n\u0027est pas chose aisée.\r\nLe marché est clairement en tension en ce moment et il est nécessaire de mettre toutes les chances de son coté. Au programme de cette conférence :\r\n- Quels moyens pour recruter mon prochain développeur ?\r\n- Comment bien rédiger une offre d\u0027emploi ?\r\n- Comment donner envie aux développeurs de travailler dans ma société ?\r\n- Comment améliorer mon image employeur ?","type":"Conference","theme":"Startup, architecture et entreprenariat","roomId":14,"experience":"NOVICE","sponsored":false,"tags":["social"],"speakerIds":[1582],"speakers":[{"speakerId":1582,"name":"Camille Roux"}]},{"sessionId":3027,"scheduleId":848884488,"title":"Le Temps c\u0027est de l\u0027argent. Prenez le en compte avec Distributed DDD, CQRS et EventSourcing","summary":"Le temps est un composant crucial pour le business: réagir aux événements qui viennent de se produire, analyser ce qu’il s’est passé, prévoir ce qui vient.\r\nIl est temps de prendre le temps au sérieux.\r\nL’Event Sourcing place les événements et le temps au cœur de l’approche Domain Driven Design.\r\nTacler les problèmes de monté en charge, de concurrence et de complexité du business est possible en alliant Distributed Domain Driven Design (DDDD), Command Query Responsibility Seggregation (CQRS) et Event Sourcing.","type":"University","theme":"Startup, architecture et entreprenariat","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["CQRS","DDD","event-sourcing"],"speakerIds":[1528],"speakers":[{"speakerId":1528,"name":"Jérémie Chassaing"}]},{"sessionId":2195,"scheduleId":1609775878,"title":"BOF de la communauté Developpez.com","summary":"Fort de ses 13 millions de visites mensuelles, Developpez.com (\"DVP\" pour les intimes) est la plus grosse communauté francophone dédiée au développement. La division Java est aussi un VJUG (Virtual Java User Group) qui compte plusieurs centaines de membres.\r\n\r\nLe Site propose un forum très riche, des interviews, des blogs, des tutoriaux, etc. Mais DVP, c’est aussi une équipe constituée de rédacteurs, administrateurs, modérateurs, correcteurs, commerciaux, etc. \r\n\r\nVenez rencontrer une partie de l’équipe Java lors de ce BOF. Vous verrez nos vrais visages. Nous vous expliquerons notre fonctionnement. Ce sera l’occasion de discuter des prochaines évolutions et des bonnes idées.","type":"BOF","theme":"Développeur au quotidien","roomId":17,"experience":"NOVICE","sponsored":false,"tags":["javame","javase","jUnit","Guava","javaee","web","Testing","spring"],"speakerIds":[1454,2369],"speakers":[{"speakerId":1454,"name":"Thierry Leriche"},{"speakerId":2369,"name":"Mickael BARON"}]},{"sessionId":2451,"scheduleId":1639328550,"title":"Session Questions/Reponses avec les acteurs francais du NoSQL","summary":"Vous utilisez déjà une solution NoSQL, ou vous voulez découvrir cette nouvelle technologie? Alors venez participer à ce BoF. Sylvain (DataStax/Cassandra), Jean-Laurent (MongoDB), David (Elasticsearch), Emmanuel (Hibernate OGM, Infinispan), Florent (Neo4J) et Tugdual (Couchbase) exposeront les bénéfices et les défis de ces nouvelles bases de données. \r\n\r\nCe BoF sera également l\u0027occasion de poser des questions et échanger sur les produits, architectures mais aussi les cas d\u0027usages.","type":"BOF","theme":"Jeux, Web et Mobile","roomId":17,"experience":"NOVICE","sponsored":false,"tags":["NoSQL"],"speakerIds":[1505,450,1614,1409,1559,117],"speakers":[{"speakerId":1505,"name":"Tugdual Grall"},{"speakerId":450,"name":"Jean-Laurent de Morlhon"},{"speakerId":1614,"name":"Florent Biville"},{"speakerId":1409,"name":"David Pilato"},{"speakerId":1559,"name":"Sylvain Lebresne"},{"speakerId":117,"name":"Emmanuel Bernard"}]},{"sessionId":2495,"scheduleId":965276003,"title":"CRaSH le shell pour la plateforme Java","summary":"CRaSH est un shell open source pour étendre et monitorer une machine virtuelle Java. Le shell est accessible de plusieurs manières, en distant par SSH ou telnet, en mode standalone, en s\u0027attachant à une JVM existante ou via VisualVM.\r\n\r\nLes commandes sont écrites en Groovy et peuvent être développées en temps réel pour étendre le shell facilement et rapidement. CRaSH fournit un jeu de commandes de base pour gérer les thread, le log, l\u0027accès JDBC, JPA et JMX.\r\n\r\nLa session débutera par une introduction à CRaSH et à son utilisation, montrera ensuite l\u0027utilisation autour de plusieurs scénarii: outil à tout faire, outil de monitoring, utilisation de JPA. La session se terminera par l\u0027écriture d\u0027une commande accédant à un service Spring.\r\n\r\nLa présentation se destine à toute personne utilisant une JVM.","type":"Tools in Action","theme":"Java, one track to rule them all","roomId":28,"experience":"NOVICE","sponsored":false,"tags":["groovy","VisualVM","JVM"],"speakerIds":[1478,2014],"speakers":[{"speakerId":1478,"name":"Julien Viet"},{"speakerId":2014,"name":"Alain DEFRANCE"}]},{"sessionId":2705,"scheduleId":687279724,"title":"Peut on toujours être développeur après 40 ans ?","summary":"Vous avez commencé l\u0027informatique au siècle dernier ? \r\nVous connaissez les langages comme COBOL ou RPG ? \r\nVous savez développer sur des plateformes où les seuls terminaux ont 24 lignes et 80 colonnes ?\r\nVous avez 40 ans, vous avez une vie de famille, vous êtes toujours développeur et vous aimez ça ? A travers mon parcours personnel, nous ferons le point sur cette population qui a vu naitre les technologies du web, s\u0027est adapté et approprié ces technologies pour en faire ce qu\u0027elles sont aujourd\u0027hui.\r\nNous essaierons de répondre à des questions existentielles (ou pas). \r\nComment s\u0027intégrer dans des équipes où la plupart des membres pourraient être vos enfants et qui n\u0027ont toujours connu que le Web ?\r\nAi je raté ma vie si je ne suis pas chef de projet ?\r\nQue faire de tous ces nouveaux langages/outils dont on entend parler à la pause café ?\r\nComment mettre à profit ma seniorité dans ce contexte ? \r\nEt surtout comment concilier ça avec une vie de famille sans passer pour un ado attardé par son entourage ?","type":"Quickie","theme":"Développeur au quotidien","roomId":12,"experience":"NOVICE","sponsored":false,"tags":["web20","javaee"],"speakerIds":[1606],"speakers":[{"speakerId":1606,"name":"Benjamin MARRON"}]},{"sessionId":3080,"scheduleId":810932290,"title":"CDiscount et le Cloud","summary":"CDiscount est un des acteurs majeurs du e-commerce français. \r\nDans le cadre de la mise en place de sa plateforme d\u0027analyse de donnée, CDiscount a fait le triple choix  d\u0027Hadoop, de technologie NoSQL et du Cloud pour son déploiement. Celle-ci fournit des puits de données en vu de fournir aux équipes marketing les moyens pour optimiser en temps réel l\u0027activité, et aux utilisateurs une expérience personnalisée sur le site. La mise en oeuvre du Cloud a permis une mise en oeuvre rapide du projet et a permis d\u0027accélérer, le cycle d\u0027expérimentation, développement et mise en production sur ces nouvelles technologies","type":"AM des décideurs","theme":"Startup, architecture et entreprenariat","roomId":27,"experience":"SENIOR","sponsored":false,"tags":["cloud"],"speakerIds":[2661],"speakers":[{"speakerId":2661,"name":"Stephane Priolet"}]},{"sessionId":2902,"scheduleId":848884488,"title":"C’est le moment de se lancer dans s’cas là !","summary":"Ces derniers mois vous entendez parler de Scala un peu partout autour de vous ou...pas. \r\nMettez les mains dans le code et venez vous familiariser avec ce langage !\r\n\r\nLors de cet atelier, nous vous proposons de revenir sur des fondamentaux de Scala en nous intéressant tout particulièrement aux case class, au Pattern Matching, et pour finir aux Collections. \r\nL’atelier sera organisé autour d’exercices, mettant en jeu ces différentes notions et leurs subtilités.\r\n\r\nPas besoin de connaître les monades, monoïde ou autres, des connaissances en Java vous suffiront !","type":"Hands-on Labs","theme":"Langages alternatifs","roomId":18,"experience":"NOVICE","sponsored":false,"tags":["scala"],"speakerIds":[2540,2562,2167,2336],"speakers":[{"speakerId":2540,"name":"ludwine probst"},{"speakerId":2562,"name":"Jonathan Winandy"},{"speakerId":2167,"name":"Mathieu Chataigner"},{"speakerId":2336,"name":"Jean Helou"}]},{"sessionId":3024,"scheduleId":776884325,"title":"Apache TomEE, Java EE 6 Web Profile on Tomcat","summary":"Apache TomEE is the Java EE 6 Web Profile certified version of Apache\r\nTomcat and combines the simplicity of Tomcat with the power of Java\r\nEE. The first half of this session introduces TomEE and shows how\r\nTomcat applications leveraging Java EE technologies can become simpler\r\nand lighter with a Java EE 6 certified solution built right on Tomcat.\r\nThe second half focuses on those already familiar with TomEE and goes\r\ninto detail on latest advancements, testing techniques including\r\nArquillian, clustering features and production considerations. If\r\nyou\u0027re a Tomcat lover or a TomEE enthusiast, this is the session you\r\ndon\u0027t want to miss!","type":"Conference","theme":"Java, one track to rule them all","roomId":13,"experience":"SENIOR","sponsored":false,"tags":["clusters","javaee","Arquillian","javaee7"],"speakerIds":[2061],"speakers":[{"speakerId":2061,"name":"David Blevins"}]},{"sessionId":2433,"scheduleId":929150666,"title":"Implémenter la qualité sur un projet Java","summary":"A partir de l\u0027example du projet open source XWiki (http://xwiki.org) cette session proposera un certain nombre de pratiques pour améliorer la qualité d\u0027un projet Java et montrera comment les implémenter afin qu\u0027elles soient vérifiées automatiquement.\r\n\r\nQuelques exemples (non complets et sujets à modification):\r\n* Comment vérifier que votre projet ne casse pas la compatibilité binaire involontairement et plus généralement comment réussir à faire évoluer une API sans casser vos utilisateurs\r\n* Comment arriver à gérer le JAR hell et éviter les duplications de classes dans votre application au runtime\r\n* Comment contrôler automatiquement la couverture de tests et quelle stratégie associée mettre en place\r\n* Comment automatiser les tests fonctionnels d\u0027applications web et surtout pratiques d\u0027exécution et comment éviter les faux-positifs qui sont la plaie de tout projet","type":"Conference","theme":"Développeur au quotidien","roomId":14,"experience":"SENIOR","sponsored":false,"tags":["Selenium","Maven","javase","jenkins","jUnit","Methodology"],"speakerIds":[1414],"speakers":[{"speakerId":1414,"name":"Vincent Massol"}]},{"sessionId":2375,"scheduleId":993849416,"title":"Weld-OSGi in action","summary":"Originellement conçu pour les systèmes embarqués et les appareils mobiles, OSGi est devenu un framework répandu pour créer des applications Java modulaires et dynamiques. En dépit de sa maturité et de sa réputation, OSGi est plus souvent vu comme une source de complexité importante avec aucun gain réel. \r\nDans cette présentation nous allons voir comment OSGi, CDI et Weld s’intègrent parfaitement dans Weld-OSGi pour créer des applications tirant parti de la modularité et du dynamisme d’OSGi sans ajouter aucune complexité pour le développeur tout mettant à disposition la puissance d\u0027OSGi, en particulier des interactions quasiment transparentes avec le registre de services dynamique.\r\nCette présentation va balayer les bases de CDI et OSGi puis plongera dans Weld-OSGi pour démontrer chaque fonctionnalité majeure. Les démos seront également de la partie pour démontrer de quelles manières vous pouvez bénéficier de ce framework dans vos applications Java EE modulaires pour les rendre complètement dynamiques.","type":"Tools in Action","theme":"Java, one track to rule them all","roomId":27,"experience":"SENIOR","sponsored":false,"tags":["CDI","osgi","javaee6","Weld"],"speakerIds":[966],"speakers":[{"speakerId":966,"name":"Mathieu Ancelin"}]},{"sessionId":2507,"scheduleId":965276003,"title":"Golo, un langage simple et léger basé sur invokedynamic","summary":"Golo est (encore) un langage dynamique faiblement typé pour la JVM. Il est entièrement basé sur\r\ninvokedynamic et montre des performances \"intéressantes\" tout en ayant une emprunte réduite.\r\n\r\nGolo utilise les classes standard du JDK, ce qui le rend facilement embarquable dans des\r\napplications tierces. Golo vise le simple et l\u0027explicite. Golo aime se mélanger harmonieusement avec les autres langages de la JVM.\r\n\r\nCette session vous dévoilera les premières itérations publiques de Golo. Nous verrons le langage\r\nainsi que quelques débuts d\u0027applications, dont certaines seront contribuées par nos valeureux\r\ntesteurs bienveillants.\r\n\r\nNous lèverons aussi le voile sur quelques détails d\u0027implémentation, et en particulier en quoi\r\ninvokedynamic permet d\u0027avoir un runtime léger et performant. Enfin nous évoquerons aussi quelques outils et pratiques utilisées pour sa conception.","type":"Tools in Action","theme":"Langages alternatifs","roomId":29,"experience":"NOVICE","sponsored":false,"tags":["Java7","JVM"],"speakerIds":[381],"speakers":[{"speakerId":381,"name":"Julien Ponge"}]}],"version":127}