{
   "sessions":[
      {
         "sessionId":1336,
         "scheduleId":-1371330143,
         "title":"Live coding: Tetris simplifié avec TDD et Javascript",
         "summary":"15 minutes pour coder Tetris:\r\nhttps://gist.github.com/1821788",
         "type":"Quickie",
         "theme":"Web, Mobile et le Cloud",
         "roomId":15,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "javascript",
            "HTML",
            "TDD"
         ],
         "speakerIds":[
            1682
         ],
         "speakers":[
            {
               "speakerId":1682,
               "name":"Philippe Antoine"
            }
         ]
      },
      {
         "sessionId":1216,
         "scheduleId":-1253115611,
         "title":"OOM m\u0027a tuer : paramétrage de la Heap et du Garbage Collector sous forte charge",
         "summary":"Après un court rappel des techniques d\u0027implémentation destinées à limiter les flux mémoire dans la JVM, cette présentation s\u0027attardera de façon plus détaillée sur le tuning de la JVM Oracle dans le contexte d\u0027une Webapp subissant une forte charge.\r\nUne méthodologie générale est proposée, les outils et les options de configuration de la JVM Oracle les plus intéressants sont passés en revue, avec pour chacun des illustrations concrètes de leurs effets sur les performances de l\u0027application.",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":14,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "javase",
            "performance",
            "javaee",
            "JVM",
            "collections"
         ],
         "speakerIds":[
            1477,
            1609
         ],
         "speakers":[
            {
               "speakerId":1477,
               "name":"Renaud Bruyeron"
            }
         ]
      },
      {
         "sessionId":1012,
         "scheduleId":908790566,
         "title":"Paris Clojure User Group BOF",
         "summary":"Le Paris Clojure User Group existe depuis septembre 2011. Sa liste de diffusion est ouverte à tous les francophones et des codings dojos réunissent les parisiens de manière hebdomadaire. Si vous vous intéressez à Clojure, joignez-vous à nous !\r\nDans cette session, venez discuter de l\u0027écosystème Clojure, des opportunités d\u0027en promouvoir l\u0027adoption. C\u0027est également le bon endroit pour présenter vos projets, contributions ou idées autour du langage à une audience réceptive.",
         "type":"BOF",
         "theme":"Languages alternatifs",
         "roomId":18,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "Clojure"
         ],
         "speakerIds":[
            871,
            1455
         ],
         "speakers":[
            {
               "speakerId":871,
               "name":"Eric Lefevre-Ardant"
            }
         ]
      },
      {
         "sessionId":1241,
         "scheduleId":943882022,
         "title":"Pourquoi et comment les entreprises contribuent aux logiciels libres",
         "summary":"Le logiciel libre est indissociable de l\u0027entreprise pour être pérenne. Beaucoup d\u0027entreprises y contribuent, certaines en s\u0027affichant, d\u0027autres très discrètement, de différentes manières directes ou indirectes, que ce soit pour leur propre usage, pour réduire des coûts de maintenance, pour se faire mieux connaître ou pour embellir leur image. Sans financement, pas de développeurs et sans développeurs, pas de logiciels libres durables.",
         "type":"BOF",
         "theme":"Entreprises et pratiques",
         "roomId":19,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "FOSS"
         ],
         "speakerIds":[
            1624
         ],
         "speakers":[
            {
               "speakerId":1624,
               "name":"willy tarreau"
            }
         ]
      },
      {
         "sessionId":1301,
         "scheduleId":50840673,
         "title":"Seren, la sérialisation sous stéroïdes !",
         "summary":"Le mécanisme de sérialisation de Java est flexible et puissant, mais ses performances peuvent être considérablement améliorées en appliquant certaines astuces. \r\n\r\nEn instrumentant vos classes au chargement, la librairie Seren vous permet de bénéficier immédiatement de ces optimisations, de manière totalement transparente pour votre code. \r\n\r\nAucun compilateur n\u0027a été blessé pendant le développement de cette librairie (ou presque).",
         "type":"Quickie",
         "theme":"Java, Java EE et Architectures",
         "roomId":15,
         "experience":"EXPERT",
         "sponsored":false,
         "tags":[
            "javase"
         ],
         "speakerIds":[
            1567
         ],
         "speakers":[
            {
               "speakerId":1567,
               "name":"Olivier Croisier"
            }
         ]
      },
      {
         "sessionId":1448,
         "scheduleId":248473051,
         "title":"Venez découvrir .Net",
         "summary":".Net et Java ont beaucoup de points en communs, peut-être plus que vous ne l\u0027imaginez!\r\nVenez discuter avec nous de .Net pendant cette session de découverte, poser vos questions.",
         "type":"BOF",
         "theme":"Languages alternatifs",
         "roomId":19,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Microsoft"
         ],
         "speakerIds":[
            1680
         ],
         "speakers":[
            {
               "speakerId":1680,
               "name":"Rui Carvalho"
            }
         ]
      },
      {
         "sessionId":1182,
         "scheduleId":879237894,
         "title":"BOF UserGroup Groovy \u0026 Grails",
         "summary":"Discussions autour de l\u0027écosystème Groovy, Grails, et plus, et avec en exclusivité l\u0027humoriste du moment qui cartonne, le grandiose Guillaume Laforge ! ;)",
         "type":"BOF",
         "theme":"Languages alternatifs",
         "roomId":17,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "groovy",
            "grails"
         ],
         "speakerIds":[
            1029,
            6,
            1376
         ],
         "speakers":[
            {
               "speakerId":1029,
               "name":"Stephane Maldini"
            },
            {
               "speakerId":6,
               "name":"Guillaume Laforge"
            }
         ]
      },
      {
         "sessionId":1251,
         "scheduleId":908790566,
         "title":"DevoxxJS",
         "summary":"L\u0027équipe ParisJS infiltre Devoxx le temps d\u0027une sessions BOF pour refaire les meilleures présentations JavaScript de l\u0027année 2011.",
         "type":"BOF",
         "theme":"Web, Mobile et le Cloud",
         "roomId":17,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "javascript",
            "HTML5"
         ],
         "speakerIds":[
            1636
         ],
         "speakers":[
            {
               "speakerId":1636,
               "name":"Thomas Bassetto"
            }
         ]
      },
      {
         "sessionId":1222,
         "scheduleId":-1400784948,
         "title":"Faire du code centré sur l’humain.",
         "summary":"Dans son livre “The design for everyday things”,  Donald Norman met en avant le design centré sur l’humain en expliquant les principes d’un bon design : contraintes, mapping, affordance, visibilité et gestion de l’erreur. Tous ces principes, basés sur le fonctionnement de notre cerveau, permettent de créer un bon modèle conceptuel.\r\n\r\nMais quel est le rapport avec le code ? Justement un bon code doit être désigné et compréhensible ! Un bon modèle conceptuel du code ou de l’architecture du logiciel est un des meilleurs moyens d’en améliorer sa qualité et sa maintenabilité.\r\n\r\nEn 15 min, je vous présenterais ces principes et les relations avec la qualité du code !",
         "type":"Quickie",
         "theme":"Entreprises et pratiques",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Design"
         ],
         "speakerIds":[
            1470
         ],
         "speakers":[
            {
               "speakerId":1470,
               "name":"Yannick Grenzinger"
            }
         ]
      },
      {
         "sessionId":1364,
         "scheduleId":-1400784948,
         "title":"Incanter, des statistiques en un coup de baguette magique",
         "summary":"Une présentation rapide d\u0027Incanter http://incanter.org une librairie de statistiques écrite en Clojure. Une autre façon de se familiariser avec Clojure.",
         "type":"Quickie",
         "theme":"Languages alternatifs",
         "roomId":15,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Clojure"
         ],
         "speakerIds":[
            1285
         ],
         "speakers":[
            {
               "speakerId":1285,
               "name":"Claude Falguière"
            }
         ]
      },
      {
         "sessionId":1102,
         "scheduleId":-1222639573,
         "title":"Java Caching with Guava",
         "summary":"Join us for a deep dive into Guava\u0027s new caching APIs, found in com.google.common.cache. We review the entire cache package in depth, describing the behavior of its APIs and explaining the techniques used to implement them. We compare all of the eviction policies provided by the library, giving specific examples of when each one might be appropriate. For all APIs we show real code to illustrate how to interact with them.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":14,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "google",
            "caching"
         ],
         "speakerIds":[
            1516
         ],
         "speakers":[
            {
               "speakerId":1516,
               "name":"Charles Fry"
            }
         ]
      },
      {
         "sessionId":1468,
         "scheduleId":-1340763616,
         "title":"Java sur Amazon Web Services",
         "summary":"Amazon Web Services propose aux développeurs Java une infrastructure et des outils de développement complets pour réaliser et déployer tout type d’applications. Cette session présente les avantages et meilleures pratiques d’utilisation d’Amazon Web Services durant toutes les phases du cycle de vie d’une application. La présentation couvrira les outils Java dont AWS Elastic Beanstalk, les API Java pour AWS, et le plugin Eclipse. Des cas d’applications réelles déployées sur Amazon Web Services seront également présentées à l’audience pour montrer l’utilisation des différents services Amazon en action.",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":16,
         "experience":"SENIOR",
         "sponsored":true,
         "tags":[
            "cloud",
            "Amazon"
         ],
         "speakerIds":[
            1726
         ],
         "speakers":[
            {
               "speakerId":1726,
               "name":"Carlos Conde"
            }
         ]
      },
      {
         "sessionId":1150,
         "scheduleId":-601076355,
         "title":"JavaServer Faces Antipatterns and Best Practices",
         "summary":"No matter how good a framework is, it can always be used incorrectly. This holds true for JavaServer Faces (JSF) as well as any other framework.\r\n\r\nIn this session, we\u0027ll look at real-world examples of antipatterns for developing JSF applications. These range from specific issues, like hard-coding component IDs in backing beans and accessing the database in getter methods, to more systemic problems, such as lack of common-sense standards and usage of the wrong APIs. Along the way, we\u0027ll discuss best practices that will help ensure that your JSF applications are performant, well-designed, and easily comprehensible to new team members.",
         "type":"University",
         "theme":"Web, Mobile et le Cloud",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "JSF2",
            "javaee",
            "javaee6",
            "JSF"
         ],
         "speakerIds":[
            103
         ],
         "speakers":[
            {
               "speakerId":103,
               "name":"Kito Mann"
            }
         ]
      },
      {
         "sessionId":1265,
         "scheduleId":263254888,
         "title":"JDK 8 demo: lambdas in Action",
         "summary":"Le \"JDK8 Preview with Lambda support\" permet dès aujourd\u0027hui de compiler et d\u0027exécuter du code java utilisant des lambdas, et d\u0027avoir un aperçu de l\u0027évolution des APIs rendue possible avec les lambdas.\r\n\r\nCette démonstration du preview du JDK8 mettra en avant la nouvelle syntaxe des lambdas du JDK 8 et certains cas d\u0027inférence de type permettant de simplifier encore la syntaxe java. \r\nLe code utilisera aussi certaines APIs des nouvelles collections afin de montrer les grandes lignes des évolutions liées aux lambdas.",
         "type":"Tools in Action",
         "theme":"Java, Java EE et Architectures",
         "roomId":13,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "javase"
         ],
         "speakerIds":[
            1501
         ],
         "speakers":[
            {
               "speakerId":1501,
               "name":"Guillaume Tardif"
            }
         ]
      },
      {
         "sessionId":1183,
         "scheduleId":879237894,
         "title":"JUG Leader",
         "summary":"L\u0027occasion révée d\u0027avoir (presque) tous les JUG Leaders français dans la même salle pour partager des informations, des idées, et rendre la communauté encore plus forte.",
         "type":"BOF",
         "theme":"Java, Java EE et Architectures",
         "roomId":19,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "JUG"
         ],
         "speakerIds":[
            116
         ],
         "speakers":[
            {
               "speakerId":116,
               "name":"Antonio Goncalves"
            }
         ]
      },
      {
         "sessionId":1161,
         "scheduleId":-1340763616,
         "title":"Le Web mobile avec Dojo",
         "summary":"Après avoir introduit le Toolkit JavaScript Dojo ainsi que les nouveautés de la version 1.7, nous entrerons dans les détails de la création, étape après étape, d\u0027une application Web mobile avec Dojo. Nous détaillerons les astuces à retenir ainsi que les pièges à éviter. Finalement nous conclurons sur les nouveautés attendues dans la version 1.8 de Dojo.",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":true,
         "tags":[
            "web20",
            "javascript",
            "dojo",
            "mobile"
         ],
         "speakerIds":[
            1579
         ],
         "speakers":[
            {
               "speakerId":1579,
               "name":"Christophe Jolif"
            }
         ]
      },
      {
         "sessionId":1255,
         "scheduleId":-601076355,
         "title":"Légendes urbaines sur Scala; Venez vous faire votre propre opinion.",
         "summary":"Depuis que le langage Scala gagne en popularité, de nombreuses légendes urbaines quant à sa complexité apparaissent. Dans cette session nous vous proposons une introduction progressive au langage Scala pour vous permettre de vous repérer dans un code source, et vous initier aux concepts fondamentaux. Ainsi vous serez à même de vous faire votre propre opinion. La présentation sera organisée autour de la création d\u0027une véritable petite application Web écrite en Scala.",
         "type":"Hands-on Labs",
         "theme":"Languages alternatifs",
         "roomId":18,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "scala"
         ],
         "speakerIds":[
            1292,
            1640
         ],
         "speakers":[
            {
               "speakerId":1292,
               "name":"Sadek Drobi"
            },
            {
               "speakerId":1640,
               "name":"Guillaume Bort"
            }
         ]
      },
      {
         "sessionId":1005,
         "scheduleId":-1222639573,
         "title":"Les Cast Codeurs Podcast",
         "summary":"Les Cast Codeurs est LE podcast francophone de la communauté Java. Animé par Emmanuel Bernard (Hibernate, JBoss by Red Hat), Antonio Goncalves (ParisJUG, Indep), Guillaume Laforge (Groovy, VMWare), Vincent Massol (XWiki, Eponyme), le podcast vous informe dans la bonne humeur des nouvelles de Java au sens large.\r\n\r\nVenez nous rejoindre pour un enregistrement en direct de Devoxx France où nous discuterons des tendances de la conférence et de l\u0027actualité printanière de Java.\r\n\r\nhttp://lescastcodeurs.com",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":16,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Podcast"
         ],
         "speakerIds":[
            117,
            1414,
            647,
            6,
            116
         ],
         "speakers":[
            {
               "speakerId":117,
               "name":"Emmanuel Bernard"
            },
            {
               "speakerId":6,
               "name":"Guillaume Laforge"
            },
            {
               "speakerId":116,
               "name":"Antonio Goncalves"
            }
         ]
      },
      {
         "sessionId":1280,
         "scheduleId":199531243,
         "title":"Lily va faire les courses - Lily goes shopping",
         "summary":"Lily is a Hadoop/HBase Big Data platform with integrated indexing and search based on Solr. In this presentation, we will present Lily as part of a Big Data enterprise architecture, but also highlight the practical use case of Lily being used as foundation technology for a large French retail company.\r\n\r\nSteven will present on Lily and Big Data, while Bruno, enterprise Java architect with SFEIR, will provide hands-on experience from working with Lily in the retail domain. This will be a mixed French/English presentation.",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":12,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "HBase",
            "Hadoop",
            "GWT",
            "cloud"
         ],
         "speakerIds":[
            68,
            1650
         ],
         "speakers":[
            {
               "speakerId":68,
               "name":"Steven Noels"
            }
         ]
      },
      {
         "sessionId":1037,
         "scheduleId":51829387,
         "title":"Linked Data - Big Data at Web scale",
         "summary":"Linked Data, c\u0027est le Web (le vrai, avec REST et tout et tout)\r\nappliqué au données. C\u0027est donc un sous-ensemble du Semantic Web, mais\r\nen beaucoup simple et plus facile à déployer. C\u0027est aussi ce que\r\nbeaucoup appellent Web 3.0 (mais pas moi).\r\n\r\nJe montrerai à quoi ça ressemble et comment ça marche.",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":16,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "HTTP",
            "scalable",
            "W3C",
            "REST",
            "web3"
         ],
         "speakerIds":[
            1389
         ],
         "speakers":[
            {
               "speakerId":1389,
               "name":"Alexandre Bertails"
            }
         ]
      },
      {
         "sessionId":1317,
         "scheduleId":21385868,
         "title":"NoSQL avec SQL: et pourquoi pas ?",
         "summary":"Parmi les sujets NoSQL, la part belle est donnée au volet \"pas-de-SQL\" avec l\u0027usage d\u0027API propre à chaque technologie. Pourtant plusieurs solutions \"SQL\" existent pour assurer les caractéristiques souhaitées du NoSQL: architecture distribuée, rapide et scalable - par exemple VoltDB et SQLFire.\r\nDans cette session, découvrez l\u0027architecture de ce type de solution, et jusqu\u0027à quel point le langage SQL peut être utilisé pour des schéma avec tables partitionnées dynamiquement, des procédures stockées parralèles, et quels sont les points clés à considérer pour affiner performance, robustesse et aspect transactionnel.",
         "type":"Quickie",
         "theme":"Java, Java EE et Architectures",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "NoSQL"
         ],
         "speakerIds":[
            1669
         ],
         "speakers":[
            {
               "speakerId":1669,
               "name":"Alexandre Vasseur"
            }
         ]
      },
      {
         "sessionId":1224,
         "scheduleId":199531243,
         "title":"Optimiser vos applications HTML pour Android",
         "summary":"Durant cette présentation un des ingénieurs responsables du navigateur Internet d\u0027Android vous présentera différentes techniques et astuces pour optimiser vos sites et applications HTML. Vous découvrirez comment le navigateur utilise l\u0027accélération matérielle et comment en bénéficier.",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":15,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "android",
            "performance",
            "HTML5"
         ],
         "speakerIds":[
            1576
         ],
         "speakers":[
            {
               "speakerId":1576,
               "name":"Nicolas Roard"
            }
         ]
      },
      {
         "sessionId":1326,
         "scheduleId":248473051,
         "title":"OSS en France : usages et pratiques",
         "summary":"L\u0027objectif de ce BOF est de comparer les expériences de participants à de nombreux projets open sources en France. les sujets abordés seront :\r\n- OSS public/privé : quelle différence ?\r\n- Organisation de travail : comment gérer vie privée et OSS ?\r\n- Entreprise et OSS : comment aborder les impératifs économique et rester dans un cadre OSS ?\r\n- OSS en région parisienne et en province : différences et similitudes\r\n- Modèle économique : comment vivre (bien) tout en travaillant sur des projets OSS\r\n- Entrer en OSS : comment faire ?",
         "type":"BOF",
         "theme":"Entreprises et pratiques",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "collaboration"
         ],
         "speakerIds":[
            1672,
            748,
            647,
            381,
            200,
            6
         ],
         "speakers":[
            {
               "speakerId":1672,
               "name":"Emmanuel Lecharny"
            },
            {
               "speakerId":381,
               "name":"Julien Ponge"
            },
            {
               "speakerId":6,
               "name":"Guillaume Laforge"
            }
         ]
      },
      {
         "sessionId":1457,
         "scheduleId":21385868,
         "title":"OVH public cloud avec jclouds",
         "summary":"Avec l\u0027émergence du cloud computing, des connecteurs comme jclouds permettent d\u0027administrer et d\u0027exploiter les ressources cloud mises à disposition de manières plus simple et générique (interchangeable facilement pour plusieurs fournisseurs de cloud computing). D\u0027autres connecteurs pour clouds computing sont basés sur jclouds (Whirr), c \u0027est la raison pour laquelle OVH a développé son propre connecteur jclouds.",
         "type":"Quickie",
         "theme":"Web, Mobile et le Cloud",
         "roomId":16,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "cloud"
         ],
         "speakerIds":[
            1718,
            1730
         ],
         "speakers":[
            {
               "speakerId":1718,
               "name":"David Krolak"
            }
         ]
      },
      {
         "sessionId":1105,
         "scheduleId":-1429421632,
         "title":"sizeOf en Java — parce que la taille…  ça compte!",
         "summary":"Le prix de la RAM a radicalement chuté et il n\u0027est pas rare d\u0027avoir un serveur avec des dizaines, voir de centaines de gigaoctets de mémoire vive. Les implications pour la conception d\u0027applications et topologies de déploiement de serveurs sont importants. Utilisé un cache embarqué dans votre application est un exemple courant. Mais comment disposer de toute cette mémoire ?\r\nLe logiciel libre Ehcache vous permets, depuis sa dernière version 2.5, de dimensionner vos caches directement en octets. Rien de particulier, si ce n\u0027est que Java n\u0027offre pas de fonction sizeOf.\r\nCette présentation vous emmènera, code à l\u0027appui, à travers l\u0027implémentation de cette librairie de mesure d\u0027objets pour Java version 1.4, 5, 6 et 7; avec les machines virtuelles d\u0027Oracle, JRockit et IBM; et leurs innombrables variantes et plateformes visées (32 vs. 64 bits, CMS, compressed OOPS, …). Offrant de nouvelles beaucoup plus dynamique perspectives dans l\u0027utilisation d\u0027un cache en mémoire.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":14,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "javase",
            "Ehcache",
            "caching"
         ],
         "speakerIds":[
            403
         ],
         "speakers":[
            {
               "speakerId":403,
               "name":"Alex Snaps"
            }
         ]
      },
      {
         "sessionId":1359,
         "scheduleId":-1253115611,
         "title":"Visualiser un document Office dans une appli Android",
         "summary":"Retour d\u0027expérience....Ce que je veux faire: \r\nAfficher un document Office ou PDF dans une application Android\r\nComment pallier à l’absence de gestion native des documents Office et PDF?\r\nPrésentation des différentes solutions\r\nUne aventure folle\r\n- Portabilité de Java vers Android\r\n- Utilisation du code natif “quand y’a pas le choix!”",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":16,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "google",
            "android",
            "PDF"
         ],
         "speakerIds":[
            1610,
            1634
         ],
         "speakers":[
            {
               "speakerId":1610,
               "name":"Jean-Louis Rousselin"
            }
         ]
      },
      {
         "sessionId":1366,
         "scheduleId":81407200,
         "title":".Net pour le développeur Java : une source d\u0027inspiration ?",
         "summary":"Si Java et C# sont très proches, en syntaxe, en pratiques et dans leurs écosystèmes, c\u0027est en particulier parce qu\u0027ils n\u0027ont cessé de s\u0027inspirer l\u0027un de l\u0027autre au fil des années. Où en sommes-nous aujourd\u0027hui, et quelles sont les caractéristiques les plus marquantes disponibles en C# dont on pourrait rêver en Java ? \r\n\r\nLors de cette session qui se veut aussi divertissante nous parlerons notamment de lambdas, d\u0027asynchrone et de LINQ, sans oublier les dynamiques, générators, ou encore certains frameworks web novateurs comme Razor.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Java7",
            "Java8",
            "javase",
            "javaee",
            "Microsoft"
         ],
         "speakerIds":[
            1532,
            1680
         ],
         "speakers":[
            {
               "speakerId":1532,
               "name":"Cyrille Martraire"
            },
            {
               "speakerId":1680,
               "name":"Rui Carvalho"
            }
         ]
      },
      {
         "sessionId":1475,
         "scheduleId":-612572787,
         "title":"Abstraction Distractions for France",
         "summary":"Computer science is built on a shaky tower of abstractions, but we’ve been distracted by other things until we believe it is reality. This talk teases apart some of the tangled abstractions that have become so common they are invisible yet impact important decisions. I cover languages, tools, platforms, and burrow all the way down to fundamental concepts. This wide-ranging keynote answers these questions and more:\r\n\r\n- Why does my keyboard look the way it does?\r\n- Why is the iPad is the most revolutionary device in the last 30 years?\r\n- Why do some people hate Maven so much?\r\n- How can I choose technologies with long shelf lives?\r\n- Is hiding always a good thing?",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Podcast"
         ],
         "speakerIds":[
            276
         ],
         "speakers":[
            {
               "speakerId":276,
               "name":"Neal Ford"
            }
         ]
      },
      {
         "sessionId":1447,
         "scheduleId":908790566,
         "title":"Ask the Guava team",
         "summary":"Google\u0027s Java Core Libraries team will be on hand to talk informally about how we build libraries at Google, future directions of Guava, our API design philosophies -- anything you\u0027d like to know!",
         "type":"BOF",
         "theme":"Java, Java EE et Architectures",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "javase"
         ],
         "speakerIds":[
            1714,
            1516
         ],
         "speakers":[
            {
               "speakerId":1714,
               "name":"Kevin Bourrillion"
            },
            {
               "speakerId":1516,
               "name":"Charles Fry"
            }
         ]
      },
      {
         "sessionId":1451,
         "scheduleId":943882022,
         "title":"BOF - Agilité",
         "summary":"Nous proposons d\u0027animer une BOF sur l\u0027agilité, sous format World Café ou Open Space",
         "type":"BOF",
         "theme":"Entreprises et pratiques",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "agile"
         ],
         "speakerIds":[
            1702,
            1682
         ],
         "speakers":[
            {
               "speakerId":1702,
               "name":"Luc Bizeul"
            },
            {
               "speakerId":1682,
               "name":"Philippe Antoine"
            }
         ]
      },
      {
         "sessionId":1173,
         "scheduleId":879237894,
         "title":"BOF du Paris Android User Group, Rencontre avec Romain GUY et Nicolas ROARD de Google",
         "summary":"Le Paris Android User Group (paug.fr) organisera une rencontre ouverte a tous. \r\nNous aurons deux invités de marque pour cette session : Romain Guy et Nicolas Roard qui échangerons avec les animateurs et le public présent. \r\n\r\nLors de la premiere partie on enregistrera en public, une emission d\u0027Android Devcast. \r\nL\u0027Android Devcast est un nouveau podcast sur Android pour les professionnels et les développeurs http://android-devcast.com \r\n\r\nUne autre partie de la soirée sera consacrée à un échange entre la communauté présente et l\u0027invité.\r\nFeedback",
         "type":"BOF",
         "theme":"Web, Mobile et le Cloud",
         "roomId":15,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Podcast",
            "android"
         ],
         "speakerIds":[
            1452,
            132,
            1592
         ],
         "speakers":[
            {
               "speakerId":1452,
               "name":"Eyal Lezmy"
            },
            {
               "speakerId":132,
               "name":"Romain Guy"
            }
         ]
      },
      {
         "sessionId":1472,
         "scheduleId":908790566,
         "title":"BOF MongoDB user group",
         "summary":"Rejoignez le temps d\u0027une soirée le MongoDB Meetup.\r\nFort de 250 membres, la communauté MongoDB vous propose de venir discuter et échanger autour de MongoDB. Quelque soit votre langage, Java, Scala, .NET, JS ou autre, venez nous rencontrer et échangeons ensemble autour de mongo.",
         "type":"BOF",
         "theme":"Java, Java EE et Architectures",
         "roomId":19,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "MongoDB"
         ],
         "speakerIds":[
            1644
         ],
         "speakers":[
            {
               "speakerId":1644,
               "name":"Stephane Godbillon"
            }
         ]
      },
      {
         "sessionId":1131,
         "scheduleId":21385868,
         "title":"Bref, comment je suis devenu commiter Apache (presque) par accident",
         "summary":"Retour d\u0027expérience sur la participation à un projet Open Source et démystification de la contribution à l\u0027Open Source. Sujet abordés :\r\n- Pourquoi contribuer ?\r\n- Comment entrer dans un projet Open Source\r\n- Analyse de deux communautés assez différentes : Apache et JBoss\r\n- La contribution au quotidien.\r\n\r\nLe tout avec légereté et auto-dérision.",
         "type":"Quickie",
         "theme":"Entreprises et pratiques",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "apache",
            "jboss",
            "Tools"
         ],
         "speakerIds":[
            618
         ],
         "speakers":[
            {
               "speakerId":618,
               "name":"Antoine Sabot-Durand"
            }
         ]
      },
      {
         "sessionId":1464,
         "scheduleId":110965483,
         "title":"Building Mobile HTML5 Apps in Hours Not Days",
         "summary":"HTML5 has delivered on the promise to make building mobile apps work seamlessly across devices and operating systems. But developers looking to build applications still have to code HTML, JavaScript and CSS by hand, often laboriously rebuilding features that exist in native platforms without the benefit of tooling that native platforms offer. New tools in the HTML5 space, like Sencha Designer make building mobile HTML5 apps as fun and easy as building native apps.",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":12,
         "experience":"SENIOR",
         "sponsored":true,
         "tags":[
            "javascript",
            "HTML5",
            "mobile"
         ],
         "speakerIds":[
            1724
         ],
         "speakers":[
            {
               "speakerId":1724,
               "name":"Aditya Bansod"
            }
         ]
      },
      {
         "sessionId":1194,
         "scheduleId":-1400784948,
         "title":"Code Reviews - One Thing Every Programmer Should Know",
         "summary":"Code Reviews increase code quality and reduce defect rate. But not necessarily for the reasons you might think. In this talk Mattias will share his experience regarding Code Reviews with a different approach\r\nand how that increases code quality and team spirit.",
         "type":"Quickie",
         "theme":"Entreprises et pratiques",
         "roomId":14,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "collaboration",
            "agile",
            "Methodology"
         ],
         "speakerIds":[
            617
         ],
         "speakers":[
            {
               "speakerId":617,
               "name":"Mattias Karlsson"
            }
         ]
      },
      {
         "sessionId":1172,
         "scheduleId":21385868,
         "title":"C’est si simple GIT !",
         "summary":"On ne présente plus GIT, mais pour les retardataires ou/et frileux, je vous propose de vous démontrer pourquoi GIT est un outil aussi efficace qu\u0027universel. En effet, que vous travaillez dans une banque sous Java/Eclipse/Windows, ou une agence web sous Ruby/RubyMine/Linux, je vous assure que GIT s\u0027apprivoise vite. Pour le démontrer, nous déroulerons ensemble un scénario de développement de \"la vraie vie\", avec ses lots de merges, conflits et gestions de branches.",
         "type":"Quickie",
         "theme":"Entreprises et pratiques",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Git"
         ],
         "speakerIds":[
            1587
         ],
         "speakers":[
            {
               "speakerId":1587,
               "name":"Ulrich Vachon"
            }
         ]
      },
      {
         "sessionId":1199,
         "scheduleId":263254888,
         "title":"De l\u0027audit de Code à l\u0027Inspection Continue",
         "summary":"Lors de cette session, nous verrons comment passer d\u0027une approche \"audit\" à une approche \"inspection en continue\" de la qualité du code source en utilisant Sonar.",
         "type":"Tools in Action",
         "theme":"Entreprises et pratiques",
         "roomId":14,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "Testing",
            "analysis"
         ],
         "speakerIds":[
            1032
         ],
         "speakers":[
            {
               "speakerId":1032,
               "name":"Olivier Gaudin"
            }
         ]
      },
      {
         "sessionId":1076,
         "scheduleId":-1429421632,
         "title":"Deadlock Victim",
         "summary":"In a database, if two queries cause what is detected as a deadlock, one of them fails with a SQLTransactionRollbackException.  In Java, when two threads cause a deadlock, there is no easy way to break out of this.  In this talk, we will look at what deadlocks are, why they occur, why they don\u0027t occur more frequently and how to avoid them in your code.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "multicore",
            "javase"
         ],
         "speakerIds":[
            265,
            1567
         ],
         "speakers":[
            {
               "speakerId":265,
               "name":"Heinz Kabutz"
            },
            {
               "speakerId":1567,
               "name":"Olivier Croisier"
            }
         ]
      },
      {
         "sessionId":1406,
         "scheduleId":50840673,
         "title":"Dépoussiérez votre code java avec Lombok !",
         "summary":"Vous trouvez que les méthodes \"getters\", \"setters\", \"equals\", \"hashcode\", \"toString\" polluent votre code ? \r\nVous aimez les patterns \"Builder\" et \"Delegate\" mais trouvez que c\u0027est une montagne de code à écrire ?\r\nVous trouvez que les extensions method de C# seraient un atout formidable pour le langage java ?\r\nVous trouvez que l\u0027AST manipulation de groovy c\u0027est de la balle ?\r\n\r\nProject lombok vous apporte tout ça sur un plateau !",
         "type":"Quickie",
         "theme":"Java, Java EE et Architectures",
         "roomId":16,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "lombok",
            "annotations"
         ],
         "speakerIds":[
            1578
         ],
         "speakers":[
            {
               "speakerId":1578,
               "name":"Florent Ramière"
            }
         ]
      },
      {
         "sessionId":1415,
         "scheduleId":263254888,
         "title":"Dessine moi un language: à la découverte de Xtext",
         "summary":"Cette présentation permettra de découvrir la technologie Xtext et sera décomposée en plusieurs parties:\r\n\r\n1) une première partie, plutôt théorique, sur les différentes parties de Xtext et leur rôle bien précis\r\n2) une seconde, plus business, sur des utilisations actuelles de cette technologie\r\n3) enfin,une dernière, plus pratique, montrera un cas d\u0027utilisation de Xtext pour développer un éditeur IzPack et le lien avec les outils de développement Java",
         "type":"Tools in Action",
         "theme":"Languages alternatifs",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Eclipse",
            "Xtext",
            "DSL",
            "IzPack"
         ],
         "speakerIds":[
            1571
         ],
         "speakers":[
            {
               "speakerId":1571,
               "name":"Jeff Maury"
            }
         ]
      },
      {
         "sessionId":1334,
         "scheduleId":-1371330143,
         "title":"DevOps illustré : la jungle de la configuration d\u0027une application",
         "summary":"L\u0027approche DevOps essaie de rapprocher les développeurs et les administrateurs système, ce Quickie illustre le cas de la configuration des applications en présentant le besoin d\u0027amélioration de la gestion des paramètres de configuration d\u0027une application, avec une solution possible.\r\n\r\nNotre codes contient beaucoup de paramètres : des options, des URL, des Emails, ... ces valeurs changent fréquemment entre l\u0027environnement de production, de recette, le poste de développeur. Gérés manuellement ils causent beaucoup de bugs évitables. \r\n\r\n* Quels sont les principes d\u0027une bonne gouvernance des paramètres ?\r\n* Comment éviter un bricolage manuel et voué à générer des erreurs d\u0027utilisation ?\r\n* Comment avoir une documentation du paramétrage de votre application toujours à jour ?\r\n* Comment connaitre l\u0027origine de la valeur utilisée (paramètre JVM, variable d\u0027environnement, valeur par défaut) ?\r\n\r\nLe but est une prise de conscience sur le sujet, et la présentation d\u0027une mise en oeuvre simple.",
         "type":"Quickie",
         "theme":"Entreprises et pratiques",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "javase",
            "DevOps"
         ],
         "speakerIds":[
            1611,
            1390
         ],
         "speakers":[
            {
               "speakerId":1611,
               "name":"Dimitri Baeli"
            }
         ]
      },
      {
         "sessionId":1091,
         "scheduleId":-7250816,
         "title":"ElasticSearch : moteur de recherche NoSQL/REST/JSON taillé pour le cloud",
         "summary":"ElasticSearch : Moteur de recherche HTTP/REST/JSON, cloud, NoSQL, Scalable :\r\n- Un moteur ? Pour quoi faire ?\r\n- Elasticsearch : une solution simple, complète, performante\r\nDémo : et si on indexait Twitter ?\r\nOuvrons le capot :\r\n- Partitionnement\r\n- Réplication\r\n- Fail over",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "NoSQL",
            "JSON",
            "search",
            "cloud",
            "REST"
         ],
         "speakerIds":[
            1409
         ],
         "speakers":[
            {
               "speakerId":1409,
               "name":"David Pilato"
            }
         ]
      },
      {
         "sessionId":1473,
         "scheduleId":179808446,
         "title":"Fier d\u0027être développeur ?",
         "summary":"En 2012, quelle place occupe le développeur dans l\u0027entreprise ? Comment son rôle, sa capacité à innover et à agir peuvent-ils influencer l\u0027efficacité de celle-ci ? Du rôle de spectacteur au rôle d\u0027acteur, que pouvons-nous faire chacun, au quotidien, pour que le métier de Développeur soit perçu comme une richesse à cultiver plus que comme un coût à diminuer ?",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "agile"
         ],
         "speakerIds":[
            1734
         ],
         "speakers":[
            {
               "speakerId":1734,
               "name":"Pierre Pezziardi"
            }
         ]
      },
      {
         "sessionId":1126,
         "scheduleId":50840673,
         "title":"FluentLenium, une autre facon de faire du Selenium",
         "summary":"Selenium trop lourd ? Trop verbeux ? FluentLenium, construit sur Selenium Web Driver, se veut un outil de test d\u0027acceptance plus facile et plus fluent. Il se base sur le pouvoir des selecteurs CSS pour dynamiser l\u0027écriture des tests.\r\nInspiré d\u0027outils tel Geb (Groovy), Capybara (Ruby), c\u0027est une solution innovante proposant plusieurs API notamment la gestion des appels asynchrones, le filtrage des élements, la manipulation des formulaires ...\r\nIl est actuellement en test pour être intégré à Play2.0 .",
         "type":"Quickie",
         "theme":"Java, Java EE et Architectures",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "web20",
            "Selenium"
         ],
         "speakerIds":[
            1393
         ],
         "speakers":[
            {
               "speakerId":1393,
               "name":"Mathilde Lemee"
            }
         ]
      },
      {
         "sessionId":1011,
         "scheduleId":-1311205333,
         "title":"Google App Engine: la complexité inversement proportionnelle a la scalabilité",
         "summary":"Google App Engine: Un serveur d\u0027applications Java...\r\n\r\n- Types d\u0027applications typiques\r\n- Outils: Eclipse, NetBeans, IntelliJ\r\n- Framework: NOSQL, MySQL, JPA2.0, Hibernate, JAX-RS, Beans Validation, Play, Strut, Spring\r\n- Console D\u0027administration: \r\n- Google APIs: MapReduce, Datastore, memcache, mail, XMPP, users, ....\r\n- Open source alternative: AppScale\r\nTBD (plus tard)",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":13,
         "experience":"SENIOR",
         "sponsored":true,
         "tags":[
            "web20",
            "PAAS",
            "javaee",
            "cloud"
         ],
         "speakerIds":[
            195,
            1534
         ],
         "speakers":[
            {
               "speakerId":195,
               "name":"Ludovic Champenois"
            },
            {
               "speakerId":1534,
               "name":"Didier Girard"
            }
         ]
      },
      {
         "sessionId":1087,
         "scheduleId":110965483,
         "title":"Google Web Toolkit à l\u0027épreuve du feu",
         "summary":"Cobra est le nom de code d\u0027une application totalement innovante destinée aux opérateurs téléphoniques de la société Arkadin. Déployée dans différentes régions du monde, Cobra constitue le lien entre les clients finaux utilisant les plateformes de conferencing et le support de la société. D\u0027un point de vue technique, Cobra s\u0027appuie sur HTML 5 et GWT 2 pour la partie Web, JEE 1.6 avec les EJB 3, JPA et JBoss 7 pour la partie serveur. Le tout connecté en mode Push (quasi temps réel) à une infrastructure audio résiliente exposée au travers d\u0027API .NET/COM. Cette session proposera une démo inédite de Cobra et abordera les nombreux défis techniques auxquels l\u0027équipe de développement a du répondre : Tenue en charge, gestion des tests fonctionnels avec Selenium, problématiques des composants graphiques complexes, support multi-navigateurs et fragmentation du code. Une session inédite qui vous fera découvrir toute la puissance du Framework Google Web Toolkit sur une application stratégique.",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":14,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "GWT"
         ],
         "speakerIds":[
            1513
         ],
         "speakers":[
            {
               "speakerId":1513,
               "name":"Sami Jaber"
            }
         ]
      },
      {
         "sessionId":1337,
         "scheduleId":205190307,
         "title":"GPGPU facile avec JavaCL, et trivial avec ScalaCL !",
         "summary":"Dans ce Tools in Action nous montrerons comment utiliser OpenCL pour exploiter la puissance des GPUs facilement depuis Java avec JavaCL, et en en ayant à peine conscience depuis Scala avec ScalaCL. En effet, là où le premier fournit une API orientée objet et des utilitaires autour d\u0027OpenCL, le second permet d\u0027exécuter du Scala directement sur les cartes graphiques, moyennant quelques limitations et coups de baguette magique à la compilation.\r\n* Apprenez à écrire un programme OpenCL en Java en respectant les meilleures pratiques\r\n* Découvrez comment ScalaCL convertit le Scala en OpenCL, et comment il rend le Scala plus rapide même sans OpenCL !",
         "type":"Tools in Action",
         "theme":"Java, Java EE et Architectures",
         "roomId":14,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "javase",
            "scala"
         ],
         "speakerIds":[
            1483
         ],
         "speakers":[
            {
               "speakerId":1483,
               "name":"Olivier Chafik"
            }
         ]
      },
      {
         "sessionId":1237,
         "scheduleId":-1311205333,
         "title":"Groovy 2.0 : quoi de neuf doc ?",
         "summary":"Après un aperçu des fonctionnalités clés de Groovy (support de JSON, intégration de GPars pour la concurrence, Domain-Specific Languages plus lisibles) plongeons dans les nouveautés de Groovy 2.0 !\r\n \r\nBeaucoup d\u0027utilisateurs de Groovy l\u0027utilisent comme un langage de script Java ou comme un \"meilleur Java\". Mais tous n\u0027ont pas besoin des librairies ou des capacités dynamiques. Dans le 1er cas Groovy devient modulaire avec des modules unitaires composables. Dans le 2nd cas Groovy 2 rajoute le \"static type checking\" pour vous assurer de la qualité du code et repérer les erreurs tôt à la compilation.\r\n \r\nD\u0027autre part tout le monde n\u0027a pas besoin des fonctionnalités dynamiques : Groovy 2 propose en plus la compilation statique qui génère du bytecode aussi rapide que Java et vous permet de protéger les sections critiques de votre application du \"monkey patching\". Toutefois les fonctionnalités dynamiques du langages deviennent plus performantes grâce au support d\u0027invoke dynamic du JDK 7.",
         "type":"Conference",
         "theme":"Languages alternatifs",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "groovy"
         ],
         "speakerIds":[
            6,
            1376
         ],
         "speakers":[
            {
               "speakerId":6,
               "name":"Guillaume Laforge"
            }
         ]
      },
      {
         "sessionId":1038,
         "scheduleId":118346504,
         "title":"Guide de survie en théorie des langages",
         "summary":"La théorie des langages, c\u0027est le bagage scientifique de base qui permet de s\u0027y retrouver parmi tous ces langages de programmation, anciens, existants et à venir. La plupart des concepts à comprendre sont soit mystifiés, soit mal compris, ce qui laisse la place à beaucoup d\u0027approximations et de fantaisies. Pourtant, il n\u0027y a vraiment rien de compliqué, et c\u0027est que je me propose de montrer dans cette présentation, où j\u0027explorerai les fonctionnalités des principaux langages tournant sur la JVM. Aucune connaissance préalable dans un des langages supportés par la JVM n\u0027est requis, juste un peu d\u0027expérience en programmation, et du bon sens.",
         "type":"University",
         "theme":"Languages alternatifs",
         "roomId":14,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Java7",
            "groovy",
            "Ceylon",
            "scala"
         ],
         "speakerIds":[
            1389
         ],
         "speakers":[
            {
               "speakerId":1389,
               "name":"Alexandre Bertails"
            }
         ]
      },
      {
         "sessionId":1095,
         "scheduleId":118346504,
         "title":"Hackergarten Paris",
         "summary":"Envie de voir l’autre coté du miroir ? Saisissez la chance de contribuer à des projets open-source. Ensemble nous allons, avec plusieurs commiters open-source pour nous accompagner, soumettre des patchs, des features ou d’autres contributions. Pendant ces 3 heures, tout le monde est le bienvenu ou la bienvenue, amenez juste votre portable et votre volonté !\r\n\r\nCet évènement est la déclinaison parisienne du hackergarten original créé par Hamlet D\u0027Harcy.",
         "type":"Hands-on Labs",
         "theme":"Java, Java EE et Architectures",
         "roomId":20,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "dojo"
         ],
         "speakerIds":[
            1431,
            1393
         ],
         "speakers":[
            {
               "speakerId":1431,
               "name":"Brice Dutheil"
            },
            {
               "speakerId":1393,
               "name":"Mathilde Lemee"
            }
         ]
      },
      {
         "sessionId":1323,
         "scheduleId":110965483,
         "title":"Hacking the Kinect",
         "summary":"Since the Kinect came out in late 2010, there has been a few fun and cool hacks done with it - from painting in 3D space to robot control. We\u0027ve built an interactive conference signage, which was built over 2 weeks of weekend \u0026 evening hacking. It demonstrates the various components that are used in building a non-contact interface which uses hand detection, tracking and gestures to allow the user to interact with the signage outside of conference rooms at Devoxx 2011 to find more information.\r\n\r\nThe barrier for entry to build such a may be perceived to be high, however we\u0027ll walk through our first hand experiences using a variety of frameworks that are free to use, and show the audience how they can get started building Kinect based user interfaces all on their own. We\u0027ll have Kinects with us for people to get playing with.\r\n\r\nBring your duck tape, as it\u0027s going to get messy!",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":15,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "javascript",
            "websockets",
            "polyglot",
            "HTML5"
         ],
         "speakerIds":[
            10
         ],
         "speakers":[
            {
               "speakerId":10,
               "name":"Dan Hardiker"
            }
         ]
      },
      {
         "sessionId":1124,
         "scheduleId":118346504,
         "title":"Hands on Cassandra",
         "summary":"Venez nous rejoindre avec votre ordinateur portable pour participer à la plus grande Cassandra Party jamais organisée en France.\r\nL’idée est de rassembler le plus grand nombre de participants pour créer un cluster Cassandra le plus grand possible.\r\nUne fois le réseau en place, nous jouerons avec le cluster, insérerons des données pendant que nous déconnecterons des noeuds, des data centers, les rebrancherons, etc...\r\nBref, la réussite de ce hands dépend fortement de vous.\r\nPour en profiter vraiment, il est préférable de connaitre les grands principes de Cassandra. Vous pouvez pour cela assister à l’université Cassandra le matin. \r\n\r\nOS \u0026 Cassandra:\r\n- Depuis http://www.datastax.com/download/community/versions téléchargez “DataStax Community Server” version 1.0.8 pour votre OS.\r\n- Assurez-vous d\u0027avoir un JDK 1.6 correctement configuré\r\n- Votre ordinateur portable avec une prise Ethernet RJ45\r\n- Un cable RJ45 de quelques mètres étiqueté aux 2 extrémités à votre prénom/nom.",
         "type":"Hands-on Labs",
         "theme":"Web, Mobile et le Cloud",
         "roomId":17,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Cassandra",
            "NoSQL"
         ],
         "speakerIds":[
            1380,
            1559,
            1578,
            1503
         ],
         "speakers":[
            {
               "speakerId":1380,
               "name":"Nicolas Romanetti"
            },
            {
               "speakerId":1578,
               "name":"Florent Ramière"
            }
         ]
      },
      {
         "sessionId":1006,
         "scheduleId":-1370341429,
         "title":"Hibernate OGM: JPA pour NoSQL",
         "summary":"PaaS, Cloud. Mais le vrai challenge c\u0027est comment et où stocker vos données. Dans du NoSQL ? Peut-on utiliser une API familière ?\r\n\r\nL\u0027objectif d\u0027Hibernate OGM est d\u0027explorer comment réutiliser Java Persistence et son API familière pour persister les entités dans une base NoSQL.\r\nIl offre une implémentation JPA (manipulation d\u0027objet et requêtes JP-QL) tout en stockant et requêtant les données d\u0027une grille clé/valeur (et d\u0027autres approches NoSQL dans un second temps). Cela inclus notamment de supporter des applications JPA existantes.\r\n\r\nDans cette présentation, nous allons:\r\n - faire un survol du monde (NoSQL) et voir en quoi une API comme JPA apporte un intérêt\r\n - voir comment Hibernate OGM stocke les entités et les associations dans la base clé/valeur et explorer les compromis fait\r\n - voir comment les requêtes JP-QL sont implémentés au dessus d\u0027une technologie qui ne supporte pas la notion de requête (clé/valeur) et quel niveau peut être couvert\r\n\r\nAttention: contient des démos qui tournent.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":13,
         "experience":"SENIOR",
         "sponsored":true,
         "tags":[
            "NoSQL",
            "Hibernate",
            "JPA"
         ],
         "speakerIds":[
            117
         ],
         "speakers":[
            {
               "speakerId":117,
               "name":"Emmanuel Bernard"
            }
         ]
      },
      {
         "sessionId":1249,
         "scheduleId":169055205,
         "title":"Il n\u0027y a pas de bon Modèle Métier",
         "summary":"On vous le répète : une application répond bien aux besoins de ses utilisateurs si elle reflète bien leur métier. Les approches du développement orientées Utilisateur sont d\u0027ailleurs faites pour ça : le DDD d\u0027Eric Evans comme le BDD de Dan North concentrent leurs efforts sur la modélisation du \"Coeur du Domaine\".\r\n\r\nEn pratique, comment faire un \"bon\" Modèle Métier ?\r\nTraditionnellement, on dit qu\u0027il faut représenter au mieux la réalité de ce métier : faire \"coller\" le code au plus près du monde réel pour garantir l\u0027adéquation au besoin.\r\n\r\nMalheureusement, cette approche naïve est mauvaise ! Pourquoi ? Parce qu\u0027un logiciel ne représente pas le monde réel, il informatise des services rendus.\r\nParce qu\u0027un Modèle de Domaine n\u0027est pas un Modèle du Métier, c\u0027est un modèle de conception répondant à des exigences de codage.\r\nEt je vous montrerai, à partir d\u0027exemples, pourquoi il ne doit pas être construit en observant le monde réel mais à partir des besoins de présentation ou de services.",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":true,
         "tags":[
            "analysis",
            "Design"
         ],
         "speakerIds":[
            1492
         ],
         "speakers":[
            {
               "speakerId":1492,
               "name":"Grégory Weinbach"
            }
         ]
      },
      {
         "sessionId":1043,
         "scheduleId":-7250816,
         "title":"import continuous.delivery.*;",
         "summary":"When you send a package through FedEx it goes through a tracked, automated process that makes sure that the package arrives promptly at the destination. The same should apply to every commit that you check into the trunk. Continuous delivery describes how this process can be made fully automated and transparent and we will show you how your commits can be “fedexed” to production on application servers like JBoss, Tomcat, Weblogic and others with the help from Jenkins and LiveRebel.\r\n\r\nIn this talk we will build a full clustered environment and a deployment pipeline so that commits into the trunk would update a live chat server while you keep on chatting.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":12,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "javaee"
         ],
         "speakerIds":[
            142
         ],
         "speakers":[
            {
               "speakerId":142,
               "name":"Jevgeni Kabanov"
            }
         ]
      },
      {
         "sessionId":1078,
         "scheduleId":-1253115611,
         "title":"Input/Output : 16 ans après",
         "summary":"La plupart des applications ont besoin de réaliser des entrées/sorties de données. Historiquement, celles-ci sont réalisées en utilisant les API IO (Java 1.0) et NIO (Java 1.4).\r\nJava 7 propose une nouvelle API, nommée NIO 2, facilitant les accès au système de fichiers et les accès asynchrones. Moderne, simple à utiliser, et extensible, NIO 2 doit faire partie de la boîte à outils des développeurs. \r\nCette session fait un tour d\u0027horizon de l\u0027API File System notamment la manipulation des chemins, les attributs et les permissions, le parcours des répertoires, les notifications, ...",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Java7",
            "nio"
         ],
         "speakerIds":[
            1461
         ],
         "speakers":[
            {
               "speakerId":1461,
               "name":"Jean-Michel Doudoux"
            }
         ]
      },
      {
         "sessionId":1093,
         "scheduleId":-601076355,
         "title":"Introduction à Cassandra",
         "summary":"Cassandra est un système distribué de gestion de données créé par FaceBook puis Open Sourcé en 2008.\r\nCette présentation introduit de manière pragmatique et pédagogique différents concepts avancés mis en oeuvre par Cassandra.\r\n\r\nLes thèmes suivants sont abordés:\r\n- Historique de Cassandra\r\n- Modèle de données de Cassandra et requêtage\r\n- Ecriture et réplication\r\n- Tuneable Consistency en lecture et écriture\r\n- Reprise sur erreur \u0026 Communication Peer to Peer inter-serveurs (Gossip)\r\n- Problématique de la suppression en environnement distribué\r\n- Réplication inter-datacenter",
         "type":"University",
         "theme":"Web, Mobile et le Cloud",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Cassandra",
            "NoSQL"
         ],
         "speakerIds":[
            1380
         ],
         "speakers":[
            {
               "speakerId":1380,
               "name":"Nicolas Romanetti"
            }
         ]
      },
      {
         "sessionId":991,
         "scheduleId":169055205,
         "title":"Introduction à Ceylon",
         "summary":"Ceylon est un nouveau langage de programmation lancé par Red Hat et Gavin King. Ses objectifs sont :\r\n\r\n- être facilement compréhensible par les développeurs Java et C#,\r\n- éliminer un peu de verbosité de Java tout en restant lisible par tous les programmeurs,\r\n- améliorer le typage fort de Java,\r\n- proposer une syntaxe déclarative dans le langage afin de ne plus avoir besoin d´XML et de supporter la descriptions d\u0027interfaces utilisateurs naturellement,\r\n- supporter et encourager un style de programmation plus fonctionnelle avec des objets immuables et des fonctions d´ordre supérieur,\r\n- proposer un bon support de méta-programmation, afin de faciliter l´écriture et utilisation de frameworks, et de\r\n- proposer un système de module intégré.\r\n\r\nAvant tous ces objectifs, Ceylon est conçu pour des vrais projets de la vie réelle et pour faciliter la vie des équipes de développement au quotidien.\r\n\r\nPendant cette session nous parlerons des buts de Ceylon, de ses fonctionnalités, puis sa communauté.",
         "type":"Conference",
         "theme":"Languages alternatifs",
         "roomId":16,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Ceylon",
            "JVM"
         ],
         "speakerIds":[
            762,
            117
         ],
         "speakers":[
            {
               "speakerId":762,
               "name":"Stephane Epardaud"
            },
            {
               "speakerId":117,
               "name":"Emmanuel Bernard"
            }
         ]
      },
      {
         "sessionId":1050,
         "scheduleId":51829387,
         "title":"Invokedynamic them all",
         "summary":"Ce talk s\u0027addresse à tous ceux qui veulent implanter leurs langages préférés sur la Machine Virtuelle Java (JVM)\r\net tous les curieux qui veulent savoir comment la JVM et/ou les languages dynamiques marchent.\r\n\r\nLe talk commence par un rappel de la façon dont marche la machine virtuelle Java,\r\n(profiling à l\u0027exécution, JIT, deoptimization, inlining cache, bi-morphic cache, Class Hierarchy Analysis, Escape analysis)\r\npuis aborde un certain nombre de problèmes spécifiques rencontrés par les developpeurs de languages dynamiques\r\n(appel de méthodes(duck typing), multi-dispatch, modification de metaclasses, surcharge des operateurs, gestion de l\u0027overflow).\r\nPour chacun des problèmes, j\u0027aborderais les solutions proposées par le JSR 292, avec un peu de code et beaucoup de dessins. \r\n\r\nL\u0027objectif visé est que le publique comprenne mieux la façon dont marche la JVM\r\net aussi qu\u0027optimiser un language dynamique ou du Java n\u0027est pas foncièrement différent.",
         "type":"Conference",
         "theme":"Languages alternatifs",
         "roomId":13,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "JavaSE7",
            "JavaSE8"
         ],
         "speakerIds":[
            1479
         ],
         "speakers":[
            {
               "speakerId":1479,
               "name":"Remi Forax"
            }
         ]
      },
      {
         "sessionId":1347,
         "scheduleId":81407200,
         "title":"Kanban pour les nuls !",
         "summary":"Kanban, mais oui tu sais, c’est le tableau de Post-it © au fond de la salle qui vous rappelle que vous êtes agiles !\r\n\r\nEt si on vous racontait le minimum vital des principes qui se cachent derrière ? \r\n\r\nOui, il y a bien une histoire visuelle derrière tout ça, mais pas uniquement. \r\nKanban est aussi une conduite du changement basée sur l\u0027amélioration continue de votre processus existant. \r\n\r\nLes clefs du management visuel:\r\n* Rendre visible l\u0027avancement, l\u0027objectif, les tendances !\r\n\r\nLe Flux: \r\n* Comprendre ce qu\u0027est un Flux \r\n* Flux de valeur, Flux tiré/poussé\r\n* Limiter le travail en cours: WIP\r\n\r\nRégler son processus:\r\n* Expliciter les règles et caractéristiques\r\n* Trouver la bonne cadence\r\n\r\nPour aller plus loin:\r\n* Théorie des contraintes, Files d\u0027attentes, ...\r\n* Kanban vs Scrum : complémentarité ou nouvelle option ?\r\n\r\nNous finirons en vous présentant quelques cas typiques d’applications de Kanban.",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":15,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "scrum",
            "agile",
            "Methodology"
         ],
         "speakerIds":[
            1428,
            1611
         ],
         "speakers":[
            {
               "speakerId":1428,
               "name":"Guillaume LOURS"
            },
            {
               "speakerId":1611,
               "name":"Dimitri Baeli"
            }
         ]
      },
      {
         "sessionId":1418,
         "scheduleId":-1371330143,
         "title":"L\u0027heure de la SSII coopérative a sonné",
         "summary":"Une coopérative, c\u0027est une entreprise qui appartient à ses salariés.\r\nUne SSII, c\u0027est souvent synonyme d\u0027exploitation du salarié.\r\nAlors, une SSII coopérative, ce serait quoi :\r\n - une contradiction ?\r\n - une fantaisie utopiste ?\r\n - comme toutes les autres ?\r\nJ\u0027aurai réussi ma présentation si vous sortez en vous disant que c\u0027est plutôt une idée qui tombe à point.",
         "type":"Quickie",
         "theme":"Entreprises et pratiques",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "collaboration"
         ],
         "speakerIds":[
            1703
         ],
         "speakers":[
            {
               "speakerId":1703,
               "name":"Andrew Spencer"
            }
         ]
      },
      {
         "sessionId":1432,
         "scheduleId":-601076355,
         "title":"Le président est...",
         "summary":"Vous venez de gagner un contrat. Il s\u0027agit de développer le site web qui va annoncer au soir du 6 mai 2012 le nouveau président de la République Française.\r\nLe site devra pouvoir accueillir un traffic potentiel maximum de 50 millions d\u0027utilisateurs le 6 mai. Ce jour là, un pic à 2 millions d\u0027utilisateurs simultanés est attendu a 20h. Ensuite, le 7 mai 1 millions d\u0027utilisateurs viendront et les jours suivants quelques milliers d\u0027utilisateurs au grand maximum. Le site devra proposer des fonctions de type social : vote de satisfaction, commentaires, publications d\u0027images,...\r\nIl ne doit pas faire défaut, il n\u0027est pas concevable qu\u0027il tombe a l\u0027heure H. Pour ceci vous disposer d\u0027une plateforme, AppEngine et de trois experts pour vous guider.\r\nLe défit est à relever en 4 heures seulement. \r\n\r\nMots Clés : PaaS, NoSQL, BigTable, FullText Search, Java",
         "type":"Hands-on Labs",
         "theme":"Web, Mobile et le Cloud",
         "roomId":17,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "NoSQL",
            "PAAS",
            "javaee",
            "cloud"
         ],
         "speakerIds":[
            1534,
            195,
            1622
         ],
         "speakers":[
            {
               "speakerId":1534,
               "name":"Didier Girard"
            },
            {
               "speakerId":195,
               "name":"Ludovic Champenois"
            }
         ]
      },
      {
         "sessionId":1261,
         "scheduleId":-601076355,
         "title":"Les 3 A pour Java EE 6",
         "summary":"Cet atelier propose une prise en main de Java EE 6 au travers d’un récapitulatif de ses principales nouveautés et améliorations. Les participants vont développer une application pas à pas, en partant de zéro, en trois exercices centrés sur JSF 2.0, JAX-RS 1.1 et CDI 1.0 ; d’autres technologies comme JPA 2.0, Servlet 3.0 et EJB 3.1 seront aussi abordées. \r\n\r\nGrâce à l’arrivée de nouvelles implémentations et de nouveaux outils en 2011, cet atelier vous offre l’opportunité de vous mettre à niveau sur la dernière version de Java EE et sur la mise en oeuvre d\u0027outillages liés à Java EE comme Arquillian. Il a été suivi par les participants de plusieurs conférences internationales, comme JavaOne, Devoxx, JFall et d’autres encore. Le contenu a été créé initialement par Alexis Moussine-Pouchkine et Antonio Goncalves et est continuellement amélioré sur http://beginningee6.kenai.com.",
         "type":"Hands-on Labs",
         "theme":"Java, Java EE et Architectures",
         "roomId":19,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "CDI",
            "EJB31",
            "Servlet3",
            "JAX-RS",
            "JSF2",
            "javaee6",
            "JPA2"
         ],
         "speakerIds":[
            447,
            1738,
            618
         ],
         "speakers":[
            {
               "speakerId":447,
               "name":"Alexis Hassler"
            },
            {
               "speakerId":618,
               "name":"Antoine Sabot-Durand"
            }
         ]
      },
      {
         "sessionId":1314,
         "scheduleId":-601076355,
         "title":"Les 5 mercenaires du DevOps",
         "summary":"Un exemple pratique d\u0027expérience DevOps avec une équipe pluris disciplinaires autour d\u0027un projet de déploiement continu :\r\n\r\n- 2 Développeurs Java\r\n- 1 QA\r\n- 1 Ops\r\n- 1 Organisateur agile\r\n\r\nDe l\u0027application Web Java au déploiement continu en pre-production, comment s\u0027organiser pour mettre tout cela en musique.",
         "type":"University",
         "theme":"Entreprises et pratiques",
         "roomId":14,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "DevOps",
            "agile"
         ],
         "speakerIds":[
            1463,
            647,
            622,
            1611,
            1472
         ],
         "speakers":[
            {
               "speakerId":1463,
               "name":"Henri Gomez"
            },
            {
               "speakerId":1611,
               "name":"Dimitri Baeli"
            },
            {
               "speakerId":1472,
               "name":"Gildas Cuisinier"
            }
         ]
      },
      {
         "sessionId":1085,
         "scheduleId":21385868,
         "title":"Localize your apps",
         "summary":"Vous bossez sur un projet international et vous en avez marre de batailler auprès des traducteurs qui vous envoient vos fichiers de ressources par email. \r\nMarre de devoir savoir quelle est la bonne version, de remettre le bon encodage ou de reformater le fichier qui ne correspond plus à rien. \r\nEt si vous ajoutiez un contexte à vos traductions ? Des commentaires, des captures d\u0027écran par exemple. Si vous respectiez enfin un processus de relecture et de validation. Et si vous pouviez carrément le faire de façon transparente en récupérant le boulot terminé via votre outil de build préféré ?\r\nAllez, je vous propose en 15 minutes chrono de vous présenter Nemrod pour vous aider à bosser tous ensemble de façon vraiment collaborative.",
         "type":"Quickie",
         "theme":"Entreprises et pratiques",
         "roomId":14,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Play",
            "Maven",
            "REST"
         ],
         "speakerIds":[
            1425
         ],
         "speakers":[
            {
               "speakerId":1425,
               "name":"Hugo Lassiège"
            }
         ]
      },
      {
         "sessionId":1233,
         "scheduleId":-7250816,
         "title":"Manipulation de bytecode : démocratisons la magie noire",
         "summary":"Java ne se limite pas au langage éponyme : sa machine virtuelle est capable d\u0027exécuter du bytecode produit par un très large panel de langages. Peu d\u0027entre nous ont eu de bonnes raisons d\u0027avoir à comprendre, générer ou transformer du bytecode Java. Il serait pourtant réducteur de limiter cette activité à une magie noire réservée aux créateurs de langages et de frameworks évolués. À titre d\u0027exemple, la manipulation de bytecode est une des clés de voute de la simplification des modèles de programmation pour les plates-formes répandues que sont Java EE, Play! ou Spring.\r\n\r\nCette session s\u0027adresse à un public de tous niveaux et a pour but non seulement de démystifier le bytecode Java, mais aussi de montrer en quoi cela peut être utile dans des cadres applicatifs plus classiques.\r\n\r\n* Bases du bytecode Java et de la JVM\r\n* Manipulation et applications avec :\r\n * ASM\r\n * AspectJ\r\n * JBoss Byteman\r\n* Java 7 et invokedynamic\r\n* JooFlux : projet de recherche dévoilé à DevoxxFR !",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":14,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Java7",
            "javase",
            "openjdk",
            "JVM"
         ],
         "speakerIds":[
            381,
            1487
         ],
         "speakers":[
            {
               "speakerId":381,
               "name":"Julien Ponge"
            }
         ]
      },
      {
         "sessionId":1246,
         "scheduleId":-1340763616,
         "title":"MongoDB et Mustache. Vers la mort du cache ?",
         "summary":"Fotopedia est une plateforme web et webservice à fort traffic, qui reçoit plus de 5 millions de visites par mois. Venez découvrir les stratégies mises en place par nos équipes pour palier aux soucis en production. \r\n\r\nL\u0027application principale de Fotopedia est un Ruby on Rails vieux de 6 ans. À cause de ses lenteurs intrinsèques, nous avons été amené à mettre en place des stratégies de cache élaborées pour que le comportement soit acceptable. Ceci nous a conduit à une stack utilisant du cache de fragment \"edge-side\", et des boucles d\u0027invalidation complexes pour garantir la fraîcheur du contenu, qui reste encore perfectible. \r\n\r\nMongoDB, couplé à un micro langage de template (mustache), nous permet aujourd\u0027hui d\u0027explorer une autre approche éliminant totalement le cache pour les données les plus dynamiques de l\u0027application. \r\n\r\nMots clés : Performance, MongoDB, Varnish, Cache, Mustache",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":13,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "sql",
            "NoSQL",
            "MongoDB",
            "DevOps"
         ],
         "speakerIds":[
            1631,
            1632
         ],
         "speakers":[
            {
               "speakerId":1631,
               "name":"Mathieu Poumeyrol"
            }
         ]
      },
      {
         "sessionId":1226,
         "scheduleId":50840673,
         "title":"Musée des horreurs du FBI (Fausse Bonne Idée)",
         "summary":"Ce quickies vise à mettre l\u0027accent sur le besoin d\u0027accompagnement et de prise de recul sur les projets.\r\n\r\nEn prenant pour exemple les idées incongrues rencontrées au fil de douze ans d\u0027expérience, je montre que l\u0027accompagnement des équipes de dev par un \"sénior\", un expert technique, est indispensable et surtout dans des contextes non agiles.\r\nEn effet, l\u0027application de procédures mal comprises ou mal adaptées au contexte du projet peut engendrer des monstres ou des échecs.\r\n\r\nCe quickie se veut sur un ton d\u0027humour et évoquera :\r\n- les problèmes de compilation pour classes/ servlet trop grosses\r\n- les problèmes de plantages de serveurs d\u0027application (permgen trop gros, trop de logs générés, ...)\r\n- les problématiques de performances (applie web consommant 140Go de RAM/h)\r\n- l\u0027échec de la POO à cause d\u0027un problème de conception\r\n- la mise en production de tout un attirail décisionnel (datawarehouse, datamart, univers BO) pour faire l\u0027 impression d\u0027un formulaire",
         "type":"Quickie",
         "theme":"Entreprises et pratiques",
         "roomId":14,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "patterns",
            "performance",
            "javaee"
         ],
         "speakerIds":[
            1621
         ],
         "speakers":[
            {
               "speakerId":1621,
               "name":"emmanuel feller"
            }
         ]
      },
      {
         "sessionId":1291,
         "scheduleId":51829387,
         "title":"NodeJS and JavaScript Everywhere",
         "summary":"JavaScript has a long history of tight ties to the Web browser. In recent years, competition between open-source JavaScript interpreters has resulted in impressive and ongoing performance gains, outpacing those of other similar dynamic languages such as Ruby or Python.\r\n\r\nWith the mainstreaming of server-side JavaScript via NodeJS, the promise of JavaScript as a general-purpose programming language is coming to fruition. Writing once, and running the same code both client- and server-side seems like an obvious big win, along with the ease of writing complex server-side applications in a simple, flexible, familiar language like JavaScript. Actually, full-stack JS development is can be hugely advantageous, but these aren\u0027t necessarily the reasons why.\r\n\r\nThis talk will bust some of the myths about full-stack JS development -- focusing primarily on NodeJS, and lessons learned from the numerous JavaScript projects at Yammer, to take a realistic look at the practical benefits of \u0027JS everywhere.\u0027",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "javascript"
         ],
         "speakerIds":[
            1664
         ],
         "speakers":[
            {
               "speakerId":1664,
               "name":"Matthew Eernisse"
            }
         ]
      },
      {
         "sessionId":1039,
         "scheduleId":51829387,
         "title":"Nouveau look pour une nouvelle vie: Spring, JQuery et HTML5",
         "summary":"Vous trouvez votre application trop grosse? Vous aimeriez tellement en changer pour une moins lourde, et qui vous fasse à nouveau rêver...\r\n\r\nUne application qui ferait des choses que l’ancienne ne faisait pas:\r\n- Du HTML5\r\n- De la mobilité, en fonctionnant sur Android, iOS...\r\n\r\nFaut-il pour autant apprendre un nouveau framework, laisser tomber Java EE, voire même laisser tomber Java?\r\n\r\nEn réalité, votre application a juste besoin d’un petit relooking, et elle paraîtra 1 an de moins! (en informatique, 1 an correspond à 10 ans dans la vie réelle).\r\n\r\nNous verrons dans cette conférence:\r\n- Comment réaliser une architecture REST avec Spring MVC 3.1\r\n- Comment “plugger” JQuery sur une architecture REST\r\n- Une étude des nouveautés proposées par HTML5 pour enrichir notre site Web basé sur JQuery\r\n- L’utilisation de JQuery Mobile pour gérer le contenu spécifique “mobile”: Android, iPad, iPhone...\r\n- Comment répondre aux contraintes de performance particulières que ces nouvelles architectures nous imposent",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "jQuery",
            "HTML5",
            "spring",
            "mobile"
         ],
         "speakerIds":[
            1401
         ],
         "speakers":[
            {
               "speakerId":1401,
               "name":"Julien Dubois"
            }
         ]
      },
      {
         "sessionId":1244,
         "scheduleId":-1311205333,
         "title":"Obésiciel et impact environnemental : Green Patterns appliqués à Java",
         "summary":"La fabrication d’un ordinateur émet 70 à 100 fois plus de CO2 qu’un an d’utilisation. Au-delà d’une durée de garantie trop courte, la couche logicielle est le principal facteur d’obsolescence des équipements informatiques. En effet, la puissance nécessaire pour exécuter un logiciel double d’une version sur l’autre. Si bien qu’en 25 ans, la durée moyenne d’utilisation d’un ordinateur a été divisée par 3. Réduire les besoins en ressources matérielles des logiciels est incontournable pour réduire leur consommation électrique et allonger la durée de vie active des équipements informatiques.\r\n\r\nL\u0027éco-conception des logiciels est une étape qui devient de plus en plus nécessaires. Les Green patterns permettent aux développeurs d\u0027appliquer des bonnes pratiques pour éviter une explosion des besoins et diminuer la dette environnementale et technique. Overhead des données, optimisation JVM... les leviers sont nombreux pour rendre le logiciel plus respectueux de l\u0027environnement !",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":16,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "patterns"
         ],
         "speakerIds":[
            1629
         ],
         "speakers":[
            {
               "speakerId":1629,
               "name":"Olivier Philippot"
            }
         ]
      },
      {
         "sessionId":1003,
         "scheduleId":-1311205333,
         "title":"Optimiser votre site Web sur mobile",
         "summary":"Un site Web ne s\u0027adapte pas pour le mobile ! Un site Web sur desktop et ce même site sur mobile seront diamétralement opposés : expérience utilisateur, format du contenu proposé... En effet, combien de fois êtes-vous tombé sur des sites absolument illisibles en surfant sur votre mobile ? C\u0027est sûr, une migration pour rendre votre site compatible mobile risque d\u0027être trop coûteuse et la solution de facilité serait simplement d\u0027appliquer une autre feuille de style...\r\n\r\nNous allons voir dans cette présentation que cela va bien plus loin et que pour donner une réelle expérience utilisateur mobile, votre site doit être complètement repensé (données, utilisabilité, rapidité...) !\r\n\r\nNous regarderons ensemble l\u0027évolution de ce marché mobile, les normes existantes, les bonnes pratiques de développement mobile ainsi que les outils et frameworks qui vous permettront de sublimer votre site web pour smartphone.",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":14,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "web20",
            "javascript",
            "performance",
            "HTML5",
            "mobile"
         ],
         "speakerIds":[
            1415
         ],
         "speakers":[
            {
               "speakerId":1415,
               "name":"Romain MATON"
            }
         ]
      },
      {
         "sessionId":1329,
         "scheduleId":-1253115611,
         "title":"Pimp My Legacy",
         "summary":"Sur certains projets, on peut se demander s\u0027il y a encore vraiment un pilote pour sauver l\u0027application. \r\nPeut-être est-ce lié au vieillissement de nos applications de gestion désormais considérées comme \"Legacy\" ?\r\nNous vous présenterons les recettes que nous avons pu mettre en oeuvre de manière pragmatique pour améliorer progressivement la qualité des applications tout en ajoutant des fonctionnalités.\r\nIl n\u0027y aura pas de \"Bullshit\", pas de \"FOA\" (Fashion Oriented Architecture) : seulement des exemples de bon sens éprouvés sur de nombreux projets.\r\n\r\n---------------------------------------------------------------\r\nLes points abordés seront les suivants :\r\n- bonne normalisation de la base de données,\r\n- notions d\u0027architecture,\r\n- utilisation de frameworks tels que Spring, Guava, …\r\n- maîtrise du build,\r\n- dette technique,...",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "patterns",
            "performance",
            "javaee"
         ],
         "speakerIds":[
            1615
         ],
         "speakers":[
            {
               "speakerId":1615,
               "name":"François Ostyn"
            }
         ]
      },
      {
         "sessionId":1254,
         "scheduleId":-7250816,
         "title":"Play 2.0, un framework pour une nouvelle génération d\u0027application Web",
         "summary":"Play framework a révolutionné le développement d\u0027application Web en Java en apportant simplicité et agilité et en rompant avec les pratiques dites entreprise. Cependant le Web entre dans une nouvelle ère, basée sur des flux d\u0027information temps réels et des volumes de données gigantesques que les frameworks actuels peinent à traiter. Une nouvelle génération de framework est nécessaire pour exploiter pleinement cette richesse. Dans cette présentation, nous allons présenter Play 2.0 un framework d\u0027application Web pour Java et Scala, son modèle complètement non bloquant (réactif) avec une maitrise totale de la consommation des ressources (mémoire, CPU), son extensibilité, et son architecture sans état permettant de très forte montée en charge.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":16,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "websockets",
            "JVM",
            "scala",
            "PlayFramework"
         ],
         "speakerIds":[
            1640,
            1292
         ],
         "speakers":[
            {
               "speakerId":1640,
               "name":"Guillaume Bort"
            },
            {
               "speakerId":1292,
               "name":"Sadek Drobi"
            }
         ]
      },
      {
         "sessionId":1471,
         "scheduleId":-1242362370,
         "title":"Portrait du developeur en \"The Artist\"",
         "summary":"Une présentation parlante, en Français et en couleur, dans des décors Californiens, sur la transformation du métier de développeur à l\u0027heure du mobile, des navigateurs HTML5 et des plate formes en nuage.\r\n\r\nGeorge Valentin , le personnage du film The Artist est un acteur des années 20, confronté à une transition technologique brutale, du cinéma muet au parlant, qui l\u0027oblige à adapter son art ou perdre son travail. C\u0027est une comédie, ça se finit bien.\r\n\r\nMobile, HTML5 et cloud sont trois transitions technologiques qui ont atteint leur masse critique depuis 2 ans et vont changer profondément le métier de développeur.\r\n\r\nD\u0027où venons nous? Où sommes nous? Où allons nous? Evolution en cours et tendances futures, pistes a explorer pour s\u0027adapter au changement technologique actuel: choses à apprendre et à oublier, habitudes à créer et perdre, opportunités à saisir.\r\n\r\nVenez écrire votre histoire de développeur, pour qu\u0027elle finisse bien, comme toutes les bonnes comédies Américaines filmées par des Français.",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":12,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "cloud",
            "HTML5",
            "mobile",
            "web3"
         ],
         "speakerIds":[
            870
         ],
         "speakers":[
            {
               "speakerId":870,
               "name":"Patrick Chanezon"
            }
         ]
      },
      {
         "sessionId":1330,
         "scheduleId":199531243,
         "title":"Pour un développement durable",
         "summary":"\"Mon logiciel n\u0027a que 3 ans et il est bon pour la casse. Je n\u0027arrive plus à le maintenir, la moindre évolution me coûte cher, de plus en plus cher. Pourtant on en a fait des fonctionnalités, ça délivrait à l\u0027époque, par dizaines...\" -- Mr X, qui souhaite garder l\u0027anonymat.\r\n\r\nQu\u0027est-ce que la productivité ? Comment l\u0027améliorer, la faire durer au fil des mois et des années ?\r\n\r\nA partir de cas d\u0027utilisation, j\u0027aborderai différents aspects de la productivité et des éléments indispensables pour répondre au fameux Time to market, aujourd\u0027hui, demain, dans 5 ans. Je m\u0027attacherai à faire tomber les idées reçues qui ont la vie dure. La qualité coûte-t-elle cher ? Nous verrons que qualité et productivité sont intimement liées, mais pas comme nous avons l\u0027habitude de l\u0027entendre.\r\n\r\nJe m\u0027efforcerai d\u0027apporter un regard réaliste et pragmatique sur le développement logiciel en 2012 en m\u0027attardant sur les pratiques qui, de mon point de vue, permettent de répondre le mieux au trio investissement/productivité/durabilité.",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":14,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "scrum",
            "agile",
            "TDD",
            "Methodology"
         ],
         "speakerIds":[
            1670
         ],
         "speakers":[
            {
               "speakerId":1670,
               "name":"Frédéric Dubois"
            }
         ]
      },
      {
         "sessionId":1377,
         "scheduleId":110965483,
         "title":"Pour une fois soyons physique! Une introduction à Arduino.",
         "summary":"A la base, Arduino est une plateforme open-source de prototypage électronique. Du fait de sa simplicité et de son ouverture, le projet Arduino est devenu en quelques années le plus populaire dans ce domaine.\r\n\r\nVia l’utilisation d’Arduino, il est notamment possible de détecter des événements se produisant dans un environnement physique afin d\u0027interagir sur celui-ci.\r\n\r\nCette présentation introduit la plateforme Arduino et comment l’intégrer avec la plateforme Java. Elle est illustrée de nombreux exemples de codes (live) ainsi que des demos.\r\n\r\nNul besoin d’avoir des connaissance en électronique, cette session est en effet ouverte à toute personne voulant, juste avec ses connaissances Java et un peu de curiosité étendre ses applications Java afin qu’elles puissent interagir, de manière physique, avec l’environnement.",
         "type":"Conference",
         "theme":"Languages alternatifs",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "JavaPosse"
         ],
         "speakerIds":[
            184
         ],
         "speakers":[
            {
               "speakerId":184,
               "name":"David Delabassee"
            }
         ]
      },
      {
         "sessionId":1171,
         "scheduleId":205190307,
         "title":"Pratiquer DDD en un éclair",
         "summary":"Pour une immersion instantanée dans le monde DDD, je vous propose de vous équiper d\u0027un outil assez spectaculaire, Sculptor. Il s\u0027agit d\u0027un outil open source, qui permet le développement d\u0027application fortement orienté DDD via un DSL aussi simple qu\u0027efficace. Ainsi, nous coderons en TDD ensemble, au travers d\u0027un plugin Eclipse, la représentation DDD d\u0027une application web simple basée sur REST, Spring et MongoDB, avec une pincée de Maven et GIT pour démontrer qu\u0027il ne s\u0027agit pas d\u0027une technologie isolante et isolée.\r\n\r\nPointeur : https://sites.google.com/site/fornaxsculptor/",
         "type":"Tools in Action",
         "theme":"Java, Java EE et Architectures",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "javase",
            "Tools",
            "Design"
         ],
         "speakerIds":[
            1587
         ],
         "speakers":[
            {
               "speakerId":1587,
               "name":"Ulrich Vachon"
            }
         ]
      },
      {
         "sessionId":1275,
         "scheduleId":-601076355,
         "title":"Programatoo: Atelier de programmation pour les jeunes de 9 à 14 ans",
         "summary":"Pour vous inscrire, envoyez un mail à programatoo@sfeir.com en précisant l’âge de l’enfant et le nom du parent accompagnateur.\r\n\r\nEnfants de 9 à 14 ans, 10 enfants maximum, chacun amène son ordinateur.\r\n\r\nProgramatoo est un atelier pratique pour parents et jeunes enfants. Il permettra aux enfants de toucher du doigt le métier de leurs parents, de manière ludique. Ce n\u0027est pas un cours, mais un atelier où les enfants pourront jouer ensemble. \r\nDans le cadre de Devoxx France, c\u0027est une session qui nous fait nous poser la question : finalement, qu\u0027avons-nous à transmettre ? Elle se veut innovante et décalée.",
         "type":"Hands-on Labs",
         "theme":"Entreprises et pratiques",
         "roomId":20,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "collaboration"
         ],
         "speakerIds":[
            1652,
            1654
         ],
         "speakers":[
            {
               "speakerId":1652,
               "name":"Aline Paponaud"
            },
            {
               "speakerId":1654,
               "name":"Audrey Neveu"
            }
         ]
      },
      {
         "sessionId":1104,
         "scheduleId":81407200,
         "title":"Programmation concurrente en Java dans la pratique",
         "summary":"Java 7 est livré avec une multitude de nouveaux utilitaires pour la programmation concurrente, sous l\u0027égide de JSR-166, mais cette présentation n\u0027est pas à leur sujet. Cela fait maintenant plus de 7 ans que les primitifs de programmation concurrente de Java 5 ont été introduits. Pourtant, l\u0027adage répété que la programmation concurrente est «dur», «trop-fantaisiste» ou doit être «cachée à l\u0027intérieur d\u0027autres outils» a abouti à une criminelle sous-utilisation de beaucoup de ces classes originelles de java.util.concurrent\r\n\r\nEn fournissant un ensemble d\u0027exemples du monde réel (Ehcache, Hibernate, Quartz, ... ) cette session a pour but de soulever une partie du voile de mystère recouvrant ces primitifs et de vous aider à les introduire dans votre code.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":14,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "multicore",
            "javase"
         ],
         "speakerIds":[
            403
         ],
         "speakers":[
            {
               "speakerId":403,
               "name":"Alex Snaps"
            }
         ]
      },
      {
         "sessionId":1065,
         "scheduleId":263254888,
         "title":"Réaliser des tests de charges avec Gatling",
         "summary":"Gatling est un outil de stress d\u0027applications web nouvelle génération développé en Scala et guidé par les principes suivants :\r\n* en finir avec le modèle 1 user \u003d 1 thread non scalable, grâce à des acteurs Akka\r\n* pour les mêmes raisons de scalabilité, utiliser des IO non bloquantes, grâce à Netty\r\n* disposer de scripts clairs et évolutifs, grâce à une API fonctionnelle et un DSL\r\n* être gratuit, et autant que possible open-source\r\n\r\nLe projet est hébergé sous Github :\r\nhttps://github.com/excilys/gatling",
         "type":"Tools in Action",
         "theme":"Entreprises et pratiques",
         "roomId":15,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "scalable",
            "actors",
            "Akka",
            "scala"
         ],
         "speakerIds":[
            1440,
            1716
         ],
         "speakers":[
            {
               "speakerId":1440,
               "name":"Stéphane Landelle"
            }
         ]
      },
      {
         "sessionId":1074,
         "scheduleId":-1340763616,
         "title":"Recherche d’information (RI) : Fondements et illustration avec Apache Lucene",
         "summary":"La filière recherche d’information est devenue le socle sur lequel reposent les principaux moyens d’accès à l’information.  Il est très courant pour les applications Web d’intégrer des interfaces de recherche textuelle. Nous nous intéressons aux éléments scientifiques qui constituent le fondement de la recherche d’information. Nous passons en revue les principales techniques sur lesquelles se basent la majorité des moteurs de recherche: les modèles booléens, vectoriels et probabilistes. Nous présentons quelques algorithmes de construction d’index inversés et de calcul du niveau de pertinence des documents. Nous illustrons ces concepts par la mise en place d’un système de recherche d’information basé sur la librairie Lucene. Nous montrons que Lucene  combine les modèles Booléens et vectoriels. Nous présentons son schéma d’indexation. Nous élaborons sur son algorithme de calcul de score. Finalement, nous vous faisons une démonstration de Lucene à travers une application web de recherche textuelle",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":14,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "search",
            "javaee",
            "apache"
         ],
         "speakerIds":[
            1500
         ],
         "speakers":[
            {
               "speakerId":1500,
               "name":"Majirus Fansi"
            }
         ]
      },
      {
         "sessionId":1092,
         "scheduleId":205190307,
         "title":"Réduire la pression sur l\u0027allocation mémoire : le prochain pas dans l\u0027optimisation des performances de la JVM",
         "summary":"La mémoire vive devenant de moins en moins chère, la taille de la RAM des serveurs de production a explosé. Combinées avec les architectures SOA, les applications d\u0027aujourd\u0027hui utilisent intensivement les caches locaux, résidant en RAM. Mais allouer autant de mémoire sur le tas comporte une contre-partie notable : le travail du ramasse-miette, ou GC ! En effet le temps pris par le GC pour restituer la mémoire détermine le temps durant lequel une application ne répond pas. Une \"nouvelle\" tendance est en train de voir le jour : utiliser des segments de mémoire non managés par le GC, appelés mémoire hors-tas (off-heap memory). Les projets BigMemory, Hadoop, Cassandra ou Lucene ont adopté cette approche. La fondation Apache a vu naître dans son incubateur un projet qui implémente cette technologie : DirectMemory. DirectMemory est une implémentation de cache multi couches, incluant l\u0027allocation hors-tas permettant de mettre en cache des objets Java tout en réduisant significativement le travail du ramasse-miette.",
         "type":"Tools in Action",
         "theme":"Java, Java EE et Architectures",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "performance",
            "caching"
         ],
         "speakerIds":[
            1512,
            1385
         ],
         "speakers":[
            {
               "speakerId":1512,
               "name":"Benoit Perroud"
            }
         ]
      },
      {
         "sessionId":1362,
         "scheduleId":50840673,
         "title":"Sexy le développpement web mobile ?",
         "summary":"Une présence sur le mobile est aujourd\u0027hui un must pour la plupart de nos clients.\r\n\r\nPour adresser 95% du marché, l\u0027alternative est simple : trouver des compétences pour développer sur les plate-formes majeures (iOS, Android, RIM) ou développer pour le web mobile.\r\n\r\nLe choix est déchirant : bénéficier de la vitrine qu\u0027est la \"marketplace\" ou déployer sans contrainte ; proposer une expérience utilisateur \"sans couture\" ou une homogénéité \"cross platforms\" plus banale ; développer des compétences spécifiques ou se reposer sur la rassurante pérennité du web.\r\n\r\nCes choix sont le quotidien de tous les architectes qui mettent le nez dans le mobile.\r\n\r\nJe pratique \"en vrai\" HTML5, jQuery, PhoneGap et d\u0027autres technos. Et j\u0027aimerais vous en convaincre : le web mobile n\u0027est pas nécessairement un renoncement !\r\n\r\nJe vous propose de partager mes multiples expériences et d\u0027approcher ce que le futur nous promet.",
         "type":"Quickie",
         "theme":"Web, Mobile et le Cloud",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "jQuery",
            "HTML5",
            "mobile"
         ],
         "speakerIds":[
            1693
         ],
         "speakers":[
            {
               "speakerId":1693,
               "name":"Julien Roche"
            }
         ]
      },
      {
         "sessionId":1088,
         "scheduleId":233763720,
         "title":"Simplifiez vos développements Android avec AndroidAnnotations !",
         "summary":"Le code de vos applications Android est-il facile à écrire, à relire et à maintenir ?\r\n\r\nAndroidAnnotations est un framework Open Source visant à simplifier et industrialiser les développements Android, sans impacter les performances. Il utilise l\u0027API d\u0027Annotation Processing de Java 6 pour générer à la compilation le code d\u0027infrastructure de vos applications Android, pour permettre au développeur de se concentrer sur le code métier.\r\n\r\nAprès une introduction présentant les concepts clés, nous coderons en live une application Android afin de mettre en avant les avantages à utiliser AndroidAnnotations.\r\n\r\nhttps://github.com/excilys/androidannotations",
         "type":"Tools in Action",
         "theme":"Web, Mobile et le Cloud",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "android",
            "annotations"
         ],
         "speakerIds":[
            1514,
            1572
         ],
         "speakers":[
            {
               "speakerId":1514,
               "name":"Pierre-Yves Ricau"
            }
         ]
      },
      {
         "sessionId":1045,
         "scheduleId":-7250816,
         "title":"Spring est mort, longue vie à Spring !",
         "summary":"Avec l\u0027arrivée de JEE6 et CDI, à l\u0027heure de la suprématie des annotations face au XML, d\u0027infâmes diffamateurs répandent des rumeurs pour faire croire que Spring Framework est mort et enterré, ou le sera bientôt ! \r\nMais Spring Framework revient avec une nouvelle version, et vient combattre les préjugés : du Spring Framework, mais sans une dose de XML !\r\n\r\nIl a également acquis de nouveaux pouvoirs  :\r\n- Invisibilité, car Spring 3.1 sait se \"cacher\"\r\n- Mimétisme, car Spring 3.1 sait d\u0027adapter à son environnement, qu\u0027il soit local ou dans les nuages.\r\n\r\nAlors n\u0027hésitez plus, venez découvrir la puissance du nouveau Spring !",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":15,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "spring"
         ],
         "speakerIds":[
            1472
         ],
         "speakers":[
            {
               "speakerId":1472,
               "name":"Gildas Cuisinier"
            }
         ]
      },
      {
         "sessionId":1470,
         "scheduleId":-1400784948,
         "title":"Tester la persistance Java avec Arquillian",
         "summary":"La couche de persistance est une des parties les plus cruciales des applications en entreprise, et nous utilisons différents frameworks et patterns pour qu\u0027elle reste propre. Nous écrivons des requêtes sophistiquées et utilisons des techniques d\u0027optimisation pour fournir la meilleure expérience possible à nos utilisateurs.\r\n\r\nDans ce cas, pourquoi la persistance est-elle si souvent négligée lors des tests ? Est-ce vraiment aussi complexe et pénible à mettre en place ? Arquillian et sa Persistence Extension allègent cette charge pour que vous redeveniez un développeur heureux et productif. Venez assister à cette session pour constater qu\u0027écrire des tests pour vos accès aux bases de données est aussi facile que d\u0027écrire des tests unitaires classiques. Ne vous attendez pas à beuacoup de slides, préparez vous plutôt à voir des démonstrations live.",
         "type":"Quickie",
         "theme":"Java, Java EE et Architectures",
         "roomId":16,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "javaee",
            "Testing",
            "jboss"
         ],
         "speakerIds":[
            447
         ],
         "speakers":[
            {
               "speakerId":447,
               "name":"Alexis Hassler"
            }
         ]
      },
      {
         "sessionId":1429,
         "scheduleId":0,
         "title":"Testing Java Persistence Layer Done Right with Arquillian",
         "summary":"The Persistence Layer is one of the most crucial parts of enterprise applications, and we use many different frameworks and patterns to keep it clean.  We write sophisticated queries and use optimization techniques to give our end users the greatest possible experience. \r\n\r\nSo why is Persistence very often skipped in testing efforts? Is it really that complex and painful to setup? The Arquillian Persistence Extension removes that burden and boilerplate to make you a happy and productive programmer again!  Join this session and see for yourself that writing tests for your database logic is as easy as writing normal unit tests! Don\u0027t expect too many slides, be prepared for live demos!",
         "type":"Quickie",
         "theme":"Java, Java EE et Architectures",
         "roomId":0,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "javaee",
            "Testing",
            "jboss"
         ],
         "speakerIds":[
            747
         ],
         "speakers":[

         ]
      },
      {
         "sessionId":1331,
         "scheduleId":-1400784948,
         "title":"TestNG, parce que vos tests le valent bien",
         "summary":"Attention, l\u0027abus de TestNG nuit gravement à la santé de vos bugs !\r\n\r\nLorsqu\u0027il s\u0027agit de créer des tests automatisés sur la JVM, on pense tout de suite à JUnit.\r\nMais avec la complexification des applications, et donc des méthodes de tests, JUnit n\u0027est plus à même de répondre à tous les besoins du développeur.\r\n\r\nQue propose donc TestNG qui manque à JUnit ?\r\nA travers ce Quickie et ses démonstrations, vous découvrirez les forces et originalités de cette librairie, qui rendra vos tests plus forts et plus soyeux !",
         "type":"Quickie",
         "theme":"Java, Java EE et Architectures",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Maven",
            "Testing",
            "Tools"
         ],
         "speakerIds":[
            1406
         ],
         "speakers":[
            {
               "speakerId":1406,
               "name":"Romain Linsolas"
            }
         ]
      },
      {
         "sessionId":1135,
         "scheduleId":118346504,
         "title":"The Productive Programmer",
         "summary":"The Productive Programmer consists of two parts: mechanics \u0026 practice. In the mechanics section, I identify 4 principles of productivity: acceleration, focus, automation, and canonicality. This session defines the principles and describes their use, but the primary focus of this workshop is real-world examples of how you can use these principles to make yourself a more productive programmer. The second part of this workshop covers 10 ways to improve your code, derived from the practices section. This workshop includes tons of examples, all culled from real-world projects.",
         "type":"Hands-on Labs",
         "theme":"Entreprises et pratiques",
         "roomId":19,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "patterns",
            "agile",
            "Methodology"
         ],
         "speakerIds":[
            276
         ],
         "speakers":[
            {
               "speakerId":276,
               "name":"Neal Ford"
            }
         ]
      },
      {
         "sessionId":1409,
         "scheduleId":-1371330143,
         "title":"(R)évolutionnez vos bases de données avec Liquibase !",
         "summary":"Nous sommes amenés quotidiennement à modifier et partager du code:\r\n\r\n    * refactoring et tests afin d’en améliorer la qualité,\r\n    * versioning afin de conserver et tracer ces changements.\r\n\r\nQu’en est-il côté base de données ? En êtes-vous encore à envoyer vos scripts SQL directement à l’exploitation ? Les avez-vous testés ?\r\n\r\nDirectement inspiré du livre “Refactoring Databases: Evolutionary Database Design”, Liquibase est un outil open-source qui permet de répondre à ces besoins essentiels.\r\n\r\nCette présentation se veut être une démonstration des forces de cet outil, de la création de structures de données à leur livraison sur plusieurs environnements en passant par les tests.",
         "type":"Quickie",
         "theme":"Entreprises et pratiques",
         "roomId":14,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Versioning",
            "DevOps"
         ],
         "speakerIds":[
            1614
         ],
         "speakers":[
            {
               "speakerId":1614,
               "name":"Florent Biville"
            }
         ]
      },
      {
         "sessionId":1458,
         "scheduleId":-1370341429,
         "title":"55 fonctionnalités de Java 7 dont vous n\u0027avez (probablement) pas encore entendu parler",
         "summary":"Invokedynamic, Coin, Fork/Join et NIO.2 sont souvent cités comme les principales améliorations de Java 7.\r\n\r\nIl en existe cependant bien d’autres. De la sécurité à Swing en passant par la localisation, Java 7 apporte en effet plusieurs centaines de nouveautés et améliorations à la plateforme.  A la manière des présentations \u0027Ignite\u0027, cette session présentera 55 nouveautés de Java 7... en 55 minutes! Quelque soit votre projet actuel, il y aura certainement quelques-unes pour vous.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":14,
         "experience":"EXPERT",
         "sponsored":false,
         "tags":[
            "Java7"
         ],
         "speakerIds":[
            184
         ],
         "speakers":[
            {
               "speakerId":184,
               "name":"David Delabassee"
            }
         ]
      },
      {
         "sessionId":1469,
         "scheduleId":-1370341429,
         "title":"A la découverte de JavaFX",
         "summary":"JavaFX 2 est la nouvelle technologie cliente pour Java. JavaFX est conçu pour fournir un environnement Java moderne qui raccourcit le temps de développement et simplifie le déploiement d’applications riche en données dans le milieu d’entreprise. Le dévelopment d’applications JavaFX fait désormais recours a des API Java et des\r\noutils et concepts de dévelopment familiers. Cette présentation vous donnera un apperçu de la riche fonctionnalité de JavaFX, ainsi vous permettra de découvrir comment marier les avantages techniques de HTML5 et de Java sur le côté client.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "javafx"
         ],
         "speakerIds":[
            1660,
            1732,
            1733
         ],
         "speakers":[
            {
               "speakerId":1660,
               "name":"Nicolas Lorain"
            }
         ]
      },
      {
         "sessionId":1444,
         "scheduleId":-1370341429,
         "title":"An Overview of Guava: Google Core Libraries for Java",
         "summary":"This talk will provide an overview of the Guava libraries (http://code.google.com/p/guava-libraries/), touching on topics such as collections, caching, hashing, primitives support, concurrency utilities, common annotations, string processing, I/O, math utilities, etc.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":16,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "google",
            "javase"
         ],
         "speakerIds":[
            1530,
            1714
         ],
         "speakers":[
            {
               "speakerId":1530,
               "name":"Kurt Kluever"
            },
            {
               "speakerId":1714,
               "name":"Kevin Bourrillion"
            }
         ]
      },
      {
         "sessionId":1198,
         "scheduleId":313117179,
         "title":"Analyse du code source",
         "summary":"Cette session sera l\u0027occasion d\u0027avoir une discussion ouverte autour de l\u0027analyse de code et notamment d\u0027évoquer son intérêt, l\u0027utilisation qui en est faite, l\u0027utilisation d\u0027outils comme Sonar ou autres.",
         "type":"BOF",
         "theme":"Entreprises et pratiques",
         "roomId":17,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "analysis"
         ],
         "speakerIds":[
            1032,
            1600
         ],
         "speakers":[
            {
               "speakerId":1032,
               "name":"Olivier Gaudin"
            }
         ]
      },
      {
         "sessionId":1145,
         "scheduleId":118346504,
         "title":"Android, A Quick Course",
         "summary":"Ce cours permet en 3h permet de prendre conscience des éléments essentiels de la programmation Android. \r\nPublic:Novices Android, Connaissance Java.\r\nL\u0027objectif est de présenter l\u0027ensemble des notions et des bonnes pratiques élémentaires de ce type de développement. Elle démystifie ce type de programmation et permet aux développeurs de se lancer dans la programmation Android en ayant en tête une vision globale du système et de son fonctionnement. L\u0027idée est de commencer par Android et le monde de l\u0027IT puis de partir d\u0027un projet minimaliste possédant une activité et d\u0027élargir la vision : Un projet simple, Ressource, Traitement (Handler, AsyncTask), DataBase, ContentProvider, SharedPreference, Service, WebView, Utilisation d\u0027un service Rest, les capteurs, Quelques Patterns de programmations, Problématique des tests, Gestion de projet (Junit, Maven, Hudson).\r\nUne ébauches du cours est fourni dans le champ Slides (c\u0027est un Draft)",
         "type":"University",
         "theme":"Web, Mobile et le Cloud",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "android"
         ],
         "speakerIds":[
            1569
         ],
         "speakers":[
            {
               "speakerId":1569,
               "name":"Mathias Seguy"
            }
         ]
      },
      {
         "sessionId":1140,
         "scheduleId":-1311205333,
         "title":"Android, Graphisme et Performance",
         "summary":"Découvrez l\u0027architecture graphique d\u0027Android et apprenez à développer des applications efficaces et optimisées. Cette session présenté par un des ingénieurs responsables du toolkit graphique d\u0027Android présentera également des outils et des astuces que vous pourrez utiliser pour créer de superbes applications.",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "android",
            "performance",
            "graphics",
            "mobile"
         ],
         "speakerIds":[
            132
         ],
         "speakers":[
            {
               "speakerId":132,
               "name":"Romain Guy"
            }
         ]
      },
      {
         "sessionId":1141,
         "scheduleId":233763720,
         "title":"Apache Buildr",
         "summary":"[fr]\r\nBuildr est un outil de build pour les applications destinées a la JVM. Buildr supporte Java, Scala, Groovy et autres langages et outils. Buildr allie la puissance et l\u0027expressivité du langage Ruby a un model de taches et de projets similaire a Apache Maven. \r\nCette session présentera Buildr ainsi que des solutions concrètes et pragmatiques aux problèmes de build fréquemment rencontrés.\r\n\r\n[en]\r\nBuildr is a modern build system for Java-based applications including support for Scala, Groovy and a growing number of JVM languages and tools. Buildr combines the expressiveness of the Ruby scripting language with a familiar dependency-based task execution model and project-level structure similar to Apache Maven. This session will introduce Buildr and demonstrate practical solutions to common build problems.",
         "type":"Tools in Action",
         "theme":"Languages alternatifs",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "groovy",
            "javase",
            "jruby",
            "JVM",
            "scala",
            "Tools"
         ],
         "speakerIds":[
            1405
         ],
         "speakers":[
            {
               "speakerId":1405,
               "name":"Alexis Midon"
            }
         ]
      },
      {
         "sessionId":1028,
         "scheduleId":-1429421632,
         "title":"Bâtir des applications web mobiles dans le Cloud avec Grails",
         "summary":"Les applications Web Mobile commencent a prendre de l\u0027importance dans le paysage des technologies mobiles. De nombreux framework \"client\" (jquery mobile, Sencha etc ...) facilitent leur développement mais tout l\u0027aspect \"intégration avec le backend\" est souvent négligé.\r\n\r\nAu cours de cette présentation, nous ferons le point sur la place du web mobile, l\u0027anatomie d\u0027une application web mobile puis rapidement nous entrerons dans le vif du sujet en bâtissant \"from scratch\" une simple application web mobile en mode \"speed scrum\" où en 5 sprints nous couvrirons l\u0027essentiel des concepts pour finir avec une application complète.\r\nNos armes seront : Grails et JQuery Mobile saupoudré d\u0027un \"Cloud\" d\u0027HTML5.",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":12,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "grails",
            "cloud",
            "HTML5",
            "agile",
            "mobile"
         ],
         "speakerIds":[
            863,
            1029
         ],
         "speakers":[
            {
               "speakerId":863,
               "name":"Sébastien Blanc"
            },
            {
               "speakerId":1029,
               "name":"Stephane Maldini"
            }
         ]
      },
      {
         "sessionId":1430,
         "scheduleId":169055205,
         "title":"Behind the Scenes of Day-To-Day Software Development at Google",
         "summary":"It is estimated that in the US alone, failed and troubled software projects waste $60-$70 billion per year. For that money, you could launch the space shuttle 100 times, build and deploy the entire 24 satellite GPS, and develop the Boeing 777 from scratch and still have few billion left over.\r\n\r\nIn my talk, I will not be analyzing what other companies do wrong. Instead, I will focus on explaining what Google does to reduce the development cost while speeding up releases and constantly delivering high quality software to our users.\r\n\r\nI will talk about the engineering and management structure at Google, then touch upon various software development workflow methodologies and then dive into the specifics of what software teams at Google do on a day-to-day basis.",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":12,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "google",
            "agile",
            "Methodology"
         ],
         "speakerIds":[
            1711
         ],
         "speakers":[
            {
               "speakerId":1711,
               "name":"Petra Cross"
            }
         ]
      },
      {
         "sessionId":1474,
         "scheduleId":159403533,
         "title":"Bienvenue à Devoxx France",
         "summary":"Accueil par les 4 organisateurs : Antonio Goncalves, Nicolas Martignole, José Paumard et Zouheir Cadi.\r\n\r\n- Présentation de Devoxx France, déroulement des 2 jours\r\n- Un mot pour les sponsors\r\n- Les speakers\r\n- La plateforme Parleys, les outils pour voir et revoir Devoxx France\r\n- Un mot sur le métier de Développeur et comment vivre notre passion",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Devoxx",
            "parleys"
         ],
         "speakerIds":[
            116,
            1395,
            1420,
            1089
         ],
         "speakers":[
            {
               "speakerId":116,
               "name":"Antonio Goncalves"
            },
            {
               "speakerId":1420,
               "name":"José Paumard"
            }
         ]
      },
      {
         "sessionId":1335,
         "scheduleId":169055050,
         "title":"BigData et Hadoop au secours de téraoctets de logs inexploitables chez l\u0027un des plus grands sites marchands du web européen",
         "summary":"Comment analyser chaque jour des téra de logs générés par plus de 600 JVMs en production, sans impacter leur fonctionnement ?\r\n\r\nNous vous présenterons durant cette session la solution Big Data 100% Open Source mise en place chez un des plus grands sites du web européen. Une architecture basée sur syslog-ng, Flume, Hadoop, MongoDb et Play!, qui n\u0027a rien à envier aux géants d\u0027outre-atlantique !\r\n\r\nVenez découvrir comment nous avons divisé par 20 le temps de détection et de traitement des incidents. Mais aussi comment BigData a permis de nouvelles utilisations des logs à la fois techniques et surtout métier, comme la détection des fraudes, l’analyse de traffic web, BI en temps réel, ...\r\n\r\nÀ travers ce retour d\u0027expérience, nous vous proposons de vivre, au coeur d\u0027une des plus exigeantes productions de France, la mise en place de ce projet digne des très grands du web.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":14,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Play",
            "NoSQL",
            "Hadoop",
            "MongoDB",
            "HDFS"
         ],
         "speakerIds":[
            1630
         ],
         "speakers":[
            {
               "speakerId":1630,
               "name":"Pablo Lopez"
            }
         ]
      },
      {
         "sessionId":1452,
         "scheduleId":313117179,
         "title":"BOF - Java",
         "summary":"L\u0027équipe des JavaCamp vous propose un BOF sur Java, en mode participatif (Barcamp ou Open Space)",
         "type":"BOF",
         "theme":"Java, Java EE et Architectures",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "Java7"
         ],
         "speakerIds":[
            1702,
            1682,
            1615
         ],
         "speakers":[
            {
               "speakerId":1702,
               "name":"Luc Bizeul"
            },
            {
               "speakerId":1682,
               "name":"Philippe Antoine"
            },
            {
               "speakerId":1615,
               "name":"François Ostyn"
            }
         ]
      },
      {
         "sessionId":1365,
         "scheduleId":879237894,
         "title":"BOF de la communauté Software Craftsmanship Paris",
         "summary":"Pour cette BOF de la communauté Software Craftsmanship Paris, nous constituerons un ou plusieurs groupes pour échanger sur des questions techniques, par exemple autour des approches de tests, ou pratiques telles que \"comment pratiquer le Software Craftsmanship dans un environnement indifférent ou hostile\", ou pour travailler en direct sur du code avec clavier et vidéo-projecteur. Comme à notre habitude le choix des sujets sera laissé aux participants en début de session.",
         "type":"BOF",
         "theme":"Entreprises et pratiques",
         "roomId":18,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "ATDD",
            "Testing",
            "TDD",
            "agile",
            "dojo",
            "Design"
         ],
         "speakerIds":[
            1532
         ],
         "speakers":[
            {
               "speakerId":1532,
               "name":"Cyrille Martraire"
            }
         ]
      },
      {
         "sessionId":1177,
         "scheduleId":248473051,
         "title":"BOF du Paris Scala User Group",
         "summary":"Le Paris Scala User Group organise chaque mois une réunion sur Paris, pour les développeurs intéressés par Scala. Venez découvrir au BOF la communauté Scala, échanger et discuter avec quelques speakers et les experts.",
         "type":"BOF",
         "theme":"Languages alternatifs",
         "roomId":17,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "scala"
         ],
         "speakerIds":[
            1555
         ],
         "speakers":[
            {
               "speakerId":1555,
               "name":"Alexis Agahi"
            }
         ]
      },
      {
         "sessionId":1384,
         "scheduleId":248473051,
         "title":"BOF Duchess France",
         "summary":"Créé en 2010 Duchess France est un JUG féminin ayant pour but de donner de la visibilité aux carrières des femmes dans l\u0027IT et de les inciter à participer à des conférences et à des projets d\u0027autoformation. \r\n\r\nL\u0027objet de ce bof sera de présenter les membres, les objectifs et les actions de Duchess France aux participants qui ne nous connaissent pas encore ou qui souhaiteraient en savoir plus et d\u0027échanger avec eux sur leurs attentes par rapport au groupe. \r\n\r\nLa présentation ci jointe a déjà été présentée dans plusieurs JUGs et servira \"d\u0027introduction\" à la discussion avec les participants.",
         "type":"BOF",
         "theme":"Entreprises et pratiques",
         "roomId":18,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Duchess"
         ],
         "speakerIds":[
            1654,
            1739
         ],
         "speakers":[
            {
               "speakerId":1654,
               "name":"Audrey Neveu"
            }
         ]
      },
      {
         "sessionId":1113,
         "scheduleId":118346504,
         "title":"CDI mis en pratique avec travers Seam Social et Weld OSGI",
         "summary":"Cette université propose une exploration pratique des fonctionnalités de CDI et de quelques extensions Seam 3 à travers le module Seam Social (solution d\u0027interconnexion aux réseaux sociaux).\r\nLes sujets suivants seront abordés :\r\n- Retour rapide sur la spécification CDI\r\n- Création et manipulation de Bean CDI\r\n- Création d\u0027extension CDI\r\n- Utilisation d\u0027événements CDI\r\n- Création de décorateurs et intercepteurs CDI\r\n- Extension de CDI pour une approche modulaire grace à Weld OSGI\r\n- Création d\u0027une appli web cliente se connectant à plusieurs services (Twitter, Facebook LinkedIn) avec JSF2\r\n\r\n\r\nDes sujets connexes seront aussi abordés :\r\n- Concepts liés à OSGI\r\n- Principes de fonctionnement du protocole d\u0027authentification OAuth\r\n- Présentation de JBoss Solder et Seam security\r\n- Présentation rapide des frameworks et de leur intégration en CDI : Scribe-java, Jackson\r\n- Présentation du framework de test Arquillian",
         "type":"University",
         "theme":"Java, Java EE et Architectures",
         "roomId":13,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "CDI",
            "JSF2",
            "JSON",
            "OAuth",
            "seam",
            "REST",
            "osgi",
            "javaee6",
            "Weld",
            "Twitter"
         ],
         "speakerIds":[
            618,
            966
         ],
         "speakers":[
            {
               "speakerId":618,
               "name":"Antoine Sabot-Durand"
            }
         ]
      },
      {
         "sessionId":1303,
         "scheduleId":-1429421632,
         "title":"Changeons la conception de nos applications grâce aux services Cloud",
         "summary":"Nous sommes cernés par des applications qui utilisent des services Cloud : DropBox, SlideShare, Kindle, NetFlix, Viadeo, etc\r\n\r\nPourquoi pas nous ? Pourquoi ne pas introduire des services Cloud dans nos applications et dans nos infrastructures ?\r\n\r\nDans cette session, nous verrons, notamment grâce à des démonstrations en live :\r\n * quels services Cloud sont à notre disposition,\r\n * les nouveaux usages que ces services offrent,\r\n * comment changer la conception de nos applications pour en tirer tout l\u0027intérêt sans sacrifier nos SLA et notre productivité,\r\n * comment ils impactent le cycle de vie des applications, les développements, la production mais aussi les budgets,\r\n * comment gérer la réversibilité pour ne jamais se retrouver verrouillé à des services dont nous ne maitrisons pas l’avenir",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":true,
         "tags":[
            "cloud"
         ],
         "speakerIds":[
            817
         ],
         "speakers":[
            {
               "speakerId":817,
               "name":"Cyrille Le Clerc"
            }
         ]
      },
      {
         "sessionId":1333,
         "scheduleId":233763720,
         "title":"Chouchoutez votre code JavaScript",
         "summary":"Avez-vous confiance dans le code JavaScript que vous livrez en production ?\r\n\r\nLorsque vous réalisez la mise en production de votre application web, vous êtes rassurés par vos tests qui assurent la qualité de votre code Java.\r\n\r\nMais qu\u0027en est-il de votre code JavaScript ?\r\nLes applications actuelles recourent de plus en plus au JavaScript pour proposer du contenu riche et dynamique.\r\nDe fait, il devient capital d\u0027accorder autant de soin au test du code JavaScript qu\u0027au code Java !\r\n \r\nAvec l\u0027aide de quelques compagnons bien choisis (Jasmine, Jenkins, Sonar...), nous construirons les bases d\u0027une intégration et amélioration continues destinées au code JavaScript.\r\n\r\nVous verrez qu\u0027il est alors possible de déclarer à votre code JavaScript tout l\u0027amour que vous avez pour lui !",
         "type":"Tools in Action",
         "theme":"Web, Mobile et le Cloud",
         "roomId":15,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "javascript",
            "Testing",
            "analysis",
            "Hudson"
         ],
         "speakerIds":[
            1406
         ],
         "speakers":[
            {
               "speakerId":1406,
               "name":"Romain Linsolas"
            }
         ]
      },
      {
         "sessionId":1070,
         "scheduleId":81407200,
         "title":"Client/Server Apps with HTML5 and Java",
         "summary":"The web application landscape is rapidly shifting back to a Client/Server architecture.  This time around the Client is JavaScript, HTML, and CSS in the browser.  The tools and deployment techniques for these types of applications are abundant and fragmented.  This session will teach you how to pull together jQuery, LESS, Twitter Bootstrap, and some CoffeeScript to build the Client.  The Server could be anything that talks HTTP but this session will use the Play Framework.  You will also learn how to deploy Client/Server web apps on the cloud using a Content Delivery Network (Amazon CloudFront) for the Client and a Cloud Application Provider (Heroku) for the Server.",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":12,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "javascript",
            "Play",
            "Heroku",
            "javase",
            "cloud",
            "HTML5",
            "PlayFramework"
         ],
         "speakerIds":[
            993
         ],
         "speakers":[
            {
               "speakerId":993,
               "name":"James Ward"
            }
         ]
      },
      {
         "sessionId":1108,
         "scheduleId":169055205,
         "title":"Cloud et PaaS: les développeurs reprennent le pouvoir",
         "summary":"Lors des 15 dernières années, le Web a changé le métier de développeur. De services principalement orientés vers l\u0027interne, développés sur des plateformes bien maîtrisés, à charge prévisible, l\u0027Internet impose aux développeurs de rapidement fournir de nouveaux services orientés clients, sur des standards en constante évolution et des charges rarement prévisibles. Néanmoins, la relation qu’ils entretiennent avec l\u0027infra. et les opérations IT, n\u0027a pas radicalement changé. Cette dichotomie entre recherche de stabilité d\u0027un côté et extrême vélocité de l\u0027autre est une constante source de friction et de manque de compétitivité.\r\nEntrez dans l\u0027ère du cloud qui remet les développeurs en position de contrôle de la chaine de valeur. Ce changement aura de fortes répercussions sur les métiers de l\u0027IT et des développeurs, au même titre que le passage des développeurs de mainframes aux serveurs Unix/Wintel. \r\nLors de cette présentation, nous discuterons de ce changement et de ce que devient le métier de développeur cloud.",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":13,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "PAAS",
            "cloud"
         ],
         "speakerIds":[
            1539
         ],
         "speakers":[
            {
               "speakerId":1539,
               "name":"Sacha Labourey"
            }
         ]
      },
      {
         "sessionId":1163,
         "scheduleId":81407200,
         "title":"Comment tester son idée et concevoir un prototype web en un minimum de temps ?",
         "summary":"Vous fourmillez d\u0027idées ? Vous en réalisez parfois quelques unes ? Et à chaque fois, vos projets n\u0027ont pas le succès escompté ou bien, vous arrêtez ces projets en court de route car ils vous demandent trop de temps de développement.\r\n\r\nDans un premier temps, je vais vous présenter différents moyens de tester votre idée (Customer Validation) et de l\u0027affiner en quelques heures. Les développeurs ont souvent tendance à ce précipiter vers un prototype alors qu\u0027un simple formulaire envoyé à quelques dizaines de personnes ou une discussion autour d\u0027un café avec la bonne personne et les bonnes questions peut déjà vous donner de précieuses informations et vous faire gagner beaucoup de temps.\r\nEnsuite, je vous présenterai des moyens de développer votre prototype le plus rapidement possible afin d\u0027obtenir des retours le plus tôt possible en faisant appel à des technologies adaptées au bootstrapping comme Ruby on Rails, Heroku, Twitter Bootstrap...",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":16,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Rails",
            "agile",
            "Twitter"
         ],
         "speakerIds":[
            1582
         ],
         "speakers":[
            {
               "speakerId":1582,
               "name":"Camille Roux"
            }
         ]
      },
      {
         "sessionId":1160,
         "scheduleId":233763720,
         "title":"Continuous deployement : Rackspace, Chef et capistrano en action",
         "summary":"Pour fasterize, nous avons mis en place un système de déploiement complet :\r\n- provisionning des machines sur le cloud (Rackspace)\r\n- configuration des machines avec Chef (en mode chef solo)\r\n- déploiement des applicatifs avec Capistrano\r\n\r\nCela permet de déployer une plateforme complète (3 applicatifs, 15 serveurs, monitoring et supervision) en quelques minutes.\r\n\r\nCette session vous propose une démonstration en live, et des questions réponses pour approfondir comment les outils ont été utilisés.",
         "type":"Tools in Action",
         "theme":"Java, Java EE et Architectures",
         "roomId":14,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "performance",
            "DevOps"
         ],
         "speakerIds":[
            1540
         ],
         "speakers":[
            {
               "speakerId":1540,
               "name":"Bertrand Paquet"
            }
         ]
      },
      {
         "sessionId":1096,
         "scheduleId":-1222639573,
         "title":"CQRS (Command and Queries Responsibility Segregation)",
         "summary":"La séparation des méthodes de commandes et de requetes (CQS) élimine les effets de bords indésirables et simplifie les systèmes. CQRS déplace cette idée au niveau architectural et apporte une nouvelle approche du Domain Driven Design. Cette séparation augmente le découplage, fournit de nouvelles opportunités de desgin dans les application distribuées et ouvre la voie vers une scalabilité accrue.\r\n\r\n(Et en anglais :)\r\nSplitting command methods from queries has proven to make systems simpler by avoiding unexpected side effects. CQRS moves this idea to an architectural level and gives a new way to approach Domain Driven Design. It provides loose coupling as well as new design opportunities to create distributed applications and opens a path to better scalability.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":12,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "scalable"
         ],
         "speakerIds":[
            1528
         ],
         "speakers":[
            {
               "speakerId":1528,
               "name":"Jérémie Chassaing"
            }
         ]
      },
      {
         "sessionId":1053,
         "scheduleId":-1371330143,
         "title":"CRaSH un shell pour étendre la plateforme Java",
         "summary":"CRaSH est un shell open source étendant la machine virtuelle java avec puissance et facilité. Un utilisateur peut se connecter au shell par les protocoles SSH ou Telnet.\r\n\r\nLes commandes de CRaSH sont écrites dans le language Groovy et peuvent être développées en temps réel, permettant d\u0027étendre le shell facilement et très rapidement. CRaSH est fourni avec un ensemble de commandes de bases tels que la gestion de thread, la gestion de log, l\u0027accès à la base de données ou JMX.\r\n\r\nLe quickie débutera par une courte introduction au shell montrant les fonctionnalités de base, le complètement automatique. Le partie principale du quickie montrera la création en temps réel d\u0027une commande CRaSH en Groovy, afin de démontrer la puissance et la facilité de CRaSH.\r\n\r\nLe publique ciblé est à peu près n\u0027importe quel utilisateur de la plateforme Java, il apprendra à créer rapidement une commande CRaSH pour interagir avec les resources de la machine virtuelles.",
         "type":"Quickie",
         "theme":"Java, Java EE et Architectures",
         "roomId":16,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "groovy",
            "javase",
            "VisualVM"
         ],
         "speakerIds":[
            1478
         ],
         "speakers":[
            {
               "speakerId":1478,
               "name":"Julien Viet"
            }
         ]
      },
      {
         "sessionId":1193,
         "scheduleId":-1340763616,
         "title":"De l\u0027open source à l\u0027open API avec Restlet",
         "summary":"L\u0027arrivée en force des APIs web ouvertes révolutionne notre façon de développer sur le Web, d\u0027une façon encore plus importante que l\u0027open source.\r\n\r\nNous expliquerons ce qu\u0027est une API web, ferons un tour d\u0027horizon des APIs les plus marquantes, des clés de leur succès et présenterons les principales solutions pour faciliter leur création, leur hébergement, leur gestion et leur utilisation. \r\n\r\nNous expliquerons plus en détail comment développer une API web RESTful en Java grâce à Restlet Framework, le premier projet open source pour le développement REST en Java qui sort sa version 2.1 accompagné du livre \"Restlet in Action\" publié par Manning.\r\n\r\nPour finir nous présenterons APISpark, une nouvelle plate-forme cloud tout-en-un pour les APIs web, basée sur Restet Framework.",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":12,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "REST"
         ],
         "speakerIds":[
            1599
         ],
         "speakers":[
            {
               "speakerId":1599,
               "name":"Jerome Louvel"
            }
         ]
      },
      {
         "sessionId":1134,
         "scheduleId":-601076355,
         "title":"De Runnable et synchronized à parallel() et atomically()",
         "summary":"Depuis 15 ans le modèle de programmation multithread de Java a suivi les évolutions des processeurs et les besoins grandissants des applications. La programmation multithread pose deux défis pour le développeur : paralléliser ses traitements, et assurer la cohérence de ses données, tout en exploitant au maximum la puissance de calcul des processeurs modernes. Mettre ces évolutions en perspectives permet de mieux comprendre où l\u0027on en est, pourquoi, et dans quelle direction se dirige-t-on. \r\n\r\nCette conférence commence par décrire ces défis précisément, ainsi que leurs enjeux. Elle expose ensuite les solutions techniques disponibles actuellement, que ce soit dans le JDK ou dans les API et frameworks de l\u0027écosystème Java.  De l\u0027API Java Threads des débuts, au Fork / Join de Java 7, et au parallel() en vue pour Java 8, de synchronized et volatile aux modèles de transactions logicielles et d\u0027acteurs, tout y passera, précisément et sans complaisance. \r\n\r\nUn peu l\u0027algorithmique viendra enfin illustrer le discours.",
         "type":"University",
         "theme":"Java, Java EE et Architectures",
         "roomId":12,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "Java7",
            "multicore",
            "Java8",
            "actors",
            "ForkJoin",
            "STM"
         ],
         "speakerIds":[
            1420
         ],
         "speakers":[
            {
               "speakerId":1420,
               "name":"José Paumard"
            }
         ]
      },
      {
         "sessionId":1188,
         "scheduleId":118346504,
         "title":"Developing, Deploying and Scaling in the Cloud with Play",
         "summary":"This university session will teach you how to develop with the Play Framework 2.0. You\u0027ll learn how to use GitHub and IntelliJ IDEA to quickly create a RESTful, scalable and stateless application. You\u0027ll develop web and mobile clients and deploy everything to the cloud. You\u0027ll learn how to scale your application, as well as use the latest techniques for leveraging HTML5 and JavaScript. If you bring your laptop, you\u0027ll have a working application that you can learn from and continue to develop after this session is over.",
         "type":"University",
         "theme":"Web, Mobile et le Cloud",
         "roomId":15,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "javascript",
            "Play",
            "Git",
            "Heroku",
            "HTML5"
         ],
         "speakerIds":[
            993,
            39,
            1640
         ],
         "speakers":[
            {
               "speakerId":993,
               "name":"James Ward"
            },
            {
               "speakerId":1640,
               "name":"Guillaume Bort"
            }
         ]
      },
      {
         "sessionId":1157,
         "scheduleId":110965483,
         "title":"DevOps : pas que pour gérer des serveurs",
         "summary":"Les outils de DevOps peuvent être très utiles pour gérer autre chose que des serveurs.\r\n\r\nDécouvrez comment gérer l\u0027automatisation d\u0027installation de postes sous Linux pour préparer un environnement adéquat pour des formations ou pour le développement.\r\n\r\nUne fois les postes installés, exploitez au maximum des machines virtuelles pour créer des environnements jetables (très utiles pour des formations), mais aussi des environnements prêts à l\u0027emploi avec tous les logiciels nécessaires et correctement configurés.\r\n\r\nAu cours de cette présentation, vous découvrirez comment une utilisation créative de Chef, VirtualBox et Vagrant permet de préparer une environnement adéquat en quelques minutes.",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":16,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "DevOps"
         ],
         "speakerIds":[
            1577
         ],
         "speakers":[
            {
               "speakerId":1577,
               "name":"Jérôme Bernard"
            }
         ]
      },
      {
         "sessionId":1143,
         "scheduleId":118346504,
         "title":"Extreme Startup",
         "summary":"Cet atelier vous propose de jouer le rôle d\u0027une équipe de R\u0026D chargée du développement d\u0027un produit et de sa mise sur le marché. Chaque équipe doit coder un logiciel qui est en compétition avec celui des autres équipes pour répondre le mieux aux attentes du marché. Tout au long de la séance vous avez la possibilité d\u0027améliorer votre produit en fonction de l\u0027évolution des demandes des utilisateurs. Bien sûr, plus vous livrez tôt, plus vous accumulez de parts de marché, mais attention à la dette technique qui risque de vous empêcher de négocier des virages! \r\n\r\nL\u0027atelier a une durée de 3 heures et a déjà été proposé à XP Day 2011 (Londres) et XP Day 2011 Benelux, avec un grand succès. Aucun langage ni outil n\u0027est imposé mais il est nécessaire de disposer d\u0027un portable par équipe avec un environnement de développement pré-installé et un accès réseau wifi. Les participants sont libres de s\u0027associer en binômes, trinômes ou toute autre configuration.",
         "type":"Hands-on Labs",
         "theme":"Entreprises et pratiques",
         "roomId":18,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "agile"
         ],
         "speakerIds":[
            1447,
            1565
         ],
         "speakers":[
            {
               "speakerId":1447,
               "name":"Arnaud Bailly"
            }
         ]
      },
      {
         "sessionId":1312,
         "scheduleId":-1222639573,
         "title":"Faire (bien) tourner Java en environnement virtuel et cloud.",
         "summary":"Cette session partage plusieurs méthodes et conseils pour faire bien tourner Java en production en environnement virtuel et cloud notamment VMware vSphere et vCloud.\r\nVous avez toujours voulu savoir comment choisir entre grosse JVM ou petites JVM, dans une ou plusieurs VM, quel mémoire pour la heap, quel mémoire pour la VM? En quoi l\u0027API Java permet de manipuler les VM, peut-on assurer une scalabilité horyzontale les yeux fermées ou faut-il allez parler (et de quoi!) avec l\u0027administrateur de serveurs virtuels?\r\nCette session présentera également ce que réserve l\u0027avenir avec des GC Java optimisés sur environmement virtuel, une simplification de la scalabilité horyzontale, et une industrialisation du déploiement d\u0027architecture n-tier en mode cloud.",
         "type":"Conference",
         "theme":"Java, Java EE et Architectures",
         "roomId":13,
         "experience":"SENIOR",
         "sponsored":true,
         "tags":[
            "javase"
         ],
         "speakerIds":[
            1669
         ],
         "speakers":[
            {
               "speakerId":1669,
               "name":"Alexandre Vasseur"
            }
         ]
      },
      {
         "sessionId":1179,
         "scheduleId":313117179,
         "title":"Introduire Java avec Alice et Greenfoot",
         "summary":"Les programmeurs ont à leur disposition deux logiciels gratuits, Alice et Greenfoot pour enseigner Java aux débutants et aux élèves de collèges, lycées ou universités. Cette session présente ces deux interfaces simples pour enseigner Java. Avec des techniques d’enseignements differentes, Alice utilise une interface 3 dimensions alors que Greenfoot a une interface 2 dimensions. Leur but est d’intéresser les jeunes à programmer en simplifiant l’apprentissage du language et en donnant la satisfaction aux novices de créer des jeux et animations facilement. Ils sont utilisés dans des ateliers pratiques pour des étudiants sans connaissance de Java, par exemple pour des étudiants en première année universitaire d’études informatiques. Cette session couvrira aussi les resources éducatives disponibles.",
         "type":"BOF",
         "theme":"Java, Java EE et Architectures",
         "roomId":19,
         "experience":"SENIOR",
         "sponsored":false,
         "tags":[
            "javase"
         ],
         "speakerIds":[
            1137,
            527
         ],
         "speakers":[
            {
               "speakerId":1137,
               "name":"Yolande Poirier"
            }
         ]
      },
      {
         "sessionId":1459,
         "scheduleId":199531243,
         "title":"Java à Murex: un retour d\u0027expérience",
         "summary":"Découvrez l\u0027impact de Java sur le développement d\u0027un des éditeurs les plus important dans la Finance. \r\n\r\nMurex est le leader mondial sur les applications type front-to-back, cross-asset trading system et le deuxième éditeur de logiciel en France. Alors que ses logiciels étaient au départ écrit en C et C++, depuis 10 ans Murex a basculé vers l\u0027utilisation de Java.\r\n\r\nCette présentation vous montrera l\u0027impact de Java sur nos produits, ses forces et ses faiblesses sur notre marché, les conséquences pour notre organisation, les systèmes de gestion de version et de release et l\u0027environnement de développement de nos équipes, qui nous permettent aujourd\u0027hui de continuer à assurer notre croissance.",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":true,
         "tags":[
            "scrum",
            "javase",
            "DevOps",
            "agile"
         ],
         "speakerIds":[
            1720,
            1735
         ],
         "speakers":[
            {
               "speakerId":1720,
               "name":"Craig Morrison"
            }
         ]
      },
      {
         "sessionId":1446,
         "scheduleId":205190307,
         "title":"Tester une application Web avec Selenium 2, Selenium Grid et TestNG",
         "summary":"Comment tester une application Web ?\r\n\r\nNous aurons l\u0027occasion de creuser en profondeur la question en étudiant les outils mis à notre disposition que sont Selenium WebDriver, TestNG et surtout Selenium Grid.\r\nSelenium est un outil qui a su s\u0027imposer comme la solution open-source la plus efficace sur le marché. Il permet d\u0027effectuer des tests fonctionnels/d\u0027acceptance sur les applications web et mobiles. Avec Selenium Grid, vous allez pouvoir distribué les tests sur plusieurs machines et diminuer les temps d\u0027execution des plans de tests. Mais il va beaucoup plus loin : en permettant, de manière simple de gérer plusieurs environnements, incluant des multiples combinations de browsers/OS, il s\u0027impose comme un outil efficace . Combiné avec un framework de test spécialisé dans le parallelisme tel que TestNG, on obtient une suite robuste et efficace, qui nous permet de nous consacrer sur l\u0027essentiel.",
         "type":"Tools in Action",
         "theme":"Web, Mobile et le Cloud",
         "roomId":13,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "Selenium",
            "Testing"
         ],
         "speakerIds":[
            1393
         ],
         "speakers":[
            {
               "speakerId":1393,
               "name":"Mathilde Lemee"
            }
         ]
      },
      {
         "sessionId":1354,
         "scheduleId":-1370341429,
         "title":"The Kotlin Programming Language",
         "summary":"Kotlin is a new statically typed programming language developed by JetBrains, targeting JVM and JavaScript. Kotlin on the JVM is designed to be fully Java compatible, and at the same time safer, more concise than Java and not requiring a PhD to fully understand. Kotlin is developed with IDE support from the very beginning.\r\n\r\nKotlin is currently available as a preview release at http://www.jetbrains.com/kotlin/\r\n\r\nDuring the presentation, we will give an overview of the language and demonstrate the IDE support capabilities. The features we’re planning to cover include:\r\nfirst-class functions (closures);\r\nextension functions;\r\noperator overloading;\r\npattern matching;\r\nnull safety and automatic casts.",
         "type":"Conference",
         "theme":"Languages alternatifs",
         "roomId":12,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "JVM"
         ],
         "speakerIds":[
            1675
         ],
         "speakers":[
            {
               "speakerId":1675,
               "name":"Dmitry Jemerov"
            }
         ]
      },
      {
         "sessionId":1075,
         "scheduleId":313117179,
         "title":"Tribulation d\u0027un développeur Java dans le Cloud",
         "summary":"Comme beaucoup de développeurs une grande partie de mon temps libre est utilisé pour découvrir de nouvelles technologies et développer des applications avec celles-ci.\r\nJ\u0027ai donc choisi de découvrir le développement d\u0027application Java sur le cloud, avec Google AppEngine, pour créer le site http://www.resultri.com qui permet de gérer les resultats de triathlon (mon autre passion).\r\nDévelopper cette application est une aventure interessante que je partage avec vous durant ce BOF:\r\n - découverte de GAE et des outils de developpement\r\n - les \"surprises\" du NoSQL, surtout pour un cerveau \"cablé relationnel comme le mien\"\r\n - hmmm tout n\u0027est pas gratuit?\r\n - les quelques trucs à savoir : l\u0027importance de memcache, utilisation de CloudSQL, les batchs....",
         "type":"BOF",
         "theme":"Web, Mobile et le Cloud",
         "roomId":18,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "GAE",
            "cloud",
            "REST",
            "Twitter"
         ],
         "speakerIds":[
            1505
         ],
         "speakers":[
            {
               "speakerId":1505,
               "name":"Tugdual Grall"
            }
         ]
      },
      {
         "sessionId":1064,
         "scheduleId":51829387,
         "title":"Voxxr: Ze Highly Interactive Talk",
         "summary":"Une séance hautement interactive pour découvrir ce qui il y a sous le capot d\u0027un nouveau service qui permet de faire passer un talk en version 2.0 : le talk participatif. Partagez en temps réel vos impressions grâce à l\u0027appli iPhone / Android et prenez même le contrôle du déroulement de la session ! Et au passage découvrez comment ce service a été développé exclusivement pour DevoxxFR ! Au menu : HTML5, WebSocket / Atmosphere, Canvas / ProcessingJS, jQuery, PhoneGap, Cassandra, Amazon Web Services, ...",
         "type":"Conference",
         "theme":"Web, Mobile et le Cloud",
         "roomId":14,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "javascript",
            "Cassandra",
            "websockets",
            "iPhone",
            "android",
            "jQuery",
            "HTML5"
         ],
         "speakerIds":[
            924
         ],
         "speakers":[
            {
               "speakerId":924,
               "name":"Xavier Hanin"
            }
         ]
      },
      {
         "sessionId":1467,
         "scheduleId":-1429421632,
         "title":"Web Oriented Architecture, une transmutation des pratiques de construction des SI",
         "summary":"Un système d’information moderne supporte des charges transactionnelles lourdes, s’adapte mécaniquement à l’augmentation du nombre d’utilisateurs, surfe sur l’innovation technologique, est totalement ouvert vers l’extérieur tout en étant sécurisé en profondeur, et surtout s’adapte en temps réel à des coûts maîtrisés aux évolutions et contraintes du business.\r\n\r\nCes SI sont fondés sur les concepts de la WOA (Web Oriented Architecture) et ne font plus usage des pratiques traditionnelles de type “Enterprise” : pas de “Enterprise Architecture”, pas de “Enterprise Application Server” ni de “Enterprise Service Bus”. Pas besoin de Flash ou autres plugins tels que JavaFX et Silversight pour créer des interfaces utilisateurs interactives.  Ni de protocoles RPC lourds basés sur plusieurs couches de XML pour les échanges métier. Ces architectures sont nativement multi-canales et s\u0027adaptent naturellement aux nouvelles contraintes de mobilité.",
         "type":"Conference",
         "theme":"Entreprises et pratiques",
         "roomId":16,
         "experience":"NOVICE",
         "sponsored":false,
         "tags":[
            "web20"
         ],
         "speakerIds":[
            1725
         ],
         "speakers":[
            {
               "speakerId":1725,
               "name":"Habib Guergachi"
            }
         ]
      }
   ],
   "version":1
}